[
	{
		"title": "Game",
		"tags": "",
		"body": "<<BlackScreen>> <<NoOne>> \nI feel myself beginning to slip away.\n<<Date>> <<BedroomMorning>>\nMy room.\nI’m back in it.\n<<Ain'tHappening>>\nI suppose I got teleported back here when we left the eighth day.\nI wonder how that looks to other people.\nDo they just see me getting randomly teleported back to my bed?\n...\nI feel good.\nYou could say I feel great, actually.\nLast night, I mean, yesterday, was really intense.\nBut it was…\n…worth it…\nI feel like I’ve just had a massive weight taken off my shoulders.\nI feel like…\n…I can do this.\nI’ve made up my mind.\nI’m confessing to Katie today.\nJust like I said I would.\nI actually think that stress was just coming from uncertainty.\nI keep going on about how awful I am and how I'll just hurt Katie.\nAnd I had already confronted those feelings and thoughts and overcame them.\nBut I think I was still concerned.\nConcerned about the very possible possibility of something going wrong.\nAnd I think those inner-demons I was fighting were the stragglers; the negative thoughts of doubt still left over in my mind.\nBut they’re gone now.\nI’m going to do this.\nOur relationship will have ups and downs, but it’s all going to be okay in the end.\nThose negative thoughts weren't exactly about doubting something going wrong during our relationship, but about something going wrong during our relationship leading to something much worse happening.\nBut God’s here for me.\nIt’ll all be okay in the end.\nI am still curious though.\nWhy is the eighth day there?\nWhy can only teenagers with strong negative emotions experience it?\nI guess there’s no point in thinking about it right now.\nI leap out of bed.\nWell at least I try, but something pulls me back down to my bed everytime I try to get up.\n<<MusicStop>> \nI turn to my left and see the cause of this: Katie.\nShe’s in my bed; her arms wrapped firmly around me.\n...\nThis is bad.\nLike, really bad.\nI don’t suppose I have to explain why.\nWait, if Katie’s in my bed, then that must mean…\nI turn to my right.\n<<TheWay>> <<Kishimoto>> <<ScreenShake>> \nAAAAAAHHHHHHHH FUCK!\n<<NoOne>>\nI’m sleeping with Fujinami.\nWhich means Fujinami is also technically sleeping with Katie.\n<<FujinamiAppear>> <<Fujinami>> <<FujiNormal>> \nHuh? Where am I?\n<<FujiShocked>>\n...\n…Bl… b-bluh… yuh.\n<<Kishimoto>>\nFujinami, you’re a complete dickhead, you can’t be my friend anymore.\n<<Fujinami>> \n...\n<<FujinamiFades>> <<ScreenShake>> <<NoOne>> \nFujinami faints.\nKatie’s still fast asleep somehow.\nAll of sudden, I begin to hear my mom getting up.\nOh no.\nI summon all my strength and manage to free myself from her grip.\nI proceed to walk over to Fujinami and pick him up.\nI then bring him into my living room and throw him on the couch before opening the door to my backyard and carelessly tossing him into a bush.\nI then frantically sprint into my room and stuff Katie into my closet before my mom walks in.\n<<Mom>>\nHaruki? Can you and your friends make a bit less noise?\n<<Kishimoto>> \nHuh?\n<<Mom>>\nActually, where are your friends?\n<<Kishimoto>> \nMy friends? What do you mean?\n<<Mom>>\nFujinami and Katie obviously!\nYou guys were all having a sleepover. Remember? Where did they go?\n<<Kishimoto>>\nOh… yeah… the… sleepover, the one we had…\n<<NoOne>>\nHow come she magically knows who Katie is?\nIs this an effect of the eighth day?...\n<<Kishimoto>> \nYeah, um, Fujinami tried to sexually harass Katie and then we had to call the cops and there was that whole thing…\n<<Mom>>\nWhat?\n<<Kishimoto>> \nOh don’t worry, he didn’t get in any trouble. He was asleep and the police figured he couldn’t be held accountable for something he did while he was unconscious.\n<<Mom>>\nO-oh.\n<<Kishimoto>>\nYeah, and then Katie felt uncomfortable and went home.\n<<Mom>>\nO-oh wow. Sounds like… great fun…\n<<Katie>>\nHm… Kishimoto?...\nKishimoto?... Where are you?\n<<Mom>>\nHuh? What’s that?\n<<Kishimoto>>\nOh yeah… that’s um… a really advanced sex doll I own?\n<<NoOne>>\nI lean against the closet and try to put on a “cool” smile.\n<<Mom>>\nSorry, what?\n<<Kishimoto>>\nU-uh, um!\n<<NoOne>>\nI can’t exactly tell her that I threw Fujinami into a bush and stuffed Katie in my closet.\n<<Kishimoto>>\nWell, you see, during the time of puberty, boys can gain an innocent curiosity of the female body, which um… you know…\n…yeah, and… stuff…\n<<NoOne>> \nMy mom has what is probably the most distressed, shocked, and disappointed look on her face.\nAnd then, just as I begin to open my mouth…\n<<ScreenShake>> <<MusicStop>>\n*BANG*\n<<KatieAppear>> <<KatieShockedNormal>>\nKatie falls out of the closet onto me.\n<<Mom>>\n...\n<<Katie>>\n...\n<<Kishimoto>> \nI-I… I can explain…\n<<NoOne>>\nMy mom has the most shocked look on her face.\n<<Kishimoto>>\nUm you see…\n<<NoOne>> \nI don’t think I can really say I ran off to Tokyo with Katie and slept with her, to which us and Fujinami were transported to the secret eighth day of the week where we fought shadow monsters.\n<<Kishimoto>>\nThe sex doll also just happens to look exactly like Katie?…\n<<Mom>> \n...\nI’ll just… leave you two to it…\n<<NoOne>>\nShe leaves the room.\nI don’t think my mom bought the whole sex doll idea, which is both a blessing and a curse.\n<<Katie>>\n...\n<<Kishimoto>>\nUm…\nWe should kiss.\n<<NoOne>>\nWHAT THE HELL DID I JUST SAY?!\n<<Katie>> <<KatieShockedBlush>> <<ScreenShake>>\nUh, u-u-uh…!\n<<NoOne>> \nI am such an idiot.\nThat was the dumbest possible thing I could’ve said.\nI think it says quite a lot about me that when I found myself in a situation where Katie accidentally ended up lying on top of me, I impulsively asked for a kiss.\nHonestly, like, thank goodness I at least said it in Japanese-\n<<KatieFades>> <<Katie>> <<MusicStop>> \nHm…\n<<NoOne>>\nShe wraps her arms around me and presses her lips against mine.\nTime seems to completely stop.\nI’m paralyzed by the shock that finds itself briefly residing within my body.\nI… I\n<<IWillAlwaysLoveYou>> \nShe’s still going at it…\n...\nIt feels so warm…\nSo passionate…\nSo genuine…\n...\nI love her so much.\nI wrap my arms around her.\nAs tight as I can.\nI never want this moment to end.\nThis first kiss…\nI love her so much.\n<<RoadsideMorning>> \nWe walk silently next to each other on the way to school.\nOur heads both staring at the ground.\nI’m pretty sure Fujinami is still in that bush.\n...\nI’m going to confess to Katie later on today.\nKnowing her, she’ll probably say yes.\nThat, of course coupled with the fact I’m sure she likes me…\nI mean, if she didn’t, I don’t think she would’ve kissed me this morning…\n…or gone to Tokyo with me…\n…or stayed on that beach with me…\n...\nI feel so bad that everyone gave up on her.\nShe’s such a lovely person.\nI…\n...\nI’m going to confess in front of the whole school.\nI’ll scream my confession so loudly that everyone in town will be able to hear how much I love her.\nEveryone will see just how passionately I feel about this girl, that they might try to talk to her again…\nDuring lunch I’ll go out into the other courtyard, the one that everyone actually uses.\nThat’s where I’ll confess.\nI won’t think about my confession until I say it.\nThat way I won’t be nervous.\nAnd I think it’ll be more genuine that way.\nJust stating whatever I feel.\nWhatever comes to mind.\nThat’s what I’ll do.\n<<SchoolGate>> \nI stand outside the school gates with Katie.\nI clench my fist.\nI can do this.\n<<Hallway2>>\nWe climb up the steps leading up to the second-year classrooms before parting ways as usual.\nKaite walks off somewhat sullenly.\nI stand idly and watch her as she walks off into her classroom.\nShe stops at the door and turns her head back around to me.\nI don’t have any kind of smile on my face.\nFor whatever reason, I can’t seem to bring myself to smile at her.\nShe stands there at the door, watching me for a while before proceeding into her classroom.\nI do the same thing and walk into my classroom.\n<<ClassroomDay>> \nThe chatter of students fills the room.\nIt doesn’t feel as bubbly as usual; only helping to add to my unease.\nI sit somberly in my corner.\nNow that I’m listening closer, it actually seems as if everyone is discussing something of a serious nature.\nI attempt to listen into the conversation of a group of girls next to me.\n<<MusicStop>> <<Girl(A)>>\nIt’s so scary, isn’t it?\n<<Girl(B)>>\nI know!\n<<Babel>>\nI mean, they keep saying that it’s just a malfunction in their systems or whatnot, but they keep picking up the story.\nAnd it seems like everytime they do, new evidence pointing to the fact that it might actually happen is also announced.\nIt’s such bull! Honestly!\n<<NoOne>>\nWhat are they talking about?...\nSomething about their conversation does actually seem vaguely familiar.\nI don’t really keep up with current affairs, so I suppose it’s natural that I wouldn’t know.\nAnd usually I wouldn’t even care about whether I knew or not.\nBut this feels like something I probably should know about.\nFujinami is probably going to be late given his circumstances.\nThe teacher walks in and orders for everyone to sit back down in their seats and cease chat.\nThey comply and he begins talking.\n<<ClassroomDay>>\nEnglish class begins.\nWe all silently wait for a teacher to come in.\n<<ClassroomDay>>\nThe door opens and the principal walks in after around five-or-so minutes.\n<<Principal>>\nHello children.\n<<NoOne>>\nEveryone intently stares at him.\n<<Principal>>\nEnglish class shall not be taking place today as a replacement for Domen-san is yet to be found.\nInstead of English class, I shall be talking to you today.\n<<NoOne>>\nI don’t really care about what he has to say, but it’s not like I have anything better to be doing.\n<<Principal>>\nSo some of you may be aware of the disaster that’s predicted to potentially occur…\n<<NoOne>> \nDisaster?...\nIs this what those girls were talking about?...\nActually, now that I think about it, I do sort of remember hearing something about some kind of natural disaster on the news.\nBut they said it was just their system or whatever malfunctioning, right?\n<<Principal>>\nNow, while the media and scientists have been saying that’s this is nothing more than a hoax, there-\n<<NoOne>>\nThe class door opens, interrupting the principal.\n<<Teacher>>\nSir, we really need you right now…\nThere’s been a change of plans regarding escape procedures…\nThis damn government can’t make up their mind!\n<<Principal>>\nVery well…\nI apologize children…\nThis is nothing to worry about.\nPlease remain calm.\n<<NoOne>>\nThe random member of staff I’ve never seen before and the principal both exit the classroom together.\nYou know, when you tell someone to be calm, that really makes it feel like something’s up.\nAnd I’m definitely not the only person who feels that way too…\nThe atmosphere in the classroom is filled with tension.\nFujinami isn’t in my class, he just always barges in and forces me to have a conversation with him whenever he can.\nBut I can assure you, if he was here right now, he’d be bawling.\nThe principal didn’t finish talking to us, but that makes me wonder…\n…did he talk to any other classes?\nIf he did, it must’ve at least been class 2-1, considering we’re class 2-2.\n…Katie’s in that class.\nI suppose I could ask her about it?\nAh crap, I’m forgetting the thing at hand here!\nMy confession!\nI can’t be getting distracted here.\n<<ClassroomDay>> \nIt’s third period now and lunch is drawing closer.\n...\nThis is weird.\nI’ve forgotten English just as suddenly as I magically learned it.\nThat coupled with the fact that it’s obviously embarrassing confessing your undying love for someone in front of an entire school's worth of people makes me extremely tense.\nGranted, everyone’s probably more concerned with this whole disaster thing or whatever.\nNevertheless, I can’t go back on my word now.\nNot after I’ve made all these promises to her, and myself.\nI must do this.\nNo matter what.\n<<ClassroomDay>>\nIt’s lunch time now.\n...\nI get up from my chair and walk into the courtyard.\n<<MainCourtyard>> <<MusicStop>>\nI stand there, staring blankly into the windows.\n<<FaithLoveAndDeath>> \nFrom this far away it looks as if there’s nothing other than a black void on the other side.\nI survey my surroundings.\nThere are people everywhere.\nI don’t know if it’s just my imagination but, there actually seems to be more people than what there usually is here today.\nI take a deep breath.\nI stare at the school building.\nI take one last deep breath.\nThe last breath before I confess.\n...\n<<Kishimoto>> <<ScreenShake>> \nKATIE!\n<<NoOne>>\nEveryone turns to me in unison.\nIncessant whispering can be heard from every direction.\nI can’t hear them, but I know exactly what they’re saying nevertheless.\nI feel like I’m being judged.\nActually, I don’t feel like it, I know it.\nI’m being judged.\nBut I don’t care.\nI’m doing this.\n<<Kishimoto>>\nI'M GOING TO BE FULLY HONEST HERE!\nWHATEVER I SAY IS THE TRUTH!\n...\nI’VE ALWAYS FELT LIKE AN OUTSIDER!...\nLIKE I DON’T BELONG!...\nI’VE FELT LIKE I’VE NEVER HAD A PURPOSE!...\nACTUALLY, FOR THE LONGEST TIME, I GENUINELY BELIEVED THAT I HAD NO PURPOSE!...\nTHAT I WAS DOOMED TO WORK A 9-5 AND LIVE A DEPRESSING, WORTHLESS LIFE!\nTHAT I WAS NOTHING BUT A COMPLETE WASTE OF TIME!\nAND THEN I MET YOU!\nI’D LOVE TO SAY WE SAT AND TALKED TO EACH OTHER FOR HOURS AT A TIME BUT,\nTHAT WOULD BE A COMPLETE LIE!\nWE ACTUALLY JUST SAT IN SILENCE EVERY BREAK!\nBUT UM!...\nTHERE’S A REASON I STILL WENT TO YOU EVERY BREAK!\nAT FIRST I JUST FELT LIKE IT WAS MY RESPONSIBILITY TO HELP YOU!\nBUT OVER TIME, I BEGAN TO JUST ENJOY YOUR COMPANY!\nI ENJOYED JUST SITTING THERE WITH YOU EVERY BREAK!\nLISTENING TO THE CHATTING IN THE DISTANCE, THE BIRDS CHIRPING, AND FUJINAMI’S INCESSANT SCREAMING!\nI LOVED EVERY SECOND OF IT!\nWE SLOWLY BECAME FRIENDS AND YOU JUST MADE ME SO HAPPY!\nYOU SHOWED ME TRUE HAPPINESS!\nYOU SHOWED ME WHAT I TRULY WANTED!...\nWHAT I WANTED WAS!...\n...\n<<ScreenShake>> \nIT WAS YOU KATIE! I WANT YOU!\n<<ScreenShake>> \nI LOVE YOU!\nBUT I COULDN’T TELL YOU OUT OF FEAR THAT I’D HURT YOU SOMEDAY!\nI NEVER WANT TO SEE YOU SUFFER!\nAND IF YOU SAY YES, YOU INEVITABLY WILL!\nBUT WE’LL… WE’LL BE HAPPY!\nBECAUSE YOU MAKE ME HAPPY!\nWE MAY HAVE OUR TOUGH TIMES BUT!...\nYOU HELPED ME OVERCOME THE BIGGEST OBSTACLE IN MY LIFE!\nAND I LOVE YOU KATIE!\n*pant* *pant*\n<<ScreenShake>>\nI LOVE YOU!!\n<<NoOne>>\nI have a headache now.\n<<MusicStop>> \nOnce I stop shouting, no other voices can be heard.\nEveryone is in shock.\nI wait briefly.\nShe doesn’t appear.\nShe doesn’t shout back.\nShe is not seen nor heard.\n...\n<<Kishimoto>>\nHa… heh…\n<<NoOne>> \nI laugh.\nShe probably doesn’t even exist anymore does she?\nI’ll go back home and find out nobody lives in the house on the far right.\nAnd that no one ever has.\nI wouldn’t be surprised if that is the case.\nThat’s just my luck.\nI meet this wonderful girl, and I can never tell her how I feel.\nIn all actuality I probably will see her again today.\nI won’t be able to smile when I watch her walk into her house.\nI won’t be able to smile until we’re together.\nIf we never become a couple, then it really is true I serve no purpose in life.\n<<Kishimoto>> \n*sigh*\nCome on, man.\nI just said that all in Japanese…\n…there’s no way we’ll ever be together…\n…I’ve just embarrassed myself, haven’t I?\n<<NoOne>>\nIt feels as if time has stopped once again.\nThis time just to mock me.\nNot to let me soak in any sort of blissful emotions…\nJust to let me feel even more miserable than what I am.\n...\nSilence\nThat’s all that can be heard.\nThe sound of silence.\nIt’s an awful sound.\nNothing good ever happens when there’s silence.\n...\nI don’t even know what to say.\n...\n<<Kishimoto>>\nHuh?\n<<NoOne>>\nI suddenly hear whispers again?\nBut it doesn’t feel like they’re anything about me.\n<<LovelyHorizon>>\nI turn to see people actually pointing somewhere.\nI turn my head to the direction where they’re pointing and…\n<<KatieAppear>> <<KatieSmile1>> <<Katie>> \n...\n<<NoOne>>\nShe’s standing there.\nSmiling\nA tear sheds from her eye.\n<<KatieFades>>\nShe runs up to me and embraces me.\n<<Katie>>\nI love you too Kishimoto…\n…I love you so much…\n…I never want to leave you…\n<<NoOne>> \nShe says it all in Japanese.\nI figure her suddenly being able to speak native-level Japanese is some weird result of the eighth day…\n…or God.\nThat would also explain how she understood me this morning.\nWhispers can be heard from all around us.\nWe pay no attention to them though.\nI wrap my arms around Katie and embrace her equally as tightly.\nWe both begin to cry.\nThey’re happy tears though.\nYou’re just able to kind of tell.\nThe fact that we’re also both smiling probably aids in that assumption.\n<<KatieAppear>> <<KatieSmile1>> \nAll of a sudden, we’re given a standing ovation and we stop hugging to face the crowd.\nI’m not too sure exactly what they’re clapping for, but it makes me happy nevertheless.\nThe seemingly pleased crowd helps to add to my feelings of joy.\nThis is the best day of my life.\nI don’t think it gets much better than this for me.\nStanding here, with the person I love most, everyone around us seemingly happy about our happiness.\nThis is probably the best possible way to start off a relationship.\nI turn to Katie and give her a warm smile.\nShe gives a smile back.\n<<Hallway1>>\nAs I walk through the hallways, I'm overwhelmed with an onslaught of praise.\nIt's extremely surreal having this much people talk to me.\n<<Boy(A)>> \nYo, congrats my man!\n<<Boy(B)>>\nYeah, awesome dude! Hope you’re happy together!\n<<Kishimoto>>\nOh thanks guys!\n<<Girl(A)>>\nHey Kishimoto-san! Good for you!\n<<Girl(B)>> \nYeah, I don’t know how you got with her like that! I mean, I struggled to even be friends with her!\n<<Kishimoto>>\nOh, heh, thanks.\n<<Girl(A)>> \nHey, did you teach her Japanese? It seems so.\n<<Kishimoto>>\nOh, yeah no, I did.\n<<NoOne>> \nI say that for her sake.\n<<Girl(A)>> \nHuh, maybe we should give another go at being her friend, Tanaka?\n<<Girl(B)>> \nYeah, we should!\nA new friend would probably take our mind off this whole disaster thingy as well…\n<<NoOne>>\nThe first girl turns away from her friend back to me.\n<<Girl(A)>> \nThanks Kishimoto-san!\n<<Kishimoto>> \nOh uh, yeah. No problem.\n<<NoOne>>\nThey thank me once again and run off.\n<<Hallway2>>\nI continue being thanked and congratulated as I walk through the hallways.\n<<FujinamiAppear>> <<FujiNormal>> <<Fujinami>>\nHuh?\n<<FujiLuagh>> \nOh, yo, Kishimoto! I heard the big news!\n<<FujiSmug>> \nHonestly, I have to say, I kinda saw it coming from a mile away.\n<<FujiLuagh>>\nI mean, you guys are like, the most perfect couple I’ve ever seen.\n<<Kishimoto>>\nHey, thanks man!\n<<NoOne>>\nA comment that would usually piss me off instead makes me happy.\nI actually feel happy to see Fujinami for once.\nI guess I should probably be more grateful that I have a friend who likes me so much.\n...\n<<Kishimoto>>\nHey Fujinami, wanna come over to my house and play video games tomorrow?\n<<Fujinami>> <<FujiShocked>> \nHuh?\n...\n<<FujiSmile2>> \nYeah, sure dude!\n<<NoOne>>\nFor once he doesn’t seem completely dead-shocked at such a question.\n<<Kishimoto>>\nYeah? Well I’ll see you then I guess!\nJust come over whenever you want, ‘kay?\n<<Fujinami>> <<FujiSmile1>>\nYep! See ya!\n<<Kishimoto>>\nBye!\n<<NoOne>>\nKind of surprised that he accepted so casually when he literally woke up in my bush this morning.\nWhat even ended up happening with that?\nDid he just like, casually stroll out of my house and go to school?\nI mean, he seems to be in good form.\n<<FujinamiFades>>\nI walk off.\n<<Hallway2>>\nAs I walk out of school, I seem to have every student in the school congratulate and thank me.\nI’ve never had this many people talk to me in a single day, ever.\nAm I… actually popular now?\nMy smile’s too big for my face.\nIt doesn’t get much better than this, does it?\n<<BlackScreen>>\nI walked home with Katie, making chit-chat about nothing in particular.\nShe was latched onto my arm seemingly the entirety of the way home.\n...\n<<MusicStop>>\nI love her.\n<<Date>> \nThe light pours into my room as always.\n<<LovelyHorizon>>\nI get up out of bed and begin my morning routine as is typical.\n<<RoadsideMorning>>\nI stand idle on the side of the road, looking out onto the sea as I wait for Katie.\n<<KatieAppear>> <<KatieSmile2>> <<Katie>>\nGood morning!\n<<Kishimoto>>\nMorning!\n<<NoOne>>\nWe begin to walk down the road to school.\n<<Kishimoto>>\nDamn, yesterday was crazy.\n<<Katie>> <<KatieSmile1>>\nYeah…\n<<NoOne>>\nShe looks down to the ground with a smile on her face.\nI can’t help but be filled with warmth.\nI love her.\n<<Kishimoto>>\nA few girls were telling me that they might try to talk to you again.\n<<Katie>> <<KatieShockedNormal>> \nHuh? Really?\n<<Kishimoto>>\nWell I don’t see much reason to lie about their intentions over something like that.\n<<KatieSmile1>> <<Katie>>\n...\n<<KatieLuagh>>\nThat’s great news!\n<<Kishimoto>>\nHeh, glad to see you so happy about it.\n<<Katie>> <<KatieSmile1>>\nHey, Kishimoto?\n<<Kishimoto>>\nYou can call me by my first name, y'know. I’m fine with it.\n<<Katie>> <<KatieShockedBlush>>\nOh, r-really?\n<<Kishimoto>>\nYeah, go ahead, I mean, I always call you by your first name.\n<<Katie>> <<KatieShockedNormal>> \nW-well that b-because I’m American!\n<<Kishimoto>>\nAn American who lives in Japan nevertheless.\n<<Katie>> <<KatieNormal>>\nU-um okay then… um…\n<<Kishimoto>>\nHaruki. My first name’s Haruki.\n<<Katie>> <<KatieShockedBlush>> \nO-oh sorry! Kishi- I mean H-H-Haruki!\n<<Kishimoto>>\nHeh, it’s fine.\nAnyway, what was that thing you wanted to ask me?\n<<Katie>> <<KatieLuagh>> \nOh yeah!\n<<KatieSmile1>>\nRemember when we were in the eighth day and I told you about my experience?...\n<<Kishimoto>>\nHuh, yeah?\n<<Katie>>\nRemember when I said that you came to me after I’d successfully killed all the monsters?\n<<Kishimoto>>\nYeah?\n<<Katie>>\nWhen I said that I thought you were there to single-handedly solve my loneliness.\nWith just you, I mean.\n<<KatieLuagh>>\nBut it looks like I’ll have a few friends by the end of today!\n<<KatieSmile2>>\nThank you Haruki!\n<<KatieSmile1>>\nFor everything!\n<<Kishimoto>>\nO-oh yeah…\n<<NoOne>>\nNow I’ve realized.\nI didn’t have a purpose until Katie successfully completed the eighth day.\nAfter she did that, a purpose was given to me: to help Katie get over her loneliness.\nI guess my purpose was outside of society to some degree…\nWell, I suppose I’m fulfilling my purpose.\n...\nSomething about the whole “purpose being given to me” thing doesn’t sit right with me for whatever reason.\n<<SchoolGate>>\nWe arrive at the school gates and walk through.\n<<ClassroomDay>>\nIt’s been bothering me.\nWas I really given a purpose?\nIf a purpose was literally given to me after Katie defeated her shadows, then that would go against a lot of the stuff I’ve said.\nBut I think I’ve figured it out.\nNot only that, but I’m pretty sure I’ve got the eighth day figured out too.\nGod watches over us, and when he sees a child stuck in a difficult place in life, he allows them to enter the eighth day.\nThen, he causes some sort of miracle to happen after said child has defeated their shadows.\nA miracle that pushes us in the right direction towards creating a purpose.\nIt all makes sense, doesn’t it?\n<<ClassroomDay>>\nIt’s lunch break now.\n<<MusicStop>>\nThe atmosphere is very intense and no one is coming up to congratulate me or whatever.\nIt’s almost as if they just completely forgot about yesterday.\n<<FaithLoveAndDeath>> \nFair enough.\nI pull out my bento and walk to the courtyard.\n<<Hallway2>>\nWhile walking in the halls I actually see Katie.\nShe’s walking with a group of girls; the same group of girls who were talking to me yesterday.\n<<KatieAppear>> <<KatieShockedBlush>> <<Katie>>\nOh, hey Kishi- I mean Haruki!\n<<Kishimoto>> \nHey Katie!\n<<Girl(A)>>\nOh, are you guys referring to each other on a first-name basis now?\n<<Katie>> <<KatieSmile2>>\nO-oh yeah, ha ha.\n<<KatieSmile1>>\nOh yeah, sorry Kishimoto, I’m going to be eating with these girls today if that’s alright.\n<<Kishimoto>>\nHuh? Yeah of course it’s alright.\n<<Katie>> <<KatieLuagh>> \nOkay then! Bye!\n<<NoOne>> <<KatieFades>>\nShe scurries off.\nYou know, I said it was fine with me but…\n…it’s really not.\nDon’t get me wrong, I’m happy for her and all but…\n…I really just want to be with her right now.\nIt’d probably help just to take my mind off this whole other thing right now.\nI mean, don’t get me wrong.\nI definitely thought it was complete bullcrap.\nBut after what the principal said the other day, I’m starting to have my doubts…\n<<RoadsideSunset>>\nI’m currently walking down the road with Fujinami.\nIt feels like forever since I’ve done this.\nI think Katie’s hanging out with some of her new friends or something.\n<<Fujinami>> \nHey, so what are we going to play?\nI brought some of my own games with me.\n<<Kishimoto>>\nHuh? Well let's play one of those then.\nWhat do you have?\n<<Fujinami>> \nI’ll show you when we get to your house.\nLet’s just say they might be a little too “intense” to talk about in public.\n<<NoOne>> \nI don’t know what he means by “intense” but surely it can’t be good.\n<<BedroomEvening>> <<MusicStop>> \n...\n<<FujinamiAppear>> <<FujiSmug>> <<Kishimoto>>\nThese are all porn games…\n<<Idiot>> <<Fujinami>> \nAwesome, right?\n<<Kishimoto>>\nUm, no?\n<<NoOne>>\nI just remembered why I hate this guy.\n<<BedroomEvening>>\nWe ended up just settling on some generic military shooter I own.\nAfter a while of playing, Fujinami left and went home.\nDespite having literally done nothing today, I still feel really tired.\n<<MusicStop>>\nI decide to call it a day and head to sleep.\n<<Date>> <<BedroomMorning>> \nLike most people do, I wake up.\n<<Babel>> \nToday should be like any other, but I have this daunting feeling looming over me.\nIgnoring that, I enact my morning routine and leave for school.\n<<RoadsideMorning>>\nI walk down the road with Katie.\nThe eerie sound of silence divides us.\nOur footsteps, the crashing of the waves, the seagulls’ squawking and the picture-eqsue location only adds to my sinking feeling.\nIt just feels so… out of place?\nLike trouble in paradise I suppose.\n...\n<<Kishimoto>>\nHey Katie?...\n<<KatieAppear>> <<Katie>> <<KatieNormal>>\nHm?\n<<Kishimoto>> \nCan we um… go on a date tomorrow?\n<<Katie>> <<KatieShockedBlush>> <<ScreenShake>>\nWuhhhh~!?\n<<Kishimoto>>\nUm, I mean!- If you really don’t want to, that's okay!\nI just figured that since we’re dating and all…\n<<Katie>> \nO-oh no! I totally get it!\n<<KatieSmile2>>\nNo, I would love to! You just caught me a bit off guard, sorry!\n<<Kishimoto>>\nHa ha, no that’s… fine…\n...\n<<NoOne>>\nI can’t help but feel that it looks like Katie has something on her mind.\nShe looks guilty, almost.\nLike she’s hiding something from me.\nI’m unsure of whether I should ask her about this or not.\n...\nIt’d probably do more harm than good if I didn’t.\n<<Kishimoto>>\nHey um, Katie?\n<<Katie>> <<KatieNormal>>\nY-yeah?\n<<Kishimoto>>\nAre you… hiding something from me?\n<<Katie>> <<KatieShockedNormal>> <<ScreenShake>> <<MusicStop>> \nAh! I mean, er...\n<<Kishimoto>>\n...\n<<NoOne>> \nI don’t really know what to feel.\n<<What'sDoneIsDone>> <<Katie>> <<KatieSad>>\nI’m sorry but, they told us not to tell anyone…\nI’m so sorry…\n<<NoOne>>\n“They”?...\nFor some reason, I find it hard to question Katie further.\nThough I must…\n…it’s probably not even just for my sake.\n<<Kishimoto>>\nTell me, Katie.\n<<Katie>>\nI, um… can’t…\n<<Kishimoto>> \nKatie, I have to know.\n<<Katie>>\n...\nWhy?...\n<<Kishimoto>>\nHuh?\n<<Katie>>\nWhy do you have to know?...\n<<NoOne>>\nI try to think of something quickly.\n<<Kishimoto>>\nWell if you’re not telling me it must be important.\nEven if it’s your own personal business, your problem won’t go away if you don’t talk to people about it.\n<<NoOne>>\nI guess you could assume that “they” is someone close to her.\n<<Katie>>\n...\nI’m sorry…\n<<KatieFades>> <<NoOne>> \nKatie sprints away from me.\n<<Kishimoto>>\nKatie!...\nKatie…\n...\nUgh, what the hell.\n<<NoOne>> \nThis doesn’t just feel like a “low point in our relationship”...\nWell it’s either that or I just figured the “low points” wouldn’t hurt this much.\n<<SchoolGate>> \nThe school gates are right in front of me.\nMy class starts in under ten minutes…\n<<ScreenShake>> \nUgh, screw classes!\nI have more important business to deal with!\n<<Kishimoto>>\nKatie!\n<<NoOne>>\nI speed through the school gates and begin my search.\n<<Hallway1>>\nI sprint through the hallways at top speed as I attempt to find Katie.\n<<Kishimoto>>\nKatie!\n<<NoOne>> \nHonestly, what the hell is up with her!?\n<<Hallway2>>\nI continue racing through the school in my desperate attempt to find her.\n<<Kishimoto>>\nKatie!\n<<NoOne>>\nShe’s not here either…\nWhere could she be?\nLike seriously?\nI mean, by this point, she’s probably already been here.\nAnd wherever I go next, she could’ve been there too.\nOr maybe she gets there when I leave.\nThis is impossible dammit!\n<<Kishimoto>>\n*sigh*\n<<NoOne>> \nOkay, there’s a few places I think she might be.\nI’ll go to those places, and who knows?\nMaybe I’ll run into her in the hallways.\n<<Courtyard>>\nIs she here?\n<<Kishimoto>>\nKatie!\n<<NoOne>>\n...\nShe’s not here?\nThis isn’t looking good.\n...\n<<Rooftop>> \nI burst through the doors out onto the rooftops.\n<<Kishimoto>>\nKatie!\n<<KatieAppear>> <<KatieSad>> <<Katie>> <<MusicStop>> \n...\n<<Kishimoto>>\n...\n<<NoOne>>\nI stare right into her eyes.\nA clear sense of dread is present within them.\n<<Kishimoto>> \nWhat’s going on? Why did you run away?\n<<Katie>>\n...\n<<Babel>>\nWe’re going to have to leave each other…\n<<Kishimoto>> <<ScreenShake>>\nWhat?!\n<<Katie>>\nThey’re trying to cover it up…\n<<Kishimoto>>\nWho?\n<<Katie>>\n...\n…the Government…\n…our school…\n<<Kishimoto>> \nWhat?\nWhat’s going on?!\n<<Katie>>\n...\nHave you heard about that tsunami on the news?\n<<Kishimoto>> \nHuh? Um… well I don’t really watch the news but yeah, I heard about it once.\nBut wasn’t that just a malfunction in their systems?\nLike, didn’t something just go wrong and their computers “picked up on” an unrealistically large tsunami wave?\n<<Katie>>\n...\nIt’s definitely not a malfunction in their systems…\n<<Kishimoto>>\nHuh? What? How do you know this?\n<<Katie>> \nIt’s obvious, even without the information we were given…\n<<Kishimoto>>\nInformation?... What information?\n<<Katie>>\n*sigh*\nThe other day the principal came into our classroom and talked to us…\nHe told us that…\n…that the tsunami is real, and that we’d be performing evacuation drills ten times a week.\n<<Kishimoto>> <<ScreenShake>> \nWhat!?\n<<NoOne>>\nPresumably, our school must’ve been told by the government itself that the tsunami is real!\nThose bastards…\n<<Katie>>\nHe came into our classroom the following day and told us it was just a false alarm and that there’s no need to worry.\nHe also told us not to tell anybody else about anything he told us.\n<<Kishimoto>>\n...\n…I see what’s going on here.\nGoing off of what you’ve told me, and what I’ve experienced first-hand…\n…it seems like this tsunami is real.\nThough due to its comically large size, and the fact that there hasn’t been any other recent geographical events that might have caused it…\n…they’re writing it off and telling the public it’s not real so as to not cause a whole commotion about it.\nBut those incompetent bastards aren’t even sure if it’s real themselves!\nAnd they don’t want to spend billions of Yen evacuating everyone and ruining the economy, for the potential chance it actually isn’t real!\nAnd due to them being as unsure as the rest of us, and having such great power…\n…they keep changing their damn minds!\nSo really, none of us know if it’s real or not and I’m just contradicting myself here!\n<<Katie>> <<MusicStop>>\n...\n<<Kishimoto>>\n...\nHere look, Katie…\n<<IWillAlwaysLoveYou>> <<NoOne>> <<KatieNormal>> \nKatie perks up a little.\n<<Kishimoto>>\nI know I’m basically completely going back on what I just said back there but, the only reason they’re even considering it being real is because they have such a strong trust in technology.\nIf it wasn’t for the government deluding themselves into thinking high-end technology can make no mistakes, they definitely would’ve completely written this whole thing off by now.\nThere’s nothing that happened recently that could cause a tsunami wave of this caliber.\nNo matter what anyone says, let’s just ignore this thing.\n<<Katie>>\n...\n<<KatieLuagh>>\nOkay!\n<<NoOne>> \nI definitely got worked up during my initial rant and failed to look at things from an objective perspective.\nOnce I took a step back away from my emotions, I was definitely able to give a better analysis of the whole situation.\nI give Katie a warm smile.\n<<Kishimoto>>\nHey Katie?\n<<Katie>> <<KatieSmile1>>\nHm?\n<<Kishimoto>>\nUm, this might be a bit too sudden but, um…\n…do you want to go on a date tomorrow?\n<<Katie>> <<KatieShockedBlush>>\nA-a~!\nA… wha~!?\n<<Kishimoto>> \nHey! Um… y-you don’t have to if you don’t want to, like.\n<<Katie>> <<KatieBlush>> \nN-no I um… I would like that…\n<<Kishimoto>>\nOh um, really?\nWell, um… why don’t we go to that place where the market is?\nThe beach! Let’s go there!\n<<Katie>> <<KatieShockedBlush>> <<ScreenShake>>\nT-the beach!?\n<<Kishimoto>>\nUm! Let’s not do that… actually.\n<<Katie>> <<KatieBlush>> \nUm no… I don’t mind…\n<<NoOne>>\nReally?\n<<Katie>> <<KatieLuagh>>\nI actually quite like that idea actually!\n<<NoOne>> \nShe does seem to genuinely like the idea.\nHow does she go from one to ten, back down to one so quickly?\n<<Kishimoto>>\nUm… okay let’s go there then!\nWait, isn’t tomorrow a school day though?\n<<Katie>> <<KatieNormal>> \nUm, yeah it is…\n<<KatieShockedNormal>>\nBut! Um!\nThe weather forecast says the weather isn’t going to be good on the weekend this week!\nAnd tomorrow’s meant to be really good!\n<<Kishimoto>>\nO-okay then…\n<<NoOne>>\nHer enthusiasm is shocking.\nShouldn’t it be the other way around?\nI mean, I’m getting to see my cute girlfriend in a swimsuit.\nSpeaking of which, I wonder what kind she has!\n...\nAh um…\nMaybe I shouldn’t be thinking of perverted things about my girlfriend, while I’m with my girlfriend.\nOr at all for that matter.\n<<Kishimoto>>\nOkay! I’ll meet you at the beach tomorrow then!\n<<Katie>> <<KatieSmile1>>\nYep!\n<<NoOne>> \nThe bliss on her face fills me with warmth.\nShe makes me so happy, man.\n<<BlackScreen>>\n...\n<<Kishimoto>> \nOh yeah, Katie?\n<<Katie>>\nHm?\n<<Kishimoto>> \nThanks for being honest with me.\n<<Katie>>\n...\nNo problem, Haruki…\n<<RoadsideSunset>> <<NoOne>> \nKatie and I proceed down the road together.\nI’m back thinking about the whole “Katie creating a purpose for me” thing.\nI know I’m going back on myself here, but I realized that I was also contradicting myself when I said that she didn’t give me a purpose.\nI actually think we do create a purpose for ourselves; God just helps us to create it.\nGod brought Katie to the eighth day, to which he brought her to me, and me to her, thus helping me create a purpose.\nIn all actuality, I could’ve found something and created a purpose for myself years ago.\nI might’ve actually have been able to prevent those suicide attempts…\nThose were only a result of believing I had no purpose.\nI thought that if I had no purpose, there was no point in living.\nBut I eventually gave up on killing myself after I realized I was just doing more harm than good.\nI was just being selfish.\nThat was actually what I was arguing with my mom about which led to the first suicide attempt.\nI was telling her that I had no purpose and that I was going to kill myself.\nShe tried so desperately to stop me and argued with me for hours, going on about how I actually did have a purpose and that I shouldn’t give up on living.\nI was being stubborn and wasn’t open to listening to what she had to say.\nI eventually stopped trying to get her to agree with my opinion and just went ahead with the whole thing anyway.\nEventually my stubbornness led to his brother’s death…\n…I killed his brother.\nThat was the last time I tried to kill myself.\nAfter I experienced his death, I realized what other people would go through if I killed myself.\nIt really set in on me how selfish I was being.\nAnd someone had to die for me to realize that…\n...\nWhen I was just falling in love with Katie, I told myself I didn’t deserve her, and that I’d just hurt her.\nBut I was wrong.\nNo matter what you’ve done, I think everyone deserves to find love.\nLove can really help anyone out of a dark place.\nIt can lead people along the road of self-improvement.\nIt really is a wonderful thing.\nI’m super lucky to have Katie.\nWe’ve been walking for a while now and have already arrived at our house.\n<<KatieAppear>> <<KatieSmile1>> <<Kishimoto>>\nBye Katie!\n<<Katie>> <<KatieLuagh>>\nBye-bye Haruki!\n<<KatieFades>> <<NoOne>>\nI give her a warm smile.\nJust as I turn the door knob and are about to enter my house, I turn to Katie.\n<<KatieAppear>> <<KatieSmile1>> <<Kishimoto>>\nHey Katie…\n<<Katie>> \nHm?\n<<Kishimoto>>\nI love you.\n<<KatieFades>> <<NoOne>> <<MusicStop>> \nI say that and enter through the door.\n<<Date>> <<BedroomMorning>> \nThe sunlight shines brightly into my room.\n<<Ain'tHappening>> \nMe and Katie have our beach date today.\nI leap out of bed and enact my morning routine as usual.\n<<RoadsideMorning>> \nMe and Katie walk alongside each other as we proceed down the road.\nThe burning sun shines onto my face.\nThis weather mixed with the winter uniform is killing me.\n<<KatieAppear>> <<KatieSmile2>>\nKatie appears to have a massive smile on her face.\nShe’s pretty clearly looking forward to our date.\n<<Kishimoto>> \n(Dude, I’m going to get to see her in a swimsuit!)\n<<NoOne>>\nThe thought only makes me sweat more.\n<<SchoolGate>>\nWe come to the school gates and proceed into school.\n<<ClassroomDay>>\nIt’s lunchtime now.\nUsually the classroom would be filled with lively chatter.\nBut today, only the melancholic whispers of students can be heard.\nSeriously, does no one have any kind of cop-on?\nLike what? If the media said that jumping off a cliff would give them superpowers, would they go ahead and do it?\n<<MusicStop>> \nJust then, a female student wearing square glasses steps up to the front of the class.\n<<Student>>\n*Ahem*\n<<NoOne>>\nEveryone stops talking immediately and turns to her.\n<<Student>>\nWe may be in a tough place right now, but no matter what, we must push forward and enjoy our youth to the maximum!\nYou’re not going to make any happy memories worrying about this whole thing! So get talking with one another and lighten up the mood!\n<<NoOne>> \n...\n<<TheWay>>\nWhat?\n<<Girl(A)>>\nYeah, I think she might be right.\n<<Boy(A)>>\nYou know what? I actually agree with that!\n<<NoOne>>\nThe classroom erupts into bubbly chatter and the girl…\n<<ScreenShake>> \n…walks out of the class????\nSeriously, who the hell is this girl?!\nWell, I don’t know what kind of spell she cast on everyone, but whatever it was, it worked.\nThe chat only helps to add to my good mood.\n<<Fujinami>> <<FujinamiAppear>> <<FujiNormal>>\nYo what’s with all this commotion in your class?\n<<NoOne>> \nI am no longer in a good mood.\n<<Fujinami>> \nHelllloooo?\n<<NoOne>>\nI open the window closest to me.\nJust in case.\n<<Fujinami>>\nKishimoto? Kishimoto?\n<<Kishimoto>>\nHuh? Yeah?\n<<Fujinami>>\nI was asking you a question!\n<<Kishimoto>>\nAnd what was the question?\n<<Fujinami>> <<FujiLuagh>>\nHave you got nudes off Katie yet?\n<<NoOne>>\nThat was NOT the question.\n<<Kishimoto>>\nDude, Fujinami! Look!\n<<Fujinami>> <<FujiShocked>> \nHuh? What is it?\n<<Kishimoto>> \nThere’s a cute girl floating outside the window holding up a sign that says “Fujinami! Will you marry me?”!\n<<Fujinami>> <<ScreenShake>>\nReally? There is!?\n<<Kishimoto>>\nYeah! Quickly! Jump out the window before she leaves!\n<<Fujinami>> <<FujiLuagh>>\nOka-\n<<FujiAngry>> <<ScreenShake>>\nWAIT, WHAT KIND OF IDIOT DO YOU THINK I AM!?\n<<Kishimoto>>\nI think you’re one that the girl floating outside our window wants to marry.\n<<Fujinami>> \nThere’s no girl floating outside our window!\n<<Kishimoto>>\nThere is! She’s just covered with invisible ink, that’s all!\n<<Fujinami>> \nDude, I’m not THAT stupid.\n<<NoOne>> \nSo he still admits that he’s at least somewhat stupid.\nI’m about to continue, when I realize that getting a dude to jump out a window isn’t really just “joking around”.\nLike I don’t think the argument “It was just a joke.” really holds up in court.\n<<Kishimoto>>\nDude, I’m so sorry.\n<<Fujinami>>\nYeah! You were just trying to get me to jump out a window!\n<<Student>> \nYou were trying to get Fujinami to jump out the window?\n<<NoOne>> \nOh no.\n<<Student>> <<ScreenShake>>\nThat’s so awesome!\n<<KishiFuji>> <<ScreenShake>> <<FujiShocked>> \nWHAT!?\n<<Student>>\nKeep it up, dude!\n<<Fujinami>> <<FujiSad>> \nDoes everyone really hate me that much?...\n<<Kishimoto>>\nYes Fujinami, yes they do.\n<<Fujinami>>\n*Sniff* …really?...\n<<NoOne>>\nHe’s about to break down crying.\n<<Fujinami>> \nI’m so lucky to have such a supportive friend such as you Kishimoto.\n<<Kishimoto>>\nDude, I was just trying to get you to jump out the window.\n<<Fujinami>>\nHa ha, that was just another one of your hilarious jokes...\n<<Kishimoto>>\nUm… yeah.\n<<Fujinami>> <<FujiSmile1>>\nAnyway, how are you and Katie doing?\n<<NoOne>>\nWell that was a total 180.\n<<Kishimoto>>\nUm, yeah no, we’re good.\nWe’re going on a date out to the beach together today.\n<<Fujinami>> <<FujiShocked>> <<ScreenShake>>\nREALLY?!?!?\n<<ScreenShake>>\nYOU’RE GOING TO GET TO SEE KATIE IN A SWIMSUIT!?!?!?\n<<Kishimoto>>\nOut you go!\n<<FujinamiFades>> <<NoOne>> \nI pick up Fujinami by both his legs and spectacularly throw him out the window.\n<<Fujinami>> <<ScreenShake>> \nWEEEEEEEEEE!!!!!!!!!\n<<NoOne>> \nI was expecting more of an “AHHHHHHHH!!!!!!!! HELP!!!!!!!!!”.\nBut works either way.\nDon’t get me wrong here; I definitely feel bad for throwing him out that window, but desperate times call for desperate measures.\n<<SchoolGate>> \nSchool’s out for the day.\nI wait outside the school for Katie.\n<<KatieAppear>> <<KatieSmile2>> <<Katie>> <<MusicStop>> \nHello!\n<<Kishimoto>>\nYo!\n<<BrightDays>> \nShould we get going now?\n<<Katie>> <<KatieLuagh>>\nYep!\n<<NoOne>>\nWe proceed to leave school.\n<<BeachDay>>\nWe’re at the beach now.\nKatie brought a little basket with her to hold all her stuff.\nShe begins to take things out of the basket.\nUm…\nYeah, no, it seems as if she didn’t just bring her stuff.\nShe happily places a blanket onto the ground and takes out towels, sunscreen, the sort, from her basket.\n...\nI feel really bad for not bringing anything.\n<<KatieAppear>> <<KatieSmile2>>\nWait… she…\n…already put her swimsuit on, didn’t she?\nUm…\nI mean, it’s no issue if she didn’t, she can just wrap her towel around her or whatever-\n<<ScreenShake>>\nOH SHIT.\nSHE’S JUST TAKEN OFF HER SKIRT AND…\n<<Kishimoto>>\n*gulp*\n<<Katie>> <<KatieNormal>>\nIs something wrong Haruki? Why are you staring up at the sky?\n<<NoOne>>\nJUST HURRY UP ALREADY DAMMIT!\n<<NoOne>>\nDoes she not understand the danger of just standing around like THAT in public?!\nDude, now that image is forever ingrained in my mind…\nWait…\nIf she hasn’t put her swimsuit on yet…\n…and she’s not wearing her towel while getting changed…\n…that means she’ll also have to take off her…\nThat’s illegal isn’t it!?\nThat’s public indecency, right?!\nActually, isn’t being in your underwear in public also public indecency?\nAre we going to get arrested!?\nGranted, there’s no one at the beach or the marina but still…\n<<KatieFades>>\nShe takes off the rest of her clothes and…\n<<KatieNormalS>> <<KatieAppear>> <<Katie>>\nHaruki? What’s wrong?\n<<NoOne>>\nHuh?...\nSo she WAS just wearing her swimsuit and I just mistaked the bottom of her swimsuit for her…\n<<Kishimoto>>\nUm… nevermind…\n<<KatieLuaghS>> <<Katie>> \nHuh? Okay then!\n<<KatieSmile1S>> \nBut you can’t go into the ocean wearing your school uniform, silly!\n<<Kishimoto>> \nO-oh yeah…\n<<KatieFades>> <<NoOne>>\nI undress and run into the ocean with Katie.\nWe splash water at each other, swim around, and make banter for what feels like hours.\nI would’ve been disappointed about the fact she’s just wearing our school swimsuit, but the stress from when we got there and the fun we’re having makes me not care.\nI actually think it’s quite cute and on-brand of Katie.\nEither way, we can’t stay in the water forever.\nWe get out when it gets dark and put our school uniforms back on.\nGetting undressed, she wraps a towel around her.\nI’m happy to never have to experience THAT again.\n<<MarinaEvening>> <<MusicStop>> \nWe’re back at the marina.\nThere’s not a single soul to be seen anywhere.\n<<IWillAlwaysLoveYou>>\nThere wasn’t anyone at the beach either.\nSeriously, people need to relax.\n<<KatieSmile1>> <<KatieAppear>>\nKatie turns to me, smiles…\n…and grabs onto my hand.\n<<Kishimoto>>\nYou know, for someone who is usually really shy and reserved, you can be quite bold sometimes, you know?\n<<Katie>> <<KatieSmile2>>\nHe he, I guess.\n<<NoOne>>\nWe walk around for a while.\nWe’re not going anywhere in particular, just kind of walking around.\nI really wish we could just be like this forever.\nJust walking aimlessly, hand-in-hand, seeing the sights the world has to offer.\nIt really is magical.\nI love her so much.\n<<MarinaEvening>>\nWe come back to where we started.\nNot a single person in sight.\n...\n<<MusicStop>>\nWait… no…\nThere’s one…\n<<Babel>>\nThe sight of them sends a shiver down my spine.\nI don’t think they’ve noticed me.\n<<Katie>>\nOh look! Someone’s here!\n<<NoOne>>\nThey turn around and face me.\n<<???>>\nKishimoto-san?...\n<<Kishimoto>>\n*sigh*\n<<Katie>>\nHm? Do you know this person Haruki?\n<<???>>\nBarely, he knew my brother though.\n<<Katie>>\nUm… Haruki, why does he sound angry?\n<<Kishimoto>>\n...\n<<???>>\nWhat, are you going to kill your girlfriend too?\n<<Katie>> \nW-what?...\n<<Kishimoto>>\n...\n<<???>>\nPut her through the same suffering?\n<<Kishimoto>> <<ScreenShake>> \nI didn’t kill him, dammit!\n<<???>> \nOh come on you sicko! You even admitted it at his funeral!\nAre you just trying to look good in front of your girl?\n<<Kishimoto>>\nIf I killed him, tell me how dammit!\n<<NoOne>>\nI know he’s right…\n…he has all the right in the world to be angry…\n…I’m the villain here…\n<<???>>\nYou drove him to suicide, remember?\nThat might as well be the same thing as killing someone, right?\n<<Kishimoto>>\n...\n<<Katie>>\nW-What?\nWhat d-did you do?\n<<Kishimoto>>\n...\n<<Katie>>\nHaruki…\nPlease tell me…\n<<???>>\nYou want to know that badly? How about I tell you then?\n<<Katie>>\nHuh? U-um… okay…\n<<Kishimoto>>\n*sigh*\n<<???>>\nThis psycho kept forcing my brother to help him in his suicide attempts!\nYour perfect little boyfriend forced my brother to kill him!\n<<ScreenShake>> <<MusicStop>> \nAfter a while it got too much and MY BROTHER HUNG HIMSELF!\n<<ScreenShake>>\nDO YOU UNDERSTAND NOW!?\nOR DO I HAVE TO DRILL IT INTO YOUR HEAD YOU DUMBASS!?\n<<Kishimoto>> <<ScreenShake>> <<What'sDoneIsDone>> \nENOUGH!\nYOU DON’T INSULT KATIE YOU ASSHOLE!\n<<???>>\nI DON’T GIVE A SHIT ABOUT YOUR PERFECT LITTLE GIRLFRIEND!\nHOW ABOUT YOU STOP HIDING BEHIND HER AND OWN UP TO YOUR MISTAKES!?\n<<Kishimoto>> <<ScreenShake>>\nI DID! AND YOU JUST ADMITTED IT\n<<???>>\nWhen the hell did I say that?!\n<<Kishimoto>> \nJust a few moments ago, you said that I admitted to killing him at his funeral!\nI apologized to you and your family vigorously, and did everything I could to help you!\nI changed myself to become a better person!\nI’ve done everything I can and you still hold it against me!\n<<???>> <<ScreenShake>>\nSHUT UP!!\n<<ScreenShake>> \nSHUT UP!! SHUT UP!! SHUT UP!!!!\n<<Kishimoto>>\nI get the point man! You want me to shut up!\n<<???>>\nThere’s no one here right now, if I were to drown you and your little girlfriend in the sea here, nobody would know I did it…\n<<Katie>>\nW-what!?\n<<Kishimoto>>\nDude, are you out of your fucking mind!?\nIf you’re so angry at me for “killing” your brother, and you know the effects that the death of a loved one has on a family, then why would you do the “same” thing?!\n<<???>> \nKishimoto-san, you dumbass!\nWhy should I care about how your family feels when a scumbag like you dies!\nI bet they’ll rejoice, actually!\n<<Kishimoto>> \nAre you done with your nonsensical rant already?!\n<<???>>\nWhat’s so “nonsensical” about anything I’m saying?\n<<Kishimoto>> \nDude! You’re an actual psychopath!\nAnd why the hell would you kill Katie?! What did she ever do to you!?\n<<???>> <<ScreenShake>>\nENOUGH!\n<<ScreenShake>>\nKILL YOURSELF!\n<<ScreenShake>>\nFUCKING DIE!!!!!\n<<ScreenShake>>\nI HATE YOU!!!!!\n<<ScreenShake>>\nAHHHHHHHHHHHHH!!!\n<<Kishimoto>> \nGet out of here Katie! Call the police!\n<<Katie>> \nWahhh!~\n<<NoOne>>\nKatie runs off at the speed of light.\n<<???>> <<ScreenShake>>\nWHAT THE HELL ARE YOU DOING!?!?!?\n<<Kishimoto>>\nYou’re a complete psychopath!\nMan! I can’t believe I’m seeing you like this after all these years…\n<<???>> <<ScreenShake>>\nYOU ARE THE SCUM OF THE EARTH!!!!\n<<ScreenShake>> \nFIRST YOU KILL MY BROTHER, NOW YOU SEND ME TO PRISON?!\n<<ScreenShake>>\nAHHHHHHH!!!!!!\n<<NoOne>> \nHe runs at me with full speed and jumps onto me.\n<<Kishimoto>> <<ScreenShake>>\nAHHHH!! SOMEONE HELP DAMMIT!\n<<???>> <<ScreenShake>>\nYOU’RE GOING TO PAY FOR YOUR CRIMES TOWARD MY FAMILY!!!!\n<<Police>>\nSTOP RIGHT THERE! GET OFF OF HIM!\n<<???>>\nHuh?\n<<NoOne>>\nAll of a sudden, a deep masculine voice comes from our left.\nHe’s standing in front of multiple police cars, all with sirens blaring, all with at least three armed officers standing at them.\n<<Police>> \nYOU’RE UNDER ARREST FOR ATTEMPTED MURDER AND ASSAULT!\nYOU’RE COMING WITH US!\n<<???>> <<ScreenShake>> \nHE KILLED MY BROTHER! ARREST HIM DAMMIT!\n<<Police>>\nSIR, ANY ATTEMPT TO REFUTE IS FUTILE AND YOU WILL BE CHARGED WITH REFUSING ARREST! YOU’RE COMING WITH US!\n<<???>> <<ScreenShake>> \nYOU EVIL PIECES OF SHIT!\n<<NoOne>> \nHe leaps off of me and darts toward the police officer.\n<<Police>> <<ScreenShake>>\nWOAH!!!\n<<???>> <<ScreenShake>>\nDIE ASSHOLE!\n<<NoOne>>\nHe begins violently punching the officer before taking his gun.\n<<Police>> \nOPEN FIRE!!\n<<???>> <<ScreenShake>> \nAHHHH HELP!! SHIT!!!! IT HURTS!!!!!\n<<MusicStop>>\n*choke* *cough*\n<<NoOne>>\nHe dies; his corpse surrounded by a sea of blood.\nI let out a deep sigh, turn my head to the sky, and close my eyes…\n<<Police>>\nSir, are you okay?\nSir? Sir?\nGet this man to the hospital!\n<<Date>> <<HospitalRoom>> <<NoOne>> \nI awake in a hospital room.\n<<Kishimoto>> \nWhat?...\n…Where am I?\n<<KatieAppear>> <<KatieShockedNormal>> <<Katie>>\n*gasp*\nHaruki!\n<<KatieLuagh>>\nYou’re awake!\n<<Kishimoto>>\nHuh?\nOh yeah… I am indeed.\n<<Katie>> <<KatieSad>> <<GoodbyeToYou>> \n...\n<<NoOne>>\nShe suddenly becomes a lot more melancholic.\n<<Kishimoto>>\n...\n<<NoOne>>\nI want to ask her what’s wrong, but for whatever reason, I can’t seem to bring myself to do so.\n<<Katie>>\nI…\n<<NoOne>>\nGuess I didn’t have to.\n<<Katie>>\n…I didn’t realize…\n...\n<<NoOne>>\nOh I remember now…\n…I got in a fight with that dude…\n…my friend’s brother…\n…how long has it been since then?\n<<Kishimoto>>\n...\nUm, Katie?...\n<<Katie>> <<KatieNormal>> \nYeah?...\n<<Kishimoto>>\nI… um… I had a time in my life…\nI believed I didn’t have a purpose…\n…and I tried to kill myself serval times…\n<<Katie>> <<KatieSad>> \n...\n<<NoOne>>\nI really should just tell her everything.\nI don’t think our relationship can proceed otherwise…\n<<Kishimoto>>\nI got my friends to help me with a few of them…\nFor one of them, it just eventually became too much for him to handle…\n…and he hung himself.\n<<Katie>>\n...\n…I…\n...\n<<Kishimoto>>\nI remember going into his house to hang out…\n…he had told me a few days prior his parents and his brother were gone on that day, so it would've been just him…\nI walked in through the door…\n…and…\n...\n<<NoOne>> \nI’m struggling to hold back tears…\n<<Katie>>\nYou… you don’t have to tell me if you don’t want to…\n<<Kishimoto>>\n...\nThe feeling…\nThe… the shock…\nSeeing my friend… a once happy and bubbly person now all but devoid of life…\nHe looked like a zombie…\nI couldn’t bring myself to cry…\n…I just stood there in front of his corpse for hours…\n…and then his parents and his brother came home…\nHis brother was the dude beating me up last night…\nWell, I think it was last night…\nIt was at his funeral when I told his brother…\n…about… y’know, what I did…\n…and how it was probably my fault he killed himself…\n...\n<<Katie>> \nI…\n…I…\n…I don’t know what to even say…\nIt feels like no matter what comes out of my mouth right now, it won’t be sincere enough…\n<<Kishimoto>>\n...\nI never tried to kill myself again after that…\n…I didn’t want to hurt anyone else…\n…even if I ended up living a miserable life…\n…at least nobody else would…\n…but then you came…\n<<Katie>> <<KatieNormal>>\nUh… um…\n…I…\n…I came?\n<<Kishimoto>>\nYeah…\n…this might sound melodramatic or whatever but…\n…you saved me Katie…\n…you showed me that I could have purpose…\n…you made me decide that my purpose…\n…is to be with you…\n<<Katie>> <<KatieShockedNormal>>\nI!...\n<<KatieSad>> <<ScreenShake>>\nHaruki!\n<<KatieFades>> <<NoOne>>\nKatie runs up to me…\n…and kisses me…\n<<Katie>>\nI love you Haruki!\nDon’t you ever leave me!\n<<Kishimoto>>\nHeh, I won’t…\n<<NoOne>>\nI tightly wrap my arms around her…\nI feel her tears drip onto my shoulders…\nWe stay like that for minutes.\n<<HospitalRoom>> <<MusicStop>> \nKatie sits on her knees at the side of my bed.\n<<Katie>> <<KatieAppear>> <<KatieNormal>>\nHey um…\n<<Babel>>\nDid you go into the eighth day?...\n<<Kishimoto>>\nUm… no, I didn’t…\nI didn’t go into the eighth day.\n<<Katie>> \nOh, you didn’t?...\n<<Kishimoto>>\nYeah, no… I didn’t…\n<<Katie>> <<KatieSmile2>>\nHeh, I guess that means you had no worries!\n<<Kishimoto>>\nYeah… I suppose it does…\nHey, how long has it been since I got beat up?\n<<Katie>> <<KatieNormal>>\nUm… around three days.\n<<Kishimoto>>\nAh… okay…\n<<KatieFades>> <<NoOne>>\nThe sound of silence is the only thing that fills the room for a few moments.\nKatie seems to be nervous almost.\nLike something is weighing on her mind.\n<<KatieAppear>> <<Katie>>  \nUm, I don’t want to stress you out here but what do you think that thing in the distance is?\n<<NoOne>> \nShe seems to have gathered the courage to speak up about it.\n<<Kishimoto>>\nHm? What thing?\n<<Katie>>\nUm… are you able to stand up?\n<<Kishimoto>> \nI’ll try…\n<<NoOne>> \nI stand up from the hospital bed.\n<<Katie>>\nAre you okay?\n<<Kishimoto>>\nI feel a little light-headed but, apart from that I’m fine.\n<<Katie>> <<KatieSmile2>>\nThat’s good.\n<<KatieNormal>> \nAnyway, come over here!\n<<NoOne>>\nShe seems distressed.\n<<KatieFades>>\nI walk towards the window and look out.\nThere’s the outline of something in the distance…\n…I can’t exactly tell what it is…\n…it’s extremely faint.\n<<KatieAppear>> <<Katie>> <<KatieSad>>\nDo you think… it’s the wave?\n<<Kishimoto>> \nOh... um...\n<<NoOne>>\nI want to say no but…\n…the possibility of it actually being the wave is a very real one.\n<<Katie>> <<KatieNormal>>\nHaruki?\n<<Kishimoto>>\nUm…\nUgh…\n<<Katie>> \nIs everything all right?\n<<Kishimoto>>\nYeah… no… I’m fine…\n<<KatieFades>> <<NoOne>> <<MusicStop>>\nThe door behind us opens and a doctor walks in.\n<<LovelyHorizon>> <<Doctor>>\nOh my! He’s awake!\n<<NoOne>>\nThank you, we couldn’t tell.\n<<Doctor>>\nSir, how are you feeling?\nYou look to be in good condition. You’re dispatched!\n<<NoOne>>\nWhat? He didn’t even give me time to answer!\n<<MarinaDay>> \n...\nWhat?…\n<<Kishimoto>> <<KatieAppear>> <<KatieNormal>>\nWhat the hell?\n<<Katie>> <<KatieSmile1>>\nMaybe it’s better not to think about it…\n<<Kishimoto>>\nMaybe…\n(Seems really unprofessional though)\nHey, what time is it?\nDid you even go to school today?\n<<Katie>> <<KatieSmile2>> \nUm, heh no, I didn’t…\n<<KatieShockedNormal>>\nI’ve been going every other day though!\nAnd I was doing all my homework at the hospital!\n<<Kishimoto>> \nWait, how long were you coming to see me?\n<<Katie>> <<KatieLuagh>> \nEveryday since the incident right after school!\n<<NoOne>>\n...\n<<Kishimoto>>\nYou really are something, huh?\n<<NoOne>>\nI say that with a smile.\n<<Katie>> <<KatieSmile2>>\nHe he, I guess!\n<<Kishimoto>>\nHey, wait, what about my mother? Was she coming to see me?\n<<Katie>> <<KatieShockedNormal>>\nOh yeah no! She was super-duper worried too!\nShe had a day off yesterday and she stayed with your for as long as she could!\n<<Kishimoto>>\nWait, did she…\nY’know, find out we’re dating?\n<<Katie>> <<KatieNormal>>\nHm? I don’t think so.\n<<Kishimoto>>\nPhew\nAnyway, we might as well go somewhere now that I’m out of the hospital.\n<<Katie>> <<KatieLuagh>>\nOh yeah! That sounds like fun!\n<<Kishimoto>>\nWhere do you wanna go?\n<<Katie>> <<KatieNormal>>\nHm… um…\n<<KatieSmile2>>\nThere’s a nice café just down the street!\n<<KatieSmile1>>\nWhy don’t we go there?\n<<Kishimoto>> \nUm, yeah sure, why not?\n<<MarinaDay>> \n...\n<<NoOne>>\nSomething is VERY wrong here.\n<<KatieAppear>> <<Katie>> <<KatieSmile1>> \nIsn’t it cute?\n<<Kishimoto>>\nNo Katie, this is a MAID CAFÉ.\n<<Katie>> <<KatieNormal>>\nHm? Yeah?\n<<Kishimoto>> \nDude! Do you not understand how shitty this makes me look?\n<<Katie>>\nHuh? How come?\n<<Kishimoto>> \nMan…\n<<Katie>>\nDo you want to go somewhere else?\n<<NoOne>>\nI feel bad doing this but, I’d really prefer not to look like a pervert.\n<<Kishimoto>>\nUm, yeah, sorry…\n<<KatieLuagh>> <<KatieLuagh>>\nThat’s okay!\n<<KatieSmile1>> \nI actually have another really cute place to go!\n<<Kishimoto>> \nPlease not ANOTHER maid café!\n<<Katie>> <<KatieLuagh>>\nHe he! Don’t worry, it’s not!\n<<NoOne>>\nAnother bullet dodged it seems.\n<<MarinaDay>> \nWe’re standing outside the café.\n...\nSomething is VERY wrong here.\nWell, nowhere near as wrong as the last café, but wrong nevertheless.\n<<KatieAppear>> <<Katie>> <<KatieSmile1>>\nIs everything okay Haruki?\n<<Kishimoto>> \nUm, this is a cat café…\n<<Katie>> <<KatieLuagh>> \nYeah, cute isn’t it?\n<<Kishimoto>>\nI’m allergic to cats…\n<<Katie>> <<KatieNormal>>\nOh…\nReally?\n<<Kishimoto>>\nReally, sorry.\n<<NoOne>> \nGranted, I’m pretty sure I’ve never told Katie about my allergy, so it’s not really her fault.\nIf anything, it’s more of MY fault for not telling her.\nThough, how do you just bring that up in a conversation?\n“By the way, I’m allergic to cats”?\nIt’s not exactly an easy line to slip into a conversation.\n<<Kishimoto>>\nUm, here, maybe we should give up…\n<<Katie>> \nYeah…\n<<NoOne>>\nI feel really bad…\n<<RoadsideSunset>>\nWe decide to just go back to my house.\nMy mom’s probably at work right now, so it’ll just be me and her.\nHm…\nY’know, I wonder what Katie’s house looks like?\nHer bedroom probably smells nicer than mine at least…\n...\nI wonder if I went there, might I be able to get a peek into her… um… clothes drawers?…\nTo check out her fashion sense of course!\nYeah…\nTotally…\n<<KatieAppear>> <<KatieSmile1>> <<Kishimoto>>\nKatie, let’s go to your house.\n<<NoOne>>\nI am such an idiot.\nMaybe I should start thinking with my head and NOT my dick?\n<<Katie>> <<KatieNormal>>\nHuh? Why?\n<<NoOne>> \nSuddenly, the thought of having to be honest to progress our relationship randomly pops into my head.\n<<Kishimoto>>\nBecause I want to peek into your underwear drawers.\n<<Katie>> <<KatieShockedBlush>> <<ScreenShake>> \nWHA~!!?!?!!?!?!?!\n<<NoOne>>\nI AM SUCH AN IDIOT.\nYeah, that is NOT going to progress our relationship.\nSeriously, that’s the kind of thing that Fujinami would say!\n<<Katie>> <<KatieShockedBlush>>\nUuuuuuuuuuuuuuu-wha~?!\n<<Kishimoto>> <<ScreenShake>> \nI CAN EXPLAIN!\nKIND OF!...\n<<Katie>>\nI… uh…\n<<KatieBlush>> \nWell, um… if that’s what you really want… you c-can…\n<<Kishimoto>> <<ScreenShake>> \nREALLY?!!?!?!?\n<<NoOne>>\nDude, this girl is going to get herself into so-\n<<ScreenShake>>\nWAIT SORRY, WHAT WAS MY RESPONSE JUST NOW?!?!?!?\nDude, just how much did that fight damage my brain?\n<<Katie>> \nY-yeah um… if you want we could…\nUm… you know…\n<<Kishimoto>> <<ScreenShake>> \nDUDE STOP!!!!!!!!!!!!\n<<Katie>> <<KatieNormal>> \nHuh?!\n<<Kishimoto>>\nLet’s just… not go near your bedroom…\n<<Katie>> \nO-Okay?...\n<<NoOne>>\nPhew\n<<Katie'sHouse>> \nWe arrive at Katie’s house.\n<<Kishimoto>> \nWow! Your house is super nice!\n<<KatieAppear>> <<Katie>> <<KatieNormal>>\nIt’s the exact same as yours though? Isn’t it?\n<<Kishimoto>>\nHAHAHA! You are SO correct Katie!\n<<Katie>> <<KatieSmile2>>\nAre… are you alright?\n<<Kishimoto>>\nHa ha, yeah! It’s just the effects of being in a cute girl’s house!\n<<Katie>>\nUm…\n<<KatieSmile1>> \nHeh, I think you need some more rest Haruki…\n<<Kishimoto>>\nNah, I’m a big manly strong man!\n<<Katie>>\nYour nose is bleeding Haruki.\n<<Kishimoto>> \nThat’s actually strong man juice.\n<<Katie>> <<KatieSmile2>>\nYeah, let’s get you back home…\n<<NoOne>>\nAwwwww\n<<BedroomEvening>>\nI awake in my room.\nThe sun has already set.\nI hear the door gently open.\n<<Mom>>\nIs he okay?\nOh, Haruki, you’re awake!\n<<Kishimoto>> \nHuh? Oh yeah, good job.\n<<NoOne>>\nI’m just waking up, so all my sentences just sound like mumbles.\nYou can barely even hear what I’m saying.\n<<Mom>>\nHow come you never told me that this \"Katie\" was your girlfriend?\n<<Kishimoto>> <<ScreenShake>>\nWait, what?\n<<NoOne>>\nThat question wakes me up instantly.\n<<Kishimoto>> \nHow did you find out?!\n<<Mom>>\nHm? She told me.\n<<Kishimoto>> \nWhat? When?\n<<Mom>> \nUm, an hour ago now?\n<<Kishimoto>>\nHuh? Is she here?\n<<Mom>>\nShe’s right next to you, silly!\n<<NoOne>> <<KatieAppear>> <<KatieSmile2>> \nI turn to my left, only to see Katie, kneeling at my bedside, her elbows propped on my bed, sustaining her head in the air.\nShe’s clearly trying to hold back laughter.\n<<Katie>>\nHow did you not see me?\n<<KatieLuagh>>\nHa ha!\n<<NoOne>> <<KatieFades>>\nA big smile appears on my face.\n<<Mom>>\nAw, you two seem so happy together.\nI’ll just leave you two alone now.\n<<NoOne>>\nShe leaves the room.\n<<Katie>> <<KatieAppear>> <<KatieLuagh>> \nHa ha ha ha ha!\n<<Kishimoto>>\nheh…\n<<NoOne>>\nIt means a lot to me that my mom said that…\nI’m not too sure why…\n<<Kishimoto>>\nHey Katie?...\n<<Katie>> <<KatieSmile1>> \nYeah?\n<<Kishimoto>>\nCould you stay here for the night?\n<<Katie>> <<KatieShockedBlush>> <<ScreenShake>>\nWhat?!\n<<Kishimoto>>\nI-I mean, if you don’t want to, you don’t have to…\n…I just… really wanted to be with you for longer…\n<<Katie>> <<KatieSmile1>>\n...\n<<KatieFades>> <<NoOne>> \nKatie climbs into my bed and hugs me tightly.\n<<MusicStop>> \nI pull the covers over her and find myself quickly falling asleep.\n<<Date>>\n...\n<<Katie>>\nRise and shine, sleepy head!\n<<Kishimoto>>\nWhat?...\n<<BedroomMorning>> <<Kishimoto>>\nHuh?\n<<IWillAlwaysLoveYou>> <<KatieAppear>> <<KatieSmile1>> \nKatie?\n<<Katie>> <<KatieLuagh>>\nThat’s me!\n<<Kishimoto>>\nWhat time is it?\n<<Katie>> <<KatieSmile2>>\nFive to eleven!\n<<Kishimoto>> <<ScreenShake>> \nWHAT?!\nDUDE, WE’RE SO LATE!\n<<Katie>> <<KatieSmile1>>\nCalm down! It’s okay!\nWe can miss one day, can’t we?\n<<Kishimoto>>\n*sigh* I suppose…\n<<Katie>> <<KatieSmile2>>\nWhy don’t we spend today together?\n<<KatieSmile1>>\nJust the two of us.\n<<NoOne>>\nHearing that from her puts a smile on my face.\n<<Kishimoto>> \nYeah…\n…I like that idea…\n<<KatieFades>> <<NoOne>>\nKatie responds with a smile and climbs back into bed with me.\n<<Katie>>\nThen let's sleep in for a little longer…\n<<NoOne>>\nShe pulls the blanket over herself and hugs me tightly.\n<<Kishimoto>> \nHeh, if you wanted to sleep then why did you wake me up?\n<<Katie>>\nHa, I suppose I just wanted to see your eyes again…\n<<Kishimoto>>\nPretty crappy reason for waking someone up but, oh well…\n<<NoOne>>\nKatie lets out a soft chuckle.\nI close my eyes.\n<<BlackScreen>>\nA few hours later…\n<<BedroomMorning>>\nI'm awoken by a sweet smell of sorts.\n<<Katie>> \nHaruki! I’ve made breakfast!\n<<Kishimoto>>\nHuh?\n<<Katie>>\nFrench toast!\n<<Kishimoto>>\nFrench toast!?\n<<NoOne>>\nThat wakes me up almost immediately and I sprint into the living room.\n<<SittingRoom>>\nComing into the living room, I see French toast laid on the futon.\n<<Kishimoto>>\nNo way-!\nDude, when did you do this?!\n<<Katie>> <<KatieAppear>> <<KatieSmile1>>\nUm… the idea just kind of came into my mind, and I thought it’d be nice so I um…\n…just started I suppose? About an hour ago.\n<<Kishimoto>>\nWoah dude! This is crazy!\nMan, you’re spoiling me here!\nI mean, I can’t even cook! How am I supposed to repay you?\n<<Katie>> <<KatieSmile2>> \nTee hee! It’s fine, I don’t expect you to do anything like that.\n<<Kishimoto>>\nReally?...\n<<Katie>> <<KatieSmile1>>\nReally\n<<Kishimoto>> \nI still feel kinda bad though…\n<<Katie>> <<KatieLuagh>> \nCome on! Don’t worry about it and just enjoy your toast!\n<<KatieSmile1>> \nWhat do you want with it?\n<<Kishimoto>>\nJust syrup would be fine.\n<<Katie>> <<KatieLuagh>> \nOkay, two pieces of french toast with syrup coming right up for my darling Haruki!\n<<Kishimoto>> \nYour d-darling?\n<<KatieFades>> <<NoOne>> \nShe leaves the room and walks into the kitchen, coming out shortly after with two plates; both with two pieces of french toast with syrup on top and lays down a plate in front of me.\nI don't really understand why she had to bring the entire thing with her, I mean she could've just brought the syrup over.\nI'm guessing she probably just didn't want to get syrup all over the futon.\n<<KatieAppear>> <<KatieSmile2>> <<Katie>> \nEnjoy!\n<<Kishimoto>> \nI-I um, will yes…\n<<Katie>> <<KatieNormal>>\nHuh? Why so formal all of a sudden, Haruki?\n<<Kishimoto>>\nU-um… I, er…\nWait, did you just magically learn social norms right now, or do they just work the same wherever you’re from?\nActually, where do you come from?\nYou said America right?\nBut then how come you have an Irish surname?\n<<Katie>> <<KatieSmile1>>\nWell, on my dad’s side, my grandfather is Irish, and my grandmother is American.\n<<KatieSmile2>>\nBut yes, I was born and lived in America.\n<<KatieNormal>>\nWell, before I came here at least.\n<<Kishimoto>>\nOh…\n<<NoOne>>\nI seem to have successfully been able to change the topic of conversation.\n<<Katie>> <<KatieLuagh>>\nBut yeah, America really is quite different from here!\n<<NoOne>>\nShe’s begun to eat her toast now.\nIt’s the same as mine; nothing but syrup on top.\n<<Kishimoto>>\nYeah?\n<<Katie>> <<KatieSmile1>>\nYeah! Like in America, you don’t have to take off your shoes while in somebody’s house!\n<<KatieSmile2>> \nAnd you don’t have to use honorifics either!\n<<Kishimoto>>\nWell of course I know *that*.\n<<Katie>> <<KatieSmile1>> \nYeah, but guess what else?\n<<Kishimoto>>\nWhat?\n<<Katie>> \nIt’s completely acceptable to walk while eating!\n<<Kishimoto>>\nHuh?\n<<Katie>>\nAnd it’s fine to have a phone call on a train!\n<<Kishimoto>>\nWait sorry, what now?\nWell, I mean, do people actually DO these things?\n<<Katie>> <<KatieNormal>>\nHuh? Of course!\nIt’s a social norm because it’s a normal thing to do socially.\n<<Kishimoto>>\nWait what!? Just how disrespectful are Americans?!\n<<Katie>>\nWell, to us?… to them? To Americans I guess is the way of saying it… they don’t see it as disrespectful.\nIt’s just normal.\nActually, they see a lot of the societal norms over here as “crazy”.\n<<KatieSmile2>>\nYou might see their ways as disrespectful, but wouldn’t you say that’s just because this is how life is and always has been to you?\n<<Kishimoto>>\nHuh…\nI guess when you put it that way…\n<<Katie>>  <<KatieLuagh>> \nYep! It’s all about putting yourself in other people’s shoes!\n<<Kishimoto>> \nYeah… I suppose you’re right.\n<<Katie>> <<KatieNormal>> \nOh yeah, where’s your mom?\n<<Kishimoto>>\nMy mom? Oh yeah, she went off to work this morning.\n(I wonder why she didn’t wake us up?...)\nOh yeah, I’m assuming based on the fact that you were able to make this that you found  where everything is okay?\n<<Katie>> <<KatieSmile1>>\nOh yeah, of course.\nI mean, this isn’t really that big of a big house.\nNot to mention it's basically the same as mine.\n<<Kishimoto>>\nYeah, suppose so.\nSo, anything you want to do?\n<<Katie>> <<KatieNormal>>\nUm, well…\n<<KatieSmile2>>\n…the weather’s quite nice today; why don’t we take a walk?\n<<Kishimoto>> \nHm? Oh yeah, that sounds like a good idea.\nYou seem to be almost finished eating. So why don’t we clean up and then get out of here?\nOh wait actually, you probably want to grab a change of clothes from your house, don't you?\n<<MusicStop>> <<Katie>> <<KatieSmile1>> \nYeah. I’ll help clean up and go back to my house to put on a fresh change of clothes and then we can go!\nYou probably want to get changed too, I mean, you’re all bloody.\n<<BrightDays>> <<Kishimoto>>\nHuh? Really?\nOh yeah, dammit, I can’t believe I was walking around like this yesterday!\n<<Katie>> <<KatieLuagh>> \nHe he, it’s fine, don’t worry about it.\n<<KatieNormal>>\nReally, it’s my fault for trying to take you out the second you got out of the hospital.\n<<KatieSad>>\nActually, apart from the fact your clothes had blood all over them, it was a silly idea to try and take you out yesterday anyway.\nI should’ve just taken you straight back to your house.\nBut I got so caught up in my selfish desires that I didn’t account for your health…\n<<Kishimoto>>\nNah, don’t worry about it.\n<<Katie>> <<KatieNormal>>\nHuh?\n<<Kishimoto>>\nYou saw how I was. If I actually wasn’t fine, then you would’ve taken me straight home.\nNot to mention that I was the one to suggest the idea. If I wasn't feeling up to it I wouldn’t have mentioned the idea.\nSo don’t worry about it.\n<<Katie>> <<KatieSad>>\nReally?...\n<<Kishimoto>> \nOf course. You did nothing wrong!\n<<Katie>> <<KatieNormal>> \nOkay then…\n<<Kishimoto>>\nI’ll deal with the cleaning. You just head on home and get changed.\nCome back over when you’re ready.\n<<Katie>> <<KatieShockedNormal>>\nHuh? But you can’t be cleaning up my mess!\n<<Kishimoto>>\nNah it’s fine. It’s really the least I can do after you made that french toast.\n<<Katie>> <<KatieNormal>> \nOh, okay then. Are you sure?\n<<Kishimoto>>\nOne hundred percent sure!\n<<Katie>> <<KatieSmile1>>\nOh, well, I’ll see you soon then!\n<<Kishimoto>>\nYep, bye!\n<<Katie>> <<KatieSmile2>>\nBye!\n<<KatieFades>> <<NoOne>>\nKatie exits out the front door and I begin to clean up.\n<<RoadsideMorning>>\nI don’t have to wait long until Katie comes out of her house and for us to begin our walk.\n<<MusicStop>>\nWe silently proceed down the same road we walk through to get to school.\nA pleasant breeze is present and the light rustling of the trees makes for a wonderfully peaceful scene.\n<<MemoriesOfYou>> \nThough I can’t help but feel a sense of dread.\nFor Katie, the silence is probably peaceful and happy, for me, it’s dreadful.\nI can’t help but have my attention drawn to the blue outline in the distance.\nWorryingly, it’s become a lot more clear even just since yesterday.\n<<KatieAppear>> <<Katie>> <<KatieSmile1C>>\nWhat’s wrong, Haruki?\n<<NoOne>>\nHer cheerful voice and her happy smile just adds to my sense of dread and despair.\nI really don’t want to lose her.\n<<Kishimoto>>\nUm, i-it’s nothing…\n<<Katie>> <<KatieSadC>> \nOh… okay…\n<<NoOne>>\nIt’s exceedingly clear that by now, Katie has realized what I was looking at.\nThe silence is now filled with despair for the both of us.\nIt’s probably not the wave, but there’s more evidence pointing to the opposite.\n<<Kishimoto>>\nKatie?...\n<<Katie>>\nYeah?\n<<Kishimoto>>\nIf I die, I want you to die with me.\n<<Katie>>\n...\nI want that too Haruki…\n<<NoOne>>\nNothing but sadness is displayed on her face.\nI wish I could do something about that frown.\nBut alas I can’t.\n...\nWell I mean, there’s probably something I can do to temporarily alleviate her stress at the very least.\n<<Kishimoto>>\nUm… is there anything you want to do? Like anywhere you want to go?\n<<Katie>>\nUm…\n...\n…not particularly, no.\n<<Kishimoto>>\nOh, um… okay then…\n…not even some fresh fruit from the market?\n<<Katie>> <<KatieNormalC>>\nHuh? Um…\nIs it even open at this time?\n<<Kishimoto>>\nHuh? Um, yeah, I’m pretty sure so.\nI think I passed it a couple of times on Tuesdays while going grocery shopping during school holidays and such.\nI mean, there’s only one way to find out, isn’t there?\n<<Katie>> <<KatieSmile2C>>\nYeah, I suppose so!\n<<KatieLuaghC>>\nWell let’s go Kishimoto!\n<<KatieFades>> <<NoOne>> \nKatie, still holding onto my hand, begins sprinting down the road, pulling me along while doing so.\n<<Kishimoto>> \nHuh? Wait, won’t somebody get suspicious of why two teenagers who clearly meant to be in school right now are not?\n<<Katie>>\nHe he! Why did you suggest the idea then? Silly!\n<<Kishimoto>> \nI didn’t actually expect you to take such a liking to the idea!\nI just began thinking about watermelons! And then how I really wanted a watermelon! And then how to cheer you up! And they all just ended up merging together and now we’re here!\n<<Katie>>\nTee hee! You’re so silly Haruki!\nIt’ll be fine, don’t be such a worry wart! He he!\n<<NoOne>>\nAt least she’s clearly happier now than what she was before.\nI mean, I’m also a lot happier now than what I was before.\nI get to have my watermelon, and a day with Katie that promises to be nothing short of entertaining.\n<<MusicStop>> <<MarinaDay>> \n...\nThis isn't good.\n<<Babel>> \nKatie and I both know that.\nThe market isn’t set up, and there’s the recent usual lack of people around.\nThough if it were only that, we would be fine.\nBut no…\n…something else seems off too!\n<<Katie>>\nHey um… Haruki?...\n<<Kishimoto>>\nYeah?...\n<<Katie>>\nDoes something also seem… off, to you?\n<<Kishimoto>>\nYeah… but I’m not too sure what it is exactly…\n<<Katie>>\n...\nWait!...\n<<Kishimoto>>\nWhat is it?!\n<<Katie>>\nAre all the shop’s lights… off?\n<<Kishimoto>>\nHuh? Uh…\n<<NoOne>>\nLooking at it now, they actually are all off!\n<<Kishimoto>>\nUm… well er, I’m sure it’s just some kinda power outage or something.\n<<Katie>>\nUm, yeah, maybe but, don’t you think our power would’ve also gone out?\n<<Kishimoto>>\nOh yeah…\nAnd I mean, I doubt that the power only JUST went off now.\n<<Katie>>\nYeah…\n<<Kishimoto>>\nUm well, I mean, the only way to find out the truth is to check right?\n<<Katie>>\nY-yeah.\n<<NoOne>>\nWe both begin to walk over to the first shop to come into vision.\nAnd when we got there…\n<<KatieAppear>> <<KatieShockedNormalC>> <<KishiKatie>> \nHuh?\n<<NoOne>> \n…there’s piece of paper stuck to the door reading: “INDEFINITELY CLOSED”\nBeneath the text, at the bottom of the page, is the logo of the Japanese government.\n<<Kishimoto>> \nUm, I-I sure this is just one shop.\nHere, let’s go check out a few more.\n<<Katie>> <<KatieNormalC>>\nY-yeah…\n<<KatieFades>> <<NoOne>> \nWe both begin to walk to another shop and…\n…the same thing.\nA sign reading “INDEFINITELY CLOSED” with the Japanese government’s logo at the bottom of the page.\n<<Kishimoto>>\nOkay I’m sure this is just a coincidence…\n<<Katie>> <<KatieNormalC>>\nY-yeah, me too, let’s check out another one.\n<<Kishimoto>>\nYeah! I mean, t-third time’s a charm, right?\n<<KatieFades>> <<NoOne>>\nWe walk to yet another shop and…\n<<KishiKatie>> <<KatieAppear>> <<KatieSadC>> \n...\n<<NoOne>>\nYet another closed shop.\nAll the shops in sight have their lights off.\nThe only sounds to be heard are the ones of the wind and the seagulls.\nIt’s obvious we’re the only one’s here.\n<<Kishimoto>>\n(What’s going on?...)\nHere Katie, let’s just go back to the house.\n<<Katie>> \nUm yeah, sure, okay…\n<<NoOne>>\nI'm not getting a good feeling about any of this...\n<<RoadsideMorning>>\nWe both walk back down the road to our houses.\nThe outline is still visible.\n...\nEveryone, whether on social media or real life, is going on about this mysterious tsunami wave…\n…nobody is going outside…\n…shops are all closing down and, judging by the logo and the notices we saw, the government is presumably encouraging it…\n…and due to that, the economy is inevitably going to start spiraling soon…\n…and the government hasn’t said anything!\nIf it weren't real, they’d be trying to convince us, unless they endure catastrophic social and economic destruction.\nBut they’re not…\n…and that can only mean one thing…\n...\n<<MusicStop>> <<BlackScreen>>\nKatie and I arrive back at my house and…\n<<Alarm>> <<ScreenShake>> \nSirens start blaring from the TV, a pure black screen displaying text at the top of the screen reading: “J-ALERT EMERGENCY BROADCAST SYSTEM”.\nI hadn’t left or even turned on the TV in the first place today, so it must’ve turned on by itself.\nBelow the heading text is even more text; evacuation instructions.\nBefore I even have time to comprehend what’s going on, an eerie, robotic voice begins to talk.\n<<TV>> \nTHIS IS AN EMERGENCY ANNOUNCEMENT ISSUED BY THE GOVERNMENT OF JAPAN.\nTHIS IS AN EMERGENCY ANNOUNCEMENT ISSUED BY THE GOVERNMENT OF JAPAN.\nPLEASE PAY ATTENTION AND CLOSELY FOLLOW THE PROCEEDING INSTRUCTIONS.\nPLEASE PAY ATTENTION AND CLOSELY FOLLOW THE PROCEEDING INSTRUCTIONS.\n<<NoOne>>\nSweat is pouring down my back.\nI can’t do anything but stand here.\nIt feels like my body’s just been taken away from me.\nThe same feeling I had when I discovered my friend’s body all those years ago…\n…the one who died because of me…\n<<TV>>\nABANDON ANY UNNECESSARY BELONGINGS AND PLEASE PROCEED TO EVACUATE YOUR IMMEDIATE AREA AS FAST AS POSSIBLE.\nABANDON ANY UNNECESSARY BELONGINGS AND PLEASE PROCEED TO EVACUATE YOUR IMMEDIATE AREA AS FAST AS POSSIBLE.\nFIRST BATCH OF EVACUATION SQUADS WILL BE DEPLOYED AT THE LOCATIONS DISPLAYED ON SCREEN RIGHT NOW.\nFIRST BATCH OF EVACUATION SQUADS WILL BE DEPLOYED AT THE LOCATIONS DISPLAYED ON SCREEN RIGHT NOW.\nPLEASE SURVEY THE TIMES AND LOCATIONS ON SCREEN AND PROCEED TO THE CLOSEST RESCUE POINT IMMEDIATELY.\nPLEASE SURVEY THE TIMES AND LOCATIONS ON SCREEN AND PROCEED TO THE CLOSEST RESCUE POINT IMMEDIATELY.\n<<NoOne>>\nThe voice continues to repeat the same words.\nI'm in such shock I don’t know how to react.\nAll I can do is stare straight ahead.\nI…\n…I can’t believe this.\nWhat’s going to happen?...\nWill I even get help?...\n...\n<<Katie>> \n*sniff* *sniff*\n<<NoOne>> \nI hear the soft weeping of Katie.\nAnd then…\n...I get this feeling.\nIt feels almost as if my body was just returned to me.\nI know what I have to do.\n<<AlarmStop>> <<Ain'tHappening>> <<Kishimoto>> \nKatie…\nI’ll get you out of here.\nNo matter what.\n<<Katie>>\n*sniff* *sniff*\n<<NoOne>>\nKatie wraps her arms around me.\n<<Katie>> \nYou promise?...\n<<Kishimoto>>\nI promise.\nI’ll get you, and everyone else I can out of here too.\n<<NoOne>> \nThat’s a lie.\nI’m not able to do that.\nBut I’ll save everyone I absolutely can.\nThat’s the truth.\n<<Katie>>\nReally?\n<<Kishimoto>> \nReally\nAre your parents home?\n<<Katie>>\nU-um… no… m-my mom works as a nurse and leaves for work early in the morning, and she had to stay at the hospital last night…\nAnd my dad's also at work...\n<<Kishimoto>>\n...\nOkay Katie, I need you to be brave here, and just accept the fact that we can’t do anything to save her right now.\nFirst and foremost, we need to save ourselves first. We’re in control of us, therefore we’re the easiest people to save.\nIf we just take this slow, and don’t panic it will all be okay.\n<<Katie>> \n*sniff* O-okay…\n<<Kishimoto>>\nGood girl, now…\n<<NoOne>>\nDespite my words, I’m as worried as anyone else.\nI really should take my own advice shouldn’t I?\n<<Kishimoto>> \n…first thing’s first, we need to find out where we should be going.\nCould you go and gather as many essentials as possible?\n<<Katie>>\nU-um, like w-what exactly?... Sorry…\n<<Kishimoto>>\nFood, water, clothes, stuff like that.\n<<Katie>>\nO-okay!\nB-but, I don’t h-have a lot in my house…\n<<Kishimoto>> \nThat’s okay, we have plenty of food and stuff here. We can go get some clothes for you after we’ve finished everything here.\nActually, now that I think about it, we can probably make-do without a change of clothes.\nYou don’t mind, do you? It’s just that we really should only be taking the essentials.\n<<Katie>>\nO-oh no! I understand fully! It’s c-completley fine! I’ll go get supplies right away!\n<<NoOne>>\nShe scurries off, clearly trying to hold back tears.\nHaving to shout over the sound of the sirens is really just stressing me out more than it has to.\nI take a deep breath and walk over to the TV.\n<<Kishimoto>>\nNo way!\n<<Katie>>\nWhat is it?\n<<NoOne>>\nWe’re having to shout over to each other from different rooms.\nThis is probably the only time I’ve ever been happy the walls in this house are so thin.\n<<Kishimoto>>\nThere’s a rescue point at the marina!\nRight where the market usually is!\nEven better, the squad should be here soon!\n<<Katie>>\nReally?! We should make our way there right away then!\n<<Kishimoto>> <<MusicStop>>\nOkay, I’ll take some food and water as well then!\n<<NoOne>>\nI run into the kitchen, grab as much supplies as I can, and then Katie and I proceed out of my house.\n<<RoadsideFoggy>> <<What'sDoneIsDone>>\nWe come out onto the road.\nThe sirens blare from the TV inside my house behind us.\nCar are stuck in a traffic jam that seems to extend on infinitely.\nKatie and I sprint down the road, dropping our supplies as we do.\nBut there’s no time to go pick stuff up from the ground.\nEven though we do actually have plenty of time to get there, we still need to be one of the first.\nThey’re obviously not going to have enough space in what I can only assume are a couple of helicopters for everyone in the area.\nAnd it said on the TV that a squad will only be deployed at each evacuation point three times.\nNot everyone waiting on an escape will get one; that’s just the harsh reality.\n<<FoggyMarina>> \nWe come to the marina.\nThe sky has turned a melancholic gray, and it looks like it could rain at any moment.\nA small crowd surrounds Katie and I.\nTheir profile is nothing but depressive; sad faces as far as the eye can see.\nEveryone is weeping miserably.\nThe crowd is definitely soon to get bigger.\nMost people are still on the road up the hill in their cars, stuck in a traffic jam.\nThe cars seemed to extend down the road infinitely, never moving.\nAt least that’s what it looked like as Katie and I were coming down here.\nIf I were them, I’d just abandon my car and walk the rest of the way.\nI mean, I kind of understand for the people still far away from the evacuation point, stuck in the infinite traffic jam.\nBut for everyone up on the hill, they can just walk.\nActually, that seems to be what a few people are doing by the looks of things.\nA lot of people…\nHundreds of thousands of desperate people pour down the hill in droves.\nI clutch Katie’s hand as tight as I can.\nAs long as I have her, I’ll…\n...\n…I need to find Fujinami.\nI really can’t just leave him.\nI check my phone to survey the time.\nIt’s ten minutes before the evacuation squad arrives.\nAs long as Katie gets out of here I'll be okay.\nIf I can just find Fujinami quickly enough to get back here before the crowd gets unfathomably big and the evacuation squad comes, then we’ll all be able to get out of here together.\n<<MusicStop>> \nUs three…\nIt’s almost as if Katie’s symbolizing the future and Fujinami is symbolizing the past.\n<<Babel>>\nMy memories.\nAs much as I hate to admit it, I don’t actually hate the guy.\nAs annoying as he is, he’s always there for me.\nNo matter what I do, where I go, he’s always my friend.\nHe lightens up the mood when it’s down…\n…he is my best friend, and it fills me with so much regret with how horrible I was to him.\nI mean, I don’t even know his first name.\nAnd that’s why I need to find him and get him out of here.\nSo I can apologize to him and repay all my debt to him by saving him from this life-threatening situation.\nYes… that is what I have to do.\n<<KatieAppear>> <<KatieSadC>> <<Kishimoto>>\nKatie… I have to go find Fujinami.\n<<Katie>>\nOh, y-your friend?...\n<<Kishimoto>> \n…Yeah.\nMy friend…\n<<Katie>> \n...\n<<NoOne>>\nHer face is filled with sadness and regret.\n<<Kishimoto>>\nDon’t worry Katie, it’ll be okay.\nI’ll come back, and we’ll all get out of here.\nThe three of us.\n<<Katie>>\nBut Haruki… look…\n<<NoOne>> \nShe points behind me, to the hill where everyone is coming down from.\nThere’s even more people now; an unfathomable amount.\n<<Katie>> \n…I’m sorry but, there’s no way you can get up that hill…\n…without getting lost in the crowd that is…\n<<Kishimoto>> <<MusicStop>> \n...\n<<Katie>>\n...\nI just don’t want to lose you Haruki…\n<<GoodbyeToYou>>\nWe should focus on saving ourselves…\n…we just… have to leave everything behind…\n…we have no choice, Haruki…\n<<Kishimoto>>\n...\n<<NoOne>>\nI already know everything she’s telling me.\nI just don’t want to accept the facts…\n…I don’t want to end my relationship with Fujinami like this…\n…if I have to say goodbye to him, then I don’t just want memories of our time together…\n…I also want the memory of me actually saying goodbye to him.\n<<Katie>>\n...\n…I’m sorry Haruki…\n<<Kishimoto>>\n...\nThis is all just… just… just so sudden.\nEverything was fine one minute, and then awful the next.\nSeriously, how does this happen?\nIt feels like… like…\n...\n<<NoOne>>\nI struggle to find the words for what I want to say.\n<<Kishimoto>>\n…like my happiness is…\nWait, no…\n<<NoOne>> \nBefore I finish the sentence, I realize what I was about to say is wrong.\n<<Kishimoto>> \nI know exactly why this is happening…\n<<Katie>> <<KatieNormalC>> \nHuh?\n<<Kishimoto>> \nIt’s…\nIt’s God's way of helping me to fulfill my purpose.\nMy purpose… of being with you.\nI decided a while ago now that being with you is my purpose in life.\nGod’s helped nudge me in the right direction all this time; he’s been leading me along the path of purpose… until I eventually created one…\n<<Katie>> <<KatieSadC>>\nI-I…\nI… I don’t know what to say but…\n<<KatieSmile2C>> \nI’m filled with so much happiness right now.\n<<Kishimoto>>\nHuh?\n<<Katie>> <<KatieSmile1C>>\nIt makes me so happy to hear those words from your mouth Haruki.\n<<Kishimoto>> \nI… but… but what’s your purpose?\n<<Katie>> <<KatieNormalC>>\nHuh?\n<<Kishimoto>>\nWhat’s your purpose? Surely God isn’t just doing this for exclusively my happiness!\nWhat’s he doing for you?\n<<Katie>> <<KatieSmile1C>> \n...\n…my purpose is to be with you Haruki.\nThat’s what I want.\nYou make me so, so happy.\nAnd I want to be with you forever…\nI love you, Haruki.\n<<Kishimoto>>\n...\nI love you too, Katie.\nPlease, just… never leave me…\n<<Katie>> <<KatieLuaghC>> \nHe he! I’d never do that!\n<<Kishimoto>>\nH-heh…\n<<NoOne>>\nEven in this time of sorrow and dread, I can’t help but display a warm smile.\nThis, this is the moment I wish could last forever.\nI could know that nothing bad would happen; that it would just be me and her in our state of admirable bliss.\nBut alas, that cannot happen.\n<<KatieFades>>\nThe crowd suddenly starts shrieking.\nKatie and I turn around to the sight of about three helicopters, each looking like they could hold about 9 people maximum.\nI’ve never felt so thankful for not being at the back of a queue.\nKatie and I begin to sprint towards one of the helicopters; as do the rest of the crowd.\nThe evacuation squad frantically ushers people to get in.\nWe both are able to successfully push through to the front of the crowd up to a helicopter, where an evacuation squad member pulls both me and Katie into the vehicle.\nSafe at last we both sit down in the seats closest to us.\nThe helicopter fills up within a second and the squad begins to prepare the safety precautions for take-off.\nObviously, the enigmatically large crowd surrounding the vehicle makes it near impossible to do so.\nThe squad begins an attempt at crowd control, though to no avail.\nPeople attempting to jump into the vehicle, people attacking the squads, it’s all but beyond anarchy.\nAnd then just as I begin to think it can’t get any more shocking…\n<<ScreenShake>>\n*BANG* *BANG* *BANG*\n<<Squad>> \nSHIT!!\nHELP-!\n<<NoOne>> <<ScreenShake>> \n*BANG*\nThe sound of gunshots continue to echo loudly through the horrific screams of the crowd.\nPeople are dying left right and center, a mass killing is taking place right in front of me.\nThis is honestly beyond anything a joke.\n<<Kishimoto>>\nKATIE DUCK!\n<<NoOne>> \nI grab Katie’s hand and pull her down to the floor.\nWhere we were sitting there was a window directly where our heads were.\nWe very easily could’ve been shot in such a compromising position.\nThe other scared passengers look at us, confused and worried.\nAnd then…\n<<ScreenShake>>\n*BANG*\nAnother gunshot is fired, this time it flies through a window of our helicopter and hits one of the passengers square in the head.\nBlood splatters everywhere and everyone in our vehicle is sent into a frantic craze.\nThe murderer outside is ranting on about some crazed nonsense as he continues to fire.\n<<???>> \nAHHHHH!!!\nDO YOU HAVE ANY IDEA WHAT YOU’RE DOING!?-\n*cough* *choke*\n<<Squad>> \nTHE CRIMINAL HAS BEEN DEALT WITH! SQUAD F, G AND H, GET TO IT! WE’RE ALREADY LATE ON TIME!\n<<NoOne>>\nThe squad members frantically finish safety precautions and Katie and I return to our seats.\nThey’re in such a rush they don’t even dispose of the body on our helicopter, nor do they clean the gore.\nThey close the doors and immediately begin to fly off.\n<<BlackScreen>> \n...\n<<MusicStop>> <<Katie>>\nHaruki…\n<<Kishimoto>>\nYeah?...\n<<Katie>>\nI… I’m scared… Haruki…\n<<NoOne>>\nWell I mean, of course she is. There’s the bloodied corpse of an innocent person right in front of her.\n<<Kishimoto>>\n...\n<<Katie>> \nIt feels like I’ve lost everything…\n…but…\n<<NoOne>>\nHm?\n<<Katie>> \nIt doesn’t feel unfair…\nI still have you, Haruki.\nI love you.\n<<GoodbyeToYou>> <<Kishimoto>>\n...\n<<NoOne>>\nI can’t hold back my tears.\nThey silently pour down my cheeks as my sorrow consumes me.\nI don’t know why those words feel so painful to hear now.\nThey’re what I want to hear right? They’re what I need to hear right now.\nYet they just make me so…\n...\n…so happy.\nI’ve just lost everything.\nBut I still have Katie.\nThe happiness she provides me with just adds to my pain.\nBut I’m with her, so I know everything will be okay.\nOf course it will.\nIt always is.\nI see everyone here, their head in their hands, sobbing.\nAnd it makes me so grateful to know that I haven’t lost all hope.\nHope gives you happiness.\nIf you lose your hope, you lose your happiness.\nYou have to be an optimist even when it’s hardest.\nThat’s the only way to ever proceed.\n<<Kishimoto>>\nYou’re right Katie.\nWe still have each other.\nThat’s all we need right?\nApparently our presence makes us immortal, remember?\n<<Katie>>\nHe he! I do remember that…\n...\n<<MusicStop>> <<Pilot>> \nOh shit!\n<<Squad>>\nHuh? What is it?\n<<What'sDoneIsDone>> <<Pilot>> \nThe wave! Right in front of us!\n<<Squad>>\nHuh? W-what?! What the hell?! Uh, uh! S-shoot it or something, quick!\n<<Pilot>> \nIT’S WATER! SHOOTING AT IT ISN’T GOING TO DO ANYTHING!\n<<Squad>>\nUm um!\nOh my goodness, yeah… anyone on this thing is going to die…\n<<Pilot>>\nWell then get everyone off dammit! We have parachutes in the back!\n<<Squad>>\nHuh what? But don’t we only have like, eight? Somebody’s going to end up stuck here!\n<<NoOne>>\nKatie and I turned to each other the moment we hear that, we got up and ran to the back and took out the parachutes.\n<<Kishimoto>>\nQuickly everyone! Grab one!\n<<???>>\nHuh? But didn’t they just say that we don’t have enough for everyone?!\n<<Kishimoto>>\nC’mon! Surely you’re not trying to save the corpse!\nI’m sorry but, they’re beyond saving. You have to save yourself!\n<<???>>\nHuh? Oh yeah, I suppose with her dead we only have eight people here.\n<<Katie>>\nHaruki! How do I put this thing on?!\n<<Kishimoto>>\nHere, don’t worry, I’ll help you Katie!\n<<Squad>> \nEVERYONE GET THE HELL OFF THIS THING! STAY ON HERE ANY LONGER AND YOU’LL END UP DEAD!\n<<???>>\nWON’T WE END UP DEAD ANYWAYS?!\n<<Squad>>\nSIR, YOU MIGHT AT LEAST HAVE SOME CHANCE IF YOU GET THE HELL OFF THIS THING RIGHT NOW!\n<<NoOne>>\nEveryone frantically put their parachutes on.\n<<MusicStop>> \nAnd everyone was also similarly reluctant to jump off.\nEveryone stood there in unison, the same fear shared among our small group.\nThe clouds are all we can see.\nIf this were a normal tsunami wave, we’d just be able to carry on flying to our location.\nBut no…\n…this is the biggest tsunami wave in history.\n<<GoodbyeToYou>>\nA tsunami wave so big, it reaches above the clouds.\nAnd not only that, but there doesn’t seem to be anything that could’ve caused it.\n...\nScientists are always trying to explain everything using math and human concepts.\nBut, there’s a lot of things that are scientific mysteries.\nA lot of things they don’t understand.\nThat they can’t explain.\nAnd that’s because they try to make everything human.\nThere are many things beyond human.\nThings that we can’t explain.\nI think the big one is…\n“Why are we here?”\n“What is the meaning of life?”\nNobody can seem to come up with an answer for those questions.\nIs it to fulfill our purpose?\nI doubt it somewhat.\nNot fully, only somewhat.\nBut this wave right here, it’s God’s doing.\nHe did this.\nAnd not as punishment.\nI’ve never believed in coincidences.\nI think everything is planned out until the day we die.\nEverything is certain.\nAnd so is my death.\nMy life is over.\nIt may seem short but, this is the age I was meant to be when I died.\nI’m not sad.\nGod wants to see me. I must have faith in him.\nGod’s always challenging our faith, but no matter what, we have to believe in him.\nWe have to be loyal to him.\nAnd so I must be in this case.\nI have to confront death and truly accept God.\nIt’s not like I even have any regrets anyways.\nI fulfilled my life purpose.\nThis is the day I die, and I’m still here with Katie.\n<<MusicStop>>\nI have no regrets.\n<<Flash>>\nGod",
		"position": {
			"x": 74,
			"y": -98
		},
		"colorID": 0
	}
]