[
	{
		"title": "Game",
		"tags": "",
		"body": "...\n<<Kishimoto>>\nW… I…\n<<Release>> \nHeh…\n<<NoOne>> \nI can’t help but have a smile display on my face.\nI feel genuinely… happy right now.\nI’m in Heaven.\nIf there’s any sort of proof to have faith in God… it’s this.\nI stand idle for a brief period as I survey my surroundings.\nIt’s beyond beautiful, but not in the conventional way.\nIt’s beautiful in a way that’s beyond any kind of life.\nIt’s a kind of beautiful too amazing for Earth.\nOne that human language cannot describe.\n<<???>>\nH-heh… I-I *sniff* I c-can’t believe it…!\n<<NoOne>>\nI recognize the soft, feminine voice almost immediately after it speaks.\n<<???>>\nHah! No way dude! It’s Kishimoto!\nMan, you don’t understand how excited Katie and I got waiting for you dude!\nLike seriously, I ended up coming with like… a million different jokes I could tell you!\n<<Kishimoto>> \nHeh man, Fujinami I’m not all too sure I want to hear them dude.\n<<Fujinami>> \nNo bro, trust me, some of these are hilarious.\n<<Kishimoto>>\nAnd I’m assuming the rest are awful.\n<<Fujinami>>\nNo no no no. Katie, you think my jokes are funny, right?\nYou just never laughed at them because they were just THAT funny.\nSo funny you forgot to laugh!\n<<Katie>>\nU-um *sniff* yeah…\n<<Kishimoto>> \n*sigh* man…\nSee Katie? I promised I’d never leave you.\n<<Katie>>\nHeh… you’re right Haruki…\n…I never doubted you for a second.\n<<NoOne>>\nA warm smile spreads itself across my face after hearing those words.\n<<Fujinami>>\nWRONG! DING DING DING!!\n<<NoOne>> \nA warm smile does not spread itself across my face after wearing THOSE words.\n<<Fujinami>>\nDude Kishimoto! She was crying her EYES out saying “Oh dear, dear me! When will my darling Kishimoto come back!?”\n<<NoOne>>\nShe did not say that.\n<<Kishimoto>>\nMan!... You do realize she refers to me by my first name, right?\n<<Fujinami>>\nOh er, uh…\n<<Katie>>\nHee hee! It seems like Haruki spotted a little error in your lie!\n<<Fujinami>>\nAw man, shut up! I bet you couldn’t lie to save your life!\n<<NoOne>>\nYeah. She’s dead.\n<<Katie>>\nWell that’s because I choose not to lie! Honesty is the most important thing above everything else in life!\n<<Fujinami>>\nWELL! Number one: you’re not alive. Number two: any old fool can tell the truth, but it takes a real genius to get away with a lie!\n<<Katie>>\nHey! Don’t call me a fool!\n<<Kishimoto>> \nYeah Fujinami. I’m sorry but you calling someone else a fool is a little bit hypocritical don’t you think?\n<<Fujinami>>\nHuh? What no? What are you saying?\nOHHHHHH WAIT!! You’re saying that I’M a fool, aren’t you!\n<<Kishimoto>>\nEr, yeah.\n<<Fujinami>>\nHey! That’s…! Mean! I think…\n<<Kishimoto>>\nUm… o-okay…\n<<Katie>>\nHe he!\n<<Kishimoto>>\n*Chuckle* heh…\n<<Mom>>\nHaruki?...\n<<Kishimoto>>\nMom?...\n<<NoOne>>\nShe stands in idle, staring shocked at me, before her expression becomes a warm smile.\n<<Kishimoto>>\nHeh...\n<<NoOne>> \nYou know… being here with these people, my one true love, Katie, my best friend Fujianmi, and my beloved mother has made me realize…\nThere are many things scientists try to explain through human concepts…\n…but there’s one thing that they can’t explain.\nOne thing that is beyond human, and therefore no human concepts can explain it…\n…Relationships.\nAnd the meaning of life is to make relationships.\nTo find your one true love; the person perfect for you.\nTo make wonderful friends that never fail to make you laugh or smile.\nAnd then secondary to that, is accomplishing whatever life purpose you’ve created for yourself.\nRelationships… love… those are all concepts beyond human…\n…the only thing you take with you to the afterlife…\n…are the people most special to you.\nWhere you can spend the rest of eternity in harmony.\nThere’s tons of people out there who’ll tell you they’re “just normal”.\nBut no one is “normal”.\nThat’s a term humans have invented, and the term's meaning revolves around the human concept of society.\nThere is no one without purpose.\nWe’re all our own person, with our own personality, struggles, purpose and relationships.\nAnd of course…\n…our own one true love.\n…A person we can only find if we listen to God.\nIf we listen to him closely and follow his every command…\n…he’ll lead us to them.\n<<MusicStop>> \nJust like he led me to Katie.\n<<ED>>\nThank you, Lord, for giving me the talent to create this wonderful game and share your messsage with the world. Thank you for your promise to me, and I hope I can be with her soon.",
		"position": {
			"x": 535,
			"y": 216
		},
		"colorID": 0
	}
]