[
	{
		"title": "Game",
		"tags": "",
		"body": "<<HeartMonitor>>\n<<Doctor>>\nUm... *sigh* I... I'm not too sure how to tell you this but... um...\n...we can't do anything about your brain tumor.\nEven if we could, I mean, you don't have anyone left to pay for the bills.\n<<Kishimoto>>\n...\n<<Doctor>>\n*sigh* Kid... man.\nWhat an awful life you've had.\n<<Kishimoto>>\n...\nI... I...\n...I remember everything...\n<<Doctor>>\nHuh? Sorry what?\n<<Kishimoto>>\nQuick! Write this down!\n<<Doctor>>\nHuh? W-write what down?\n<<Kishimoto>>\nWhat I'm about to tell you...\n<<HeartMonitorStop>>\n<<Date>>\n<<FaithLoveAndDeath>>\n<<NoOne>>\nThere's tons of people out there who'll tell you they're \"just normal\".\nBut what is \"normal\"?\n<<SchoolGate>>\nI stand outside my school gates.\nI don't want to be normal.\nBeing \"normal\" means you have no identity.\nIf you have no identity, then you just exist.\nWithout an identity you don't contribute to the world.\nAnd not contributing to the world means you just exist; you don't do anything.\nYour purpose is to exist.\n<<Hallway1>>\nThough despite this depressing reality, I find that far too many people desire to be \"normal\".\nWhy?\nWho wants to live such a meaningless life?\n<<Hallway2>>\nI think I'm the only one in this school who doesn't want to be \"normal\".\nI want to stand out.\nI want to be remembered.\nThough against my wishes, I seem to be the only one who gets to be normal.\nI just come to school everyday, talk to my friends, do my work, and come home.\nWith the level I perform my studies at, I'm more than likely going to end up with some joe-schmoe office job.\nI've come to accept this fact; there's simply nothing that can be done about it anyway.\nThat's why I've all but given up on life.\nI'm sarcastic, cynical, and overall not the most pleasant person to be around.\n<<ClassroomDay>>\nAnother day, eh?\nI wonder how many first periods I've sat through altogether in my academic career?\n<<FujinamiAppear>> <<FujiLuagh>> \nAs I ponder this, a blonde boy walks up to me; a mischievous grin present on his face.\n<<Fujinami>>\nKishimoto, you look tired. Thinking about me all night, eh?\n<<Kishimoto>>\nYeah, I couldn't get to sleep with the image of your face in my mind.\n<<Fujinami>> <<FujiSmile2>> \nHeh, I suppose that's to be expected when you're the friend of someone as beautiful as me.\n<<Kishimoto>>\nI didn't realize someone could look so ugly to the point where they're actually scary until I met you.\n<<Kishimoto>> \nI'm terrified just looking at you.\n<<Fujinami>> <<FujiAngry>>\nHey! What the hell man!? That was totally uncalled for!\n<<Kishimoto>>\nI was told by my parents to always be honest.\n<<Fujinami>>\nDid they not also tell you that if you don't have something nice to say, then don't say it?\n<<Kishimoto>>\nYes but, they also said: \"Above all else, honesty is the most important thing in life\".\nThey just said to tell the truth, it doesn't matter if it's nice.\n<<Fujinami>> <<FujiSad>>\nMan, your parents suck.\n<<FujinamiFades>> <<NoOne>> \nThe bell begins to ring, signaling the start of first period.\nThe teacher walks in shortly after and Fujinami retreats out the door; presumably back to his classroom.\nDespite me knowing I'm set up for an office job, I still do my best to listen and take notes in class.\nIt's not like I believe that I might be able to change my future if I try hard enough,\nI just figure it's better to be normal and just exist rather than being a complete failure.\nDespite this, today I'm not really that concerned about taking notes, as the teacher is just kind of droning on about meaningless nonsense.\nI begin to look out the window.\n...\n...\n...\nI now realize that there's nothing interesting to look at out there.\nI don't really understand why bored students do that.\nLooking out the window I mean.\nThere's nothing out there they haven't already seen, and it's not like anything's going on out there or like they even want to be there.\nOr at least they don't want to be there more than they do home.\nIt's confusing.\nThough as someone who looks out the window when they're bored, I’m being a little hypocritical here, aren't I?\n<<ClassroomDay>>\nFirst period ends and the second one begins.\n<<MusicStop>>\nNothing much really happens as usual.\n<<Hallway1>> <<Idiot>>\nIt's lunch time now and I'm walking down the hallway.\nMost days I go and eat in the cafeteria, though sometimes I wake up in the morning and go: “I really, really, do not want to talk to Fujinami today”.\nOn days like that I usually make myself a bento in the morning and eat somewhere far away from the cafeteria where I know he won't find me.\nIt's not like Fujinami is my only friend; not at all. There's two other guys I'm pretty cool with: Youhei Yoshimoto and Akira Kido.\nThey were the first guys I met in the first week as a freshman, and we almost instantly formed a friend group.\nThen one day we were sitting in the cafeteria and saw Fujinami sitting on the floor eating by himself.\nWe felt sorry for him and asked if he wanted to eat with us.\n“Really are you sure?” I remember him saying.\n“Of course, dude. We wouldn't want somebody eating on the floor.” Kido explained.\nHe sat with us, and for the entirety of the time we ate he incessantly thanked us; so much to the point where it made all of us feel uncomfortable.\n“You guys are actual saints, thank you so much.”\n“Um, yeah, no, again it's no problem. You really don't have to thank us this much.” Yoshimoto told him, pretty heavily implying that he wanted Fujinami to shut up.\nEven after we had finished eating he followed us around.\nThough granted, we were mostly to blame there, as he had asked us if it was okay for him to hang out with us after we had finished our food and in an act of sheer stupidity we let him.\nBut to be fair, seeing him all alone on the floor like that previously, kind of made it feel like we didn't have much of a choice.\nI mean if we didn't let him hang out with us, we all knew he would've just gone back to moping around the school by himself.\nWe couldn't really endure the guilt.\nAs we walked through the hallways, doing nothing in particular, the air was dead still and the only sound to be heard were our footsteps.\nWe'd usually be chatting away happily without a care in the world at this time, but with Fujinami with us, we just felt as if we couldn't.\nAfter a while of just walking around in increasingly awkward silence, I heroically spoke up.\n<<Kishimoto>>\nHey, uh... you guys want to hear a joke?\n<<Kido>>\nUm, sure?\n<<Yoshimoto>>\nYeah, I guess.\n<<Fujinami>>\n*gulp* A-a-are you sure I'm worthy enough to hear a joke come from a saint's mouth?\n<<Kishimoto>>\nUm, yeah, no, it's fine.\n<<MusicStop>>\n*ahem*\nI'm reading this horror novel in braille.\nSomething bad's about to happen; I can feel it.\n<<Kido>> \nOh, that's... funny I guess-\n<<ScreenShake>> <<Idiot>> <<Fujinami>>\nBWAHAHAHAHAHAHA!!!!!!!!!!!!\nTHAT'S THE FUNNIEST THING I'VE HEARD IN MY ENTIRE LIFE!!\n<<NoOne>>\nHe must've been starved for entertainment his whole life then, because he was on the floor looking as if he was having a seizure.\nWe all blankly stared at him as he rolled around on the floor until we got the bright idea to start yelling for help.\nAfter somebody heard our cries he was taken to the nurses office and we didn't see him for the rest of the day.\nWe all thought that was the end of that whole fiasco until Fujinami came up to us the following day again.\nActually, that joke must've had quite a large impact on him, because he decided that he'd specifically swarm me for the rest of the day, and the day after, and the day after that.\nHe kept going until we were officially recognised as friends.\nWell, less “until” and more for just... well, forever really. He kept going on forever.\nFun fact: if you couldn't already tell, he's still going to this day!\nI really hate being associated with someone like him, because I know it seems like he's just some lonely kid who just needs a helping hand but, don't let him fool you: he's a total dipshit.\nAnd even though I'm apparently friends with the school weirdo, people still just treat me like a wallflower!\nBut at least I still have Kido and Yoshimoto.\nActually wait...\nI haven't talked to those guys ever since me and Fujinami became “friends”...\nThey just deserted me, didn't they?!\nSo I really am stuck with Fujinami!\nThis sucks...\n<<Courtyard>>\nI go outside with my bento to where I usually eat my lunch when I don't get something from the cafeteria.\nEven on days when the cafeteria is full, Fujinami always manages to get him and I a seat.\nHe always says the same thing before he's about to act out his master plan:\n“Okay, I'm gonna go scare off some girls away from their seats and we can sit there”.\nHe always then proceeds to do exactly that.\nThough all he has to do is stand there and they run away; usually out of fear that Fujinami is going to hit on them or something.\nPutting myself in the shoes of a girl who Fujinami is hitting on sends shivers down my spine.\n<<MusicStop>>\nI step outside into the courtyard where I like to eat.\n<<MemoriesOfYou>>\nNobody ever seems to be here and can't really figure out why.\nI mean, for a start it's the perfect place for couples.\nSitting under a tree on a hot summer's day, plopping food into each other's mouths.\nI mean, it's peak highschool romance.\nNot to mention it's just a nice spot to eat anyway.\nThere's one specific tree I personally like to eat under, so I begin to make my way over to there.\nAnd then I notice something...\n...there's a girl sitting under MY tree! MY tree!\nThat's my tree! She can't sit under MY tree!\nI angrily approach her, clutching my bento in one hand.\n<<Kishimoto>>\nHey, that's my tree!\n<<KatieAppear>> <<KatieNormal>> <<NoOne>>\nShe gazes up from the ground, she has short black hair.\n<<Kishimoto>>\nYou can't sit under my tree! It's my tree!\n<<NoOne>>\nShe gazes deep into my eyes; she has an irresistibly cute look to her that makes me begin to feel a little bad for scolding her.\n<<Kishimoto>>\nUm, here, uh... why don't we compromise?\nYou get one side of the tree, I get the other. Fair?\n<<NoOne>>\nShe continues to silently gaze up at me.\nYou know, something seems oddly familiar about this girl.\nI don't think I've ever talked to her before.\nI don't think I've even ever seen her before.\nBut something seems familiar.\nI just don't know what.\n<<Kishimoto>>\nHuh?\n<<NoOne>> \nShe begins pointing down at the grass next to her and tilts her head; supposedly asking if I want to sit there.\nWhat's with this girl? Can she not speak?\n<<KatieFades>> <<Kishimoto>>\nUm... er, yeah, I'll just... sit here...\n<<NoOne>>\nI place myself down next to her and silently eat from my bento, taking occasional quick glances at her.\nAnd then I finally realize who it is.\nA few months ago, I remember there was all this gossip about this American girl joining our school.\nEveryone was so excited for a non-Asain, English speaking American to come along and they just couldn't shut up about it.\nI remember thinking at the time how stupid it was that they were getting that excited over an American coming to our school when she obviously wouldn't be able to speak Japanese.\nAnd then I remember the excitement disappearing as fast as it came.\nI suppose they finally realized at some point that she couldn't speak their language and gave up on being nice to her.\nI can't really blame them honestly.\nYeah, I suppose it's sort of heartless to just completely abandon some kid who's just had to leave their friends and everything they love behind and go to a new country that might as well be on a different planet for Americans,\nbut, I mean, they're not going to teach her Japanese. It's not the responsibility of some highschoolers to teach some kid one of the most complex languages in the world.\nJudging from the fact she hasn't said a single word to me at all, it doesn't look like the teachers have actually bothered either.\n...\nWell, I mean, it's not like it's any of my business.\nAs I was saying, it's the teachers' responsibility to teach her Japanese; not some highschool kids.\n...\nBut, it doesn't really look like the teachers are doing their job...\n...\nAnd I mean, it's not my responsibility to help her... but...\n...it is my choice.\n...\nI think back to the magical spells taught to us in English class.\n...\n<<KatieAppear>> <<Kishimoto>>\nApple\n<<NoOne>> \nPhew, that was a close one.\nI almost got the English word for “hello” and “apple” mixed up, but I was able to correct myself just in time.\nBut despite my quick thinking, she's looking at me as if I actually did say “apple” instead of “hello”.\n...\nOh now I see the problem here.\nI must've gotten the pronunciation wrong.\nI once again think back to the stuff I've learnt in English class until I eventually feel confident that I know the proper pronunciation.\n<<Kishimoto>>\nOrange\n<<NoOne>> \nOkay, I've made one tiny mistake so far, but you have to make mistakes to fix them.\n<<KatieShockedNormal>> \nThe girl continues to stare at me for a little longer, until she starts frantically checking her lunchbox for something.\nI don't really know what she's doing, but something about the way she's doing it is so cute I think I might explode.\n<<KatieSmile2>> \nShe comes to a sudden halt and pulls out half an orange and holds it out to me; her big eyes and smile touching my very soul.\nIt's safe to say I'm more than a little confused. At least to the point where it must be visible on my face.\n<<???>> <<KatieShockedNormal>> \nDon't feel bad about taking it, you asked for it and I don't really like them anyway.\n<<Kishimoto>>\nYes\n<<KatieFades>> <<NoOne>>\nI have no idea what she just said so I respond with that and take it.\nShe goes quiet again.\nThe peaceful sounds of birds chirping and the distant chattering of students are the only sounds present.\nOh wait no actually, if you listen close enough you can hear Fujinami shouting my name looking for me.\nHe seems to be getting further away.\n<<KatieAppear>> <<KatieSmile1>> <<???>> \nKatie Walsh!\n<<NoOne>>\nHuh?\nOh, that must be her name.\n“Whalsh”?\nThat's an Irish surname, isn't it?\nCould it be that she's really not American?\n<<Kishimoto>>\nHaruki Kishimoto.\n<<KatieFades>> <<NoOne>> \nI extend my hand to hers and she shakes it.\nWe sit in silence for the rest of lunch.\nI feel sorry for this girl.\n<<Courtyard>> \nWe both stand up when the first bell rings for fifth period.\n<<KatieAppear>> <<Kishimoto>>\nHey, um...\n<<NoOne>>\nI tap her on the shoulder to get her attention.\nI point at the area where we're standing, following that up with a sideways thumbs up gesture in an attempt to ask her if she wants to meet here again tomorrow.\n<<Katie>> <<KatieLuagh>>\nOh, uh-huh!\n<<NoOne>> <<KatieFades>> \nShe nods her head with great enthusiasm and walks off, though I'm not too sure whether she actually understood what I meant or not.\nAn understandable suspicion considering how vague my invitation was.\nI guess I'll just come here tomorrow and see what happens.\nI'd literally rather speak to a girl who can only speak English than ever speak to Fujinami again.\n<<Hallway2>>\nAs I walk down the hallway back to my classroom, I encounter my favorite person.\n<<FujinamiAppear>> <<FujiSmile2>> <<Fujinami>> \nYo, Kishimoto! I was looking all over for you but couldn't find where you were.\n<<Kishimoto>> \nGood, now I know to keep going there.\n<<Fujinami>> <<FujiLuagh>> \nAw come on man! You're my best friend! Which means I'm your best friend!\nWe gotta stick together man!\n<<NoOne>>\nIf it was like that, then everybody would be the most popular person on Earth.\nAlso I'm pretty sure the reason I'm your best friend is because I'm your only friend.\nI don't say that though and silently walk back off to class.\n<<Hallway1>>\nClasses end and I begin to make my great escape, but not before running into Fujinami again.\n<<FujinamiAppear>> <<Fujinami>> <<FujiSmile1>> \nReady to walk home?\n<<NoOne>> \nI'm not a part of any clubs, but I’m genuinely considering joining one so that I don't have to walk home everyday with this tool.\nBut knowing him, he'd probably just wait at the gates for me anyway.\n<<RoadsideSunset>> \nOur school really is situated in quite a beautiful location.\nIt feels a bit of a waste not to have our school be some fancy preparatory school or anything.\nBecause then even fools like Fujinami get to experience the luxury of going to a school like this.\n<<MusicStop>> <<FujinamiAppear>> <<FujiSmug>> <<Fujinami>> \nHey Kishimoto, guess what I did last night?\n<<Kishimoto>> <<Idiot>> \nWhat?\nActually wait, no, don't tell me.\nIt's probably going to be so awesome I'll die.\n<<Fujinami>> <<FujiLuagh>> \nWell at least this is going to be the final thing you hear then!\n<<NoOne>>\nIf the final thing I hear comes from Fujinami, I don't know what I'll do.\n<<Fujinami>> \nLast night I jerked off using toilet paper!\n<<FujiSmile2>> \nCool, right?\n<<Kishimoto>>\nAwesome, next try screaming as loud as you can until you permanently lose your voice.\n<<Fujinami>> <<FujiSmug>>\nHeh, do you think I'd stop at just losing my voice?\n<<NoOne>>\nJUST losing your voice?\n<<Kishimoto>>\nYes, actually. But I hope you prove me wrong and blow up your voice box instead.\n<<Fujinami>> <<FujiLuagh>>\nHa! I can even do better than that!\n<<Kishimoto>>\nNice, prove it when you get home, or run away as far as you can from me and do it then.\n<<Fujinami>> <<FujiSmile2>>\nWell, it's better to get started sooner than later!\nSee you tomorrow!\n<<FujiLuagh>>\nActually wait, no, I won't.\n<<Kishimoto>>\nBecause you'll blow up your voice box and end up in hospital? Nice! Follow your dreams and don't let anyone stop you!\n<<Fujinami>> \nYou bet your ass Kishimoto! See you when you come to check up on me in hospital!\n<<NoOne>> \nIf I'm feeling generous, I might even come to your funeral.\n<<Kishimoto>>\nSee ya!\n<<Fujinami>> <<FujiSmile2>> \nYep! Wish me luck!\n<<Kishimoto>>\nI will!\n<<FujinamiFades>> <<Fujinami>> \nAwesome! Bye!\n<<NoOne>>\nI don't respond.\nI figure it's best not to.\nI'd rather not have to keep saying goodbye to Fujinami.\n<<MusicStop>>\n...\nHe's gone now.\n<<Babel>>\nIt's just me.\nI think about that girl as I walk along the side of the road.\nI don't think about anything in particular.\nJust her.\nHer existence.\nHer place in the world.\nShe isn't normal because she's out of place.\nI wonder if she was considered “normal” in her old school.\nOr if she even wants to be normal.\nI think about that.\nI'm curious.\nI wonder what's out there.\nI know this sounds obvious but, we don't know the things we don't know.\nUs humans are arrogant.\nWe think we know everything.\nOnly to be surprised when our expectations are subverted.\nWe must look like morons to someone.\nSomething.\nSomething we don't know about.\nIn a place we don't know about.\n<<MusicStop>> \nI believe in that.\n<<Date>>\n<<BedroomMorning>> <<NoOne>>\nThe bright morning light spreads itself across my room.\n<<ManOnAMission>>\nAnother day at school, huh?\nI begin my morning routine.\n...\n<<BedroomMorning>>\nI usually have a pretty similar feeling as I'm doing this everyday.\nBut today feels different.\nI feel sort of... happy, almost?\nI don't know if that's the right way to put it.\nI doubt I really will see Katie again today anyways.\nI'd probably get the idea across that I wanted to meet there again today better if I had just spoken in complete gibberish.\nDespite my feelings towards my vague invitation from yesterday, I can't really remember what gesture I actually made.\nI'm criticizing something I can't remember.\n<<RoadsideMorning>> \nI remember it was bad.\nI just can't remember why it was bad.\nWell I can.\nI know it was vague and easily misunderstandable.\nI just can't remember the exact gesture I made.\nTherefore I couldn't say exactly why it's bad.\nI can't pinpoint each mistake and make a plan to improve upon them.\nI probably couldn't anyway, I'm not really that bothered.\nEither way, the only situation I would have to do that in is if she doesn't show up today.\nThough by that point it would already be too-late.\n<<SchoolGate>> \nI've become accustomed to seeing this sight every morning.\nIt's weird how one day I'll stop.\nI'll probably end up becoming accustomed to seeing the depressing, gray exterior of the office building I'll work at.\nI don't want that to happen.\nIt pains me to know my life is a waste.\nA waste of a lot of things, actually.\nI don't have a purpose.\nI just passively exist.\nNot contributing to anything or anyone.\nThat won't change.\n<<ClassroomDay>>\nHomeroom\nI feel this is the first time I've... felt something in this room.\nI don't know exactly what I'm feeling.\nExcitement?... Maybe?\nWhatever it is, I feel happy to feel something.\nWell I guess I'm happy now.\nThat's what I'm feeling.\nHappiness.\n<<ClassroomDay>>\nWhen English class comes around, I decide to try and listen more carefully than usual.\nI tell myself I don't know why.\nBut I think I really do.\nI feel guilty.\nI genuinely don't know why I feel that way.\nI mean, like I said, it's not my responsibility for some kid's happiness.\nBut I just can't stand seeing this poor girl alone.\nAbandoned.\nIt really does feel like my responsibility.\nI just feel the need to help her that much.\n<<Hallway2>>\nIt's lunch time again.\nLuckily our class let out early so I probably won't run into Fujinami.\nThe things he'd say if he found out I was going to the courtyard where nobody goes to sit under a tree and eat lunch with a girl...\nWell who am I kidding?\nI probably shouldn't get my hopes up.\nShe's more than likely not going to be there anyway.\n<<Courtyard>> <<MusicStop>> \nI was able to get here without running into Fujinami.\n<<MemoriesOfYou>>\nActually, I wonder if Fujinami is even in today?\nDid that moron actually do what I told him?\n...\nI don't know whether I should give out a sigh of pity or relief.\nA part of me does retain a genuine curiosity as to what happened to him.\nBut Katie's more important.\nIf she's even here that is.\nI look around and then...\n...there she is!\nSitting under the same tree she was yesterday.\n<<KatieAppear>> <<KatieShockedNormal>> <<Katie>> \n!\n<<Kishimoto>>\nYo!\n<<Katie>> <<KatieSmile2>>\nH-hey...\n<<Kishimoto>>\nEr... yes.\n<<NoOne>>\nYes is one of six words I know in English.\nI know I said I wasn't a bad student, and I'm not.\nThe only area where I'm doing concerning poor in is English.\nI'm awful.\nLike most other Japanese people, I have a pretty big fear of English.\nSo for me to talk to this girl like this is quite brave of me, actually.\n<<KatieFades>>\nI sit down in the same spot I did yesterday and I begin eating from my bento.\nI take a look at her lunchbox.\nIt seems as if she's only just started eating.\nI want to ask when she got here, though lack the capability to do so.\nSurely she didn't wait until... I came to eat her lunch?\n...\nI can't seem to deny the possibility.\n...\nYou know, I said I felt the need to help this girl.\nWhen I said that, I didn't really know what I meant.\nLike, how?\nI can't teach her Japanese.\nAnd the only way to salvage my English skills is if a magic genie appeared and I wished to be fluent in the language.\nBut I feel like just being here with her is enough.\nEven if we don't talk, hopefully she finds some comfort in eating with a peer.\nJust knowing there's someone who doesn't mind being with her.\nHopefully.\n...\nI'm quite enjoying this too.\nI like sitting here, eating away, listening to the sounds.\nIt's nice.\n...\n<<Kishimoto>>\nHuh?\n<<KatieAppear>> <<NoOne>>\nOut of the corner of my eye I spot Katie's extended arm.\nShe's holding out an orange; a big, happy smile present on her face.\nI have zero clue why she's offering me an orange, though I'll happily take a free orange.\n<<KatieFades>> \nI take the fruit off her hands.\nWhy did she do that?\nEither way, no matter what the motive was, I should probably thank her.\nI try to think back to what “thank you” is in English.\nI wouldn't say “thank you” is necessary within my impressively large vocabulary of six words, but it's a word I can remember if I put my mind to it.\n...\n<<KatieAppear>> <<KatieNormal>> <<Kishimoto>>\nHello.\n<<NoOne>>\nThere.\nI was pretty confident that meant “apple”, but after some thought, I'm pretty sure it's “thank you”.\n<<Katie>>\nUm, hi?...\n<<NoOne>>\nNo problem.\n<<KatieFades>>\n...\nIn the distance I can hear Fujinami calling my name again.\nI guess that means he's okay.\nUnfortunately.\nI wonder if he gave up or someone put a stop to him.\n...\nIt must be the latter.\nFujinami wouldn't be able to see the stupidity of his actions and correct himself like that.\nThis time I can't really tell if he's getting closer or further away.\nI feel a little anxious.\nIf Fujinami saw this sight, I don't think I would ever hear the end of it.\nDespite my instincts telling me to run away, I don't really know how I'd explain that to Katie.\nSo I stay where I am.\nEating away, listening to the birds chirping, the students chattering, and Fujinami's incessant, piss-off annoying screaming.\nIt's a wonderful image.\nThat is if you ignore Fujinami.\nBut I think that goes without saying.\nFor most things.\n<<Courtyard>>\nWe both stand up as the first bell rings.\nI give a friendly wave to her as I walk off.\nShe timidly waves back.\n<<Hallway1>> <<MusicStop>>\nIf I'm lucky I won't run into Fujinami here.\nWho knows? If my day is going really well, maybe somebody got fed up with his ceaseless yelling and beat him up so much that both his legs came off and he can never walk with me again.\n...\nNah\nI don't think I'm that lucky.\n<<FujinamiAppear>> <<FujiLuagh>> <<Idiot>> <<Fujinami>>\nYo! Kishimoto! Where were you? I wasn't able to find you yesterday either.\n<<NoOne>> \nYep\n<<Kishimoto>> \nI know that, that's partially why I went there.\n<<Fujinami>> <<FujiSmile2>>\nHa! Good one! But seriously, where were you?\n<<NoOne>>\nThat wasn't a joke.\n<<Kishimoto>>\nIn space. I flew up to the moon in a rocket ship and ate my lunch there.\n<<Fujinami>> <<FujiNormal>>\nAnd then you just came back down?\n<<Kishimoto>>\nExactly\n<<Fujinami>>\n...\n<<Kishimoto>>\nYou really don't believe me?\n<<Fujinami>> <<FujiAngry>>\nWho would ever believe that? What, do you think I'm some kind of idiot?\n<<NoOne>>\nYes. Yes I do.\n<<Kishimoto>>\nBut I thought we were best buds?\nWe gotta have faith in each- I mean me. You gotta have faith in me.\n<<NoOne>>\nI cannot believe I just said we were “best buds”.\nI suppose desperate times call for desperate measures.\n<<Fujinami>> <<FujiNormal>>\n...\n<<FujiAngry>>\nYou've won this time, Kishimoto... if that's even your real name.\n<<NoOne>>\nIt is.\n<<Kishimoto>>\nFaith! You can't be doubting me!\n<<Fujinami>>\nWell it's hard to believe the real Kishimoto saying we're “best buds”.\n<<NoOne>>\nWait, is that implying he'd known that I hate him all this time and just chose to annoy me?\n*sigh* I can't believe him...\n<<Fujinami>> <<FujiNormal>> \nWhat's wrong Tanaka-san?\n<<Kishimoto>>\nYou know me. And my name's not Tanaka, it's Kishimoto. You know that.\n<<Fujinami>> <<FujiShocked>> \nWait so... we really are best buds?\n<<Kishimoto>>\nNo, I was just saying that to get you to shut up.\n<<NoOne>>\nThough it inadvertently made him keep talking.\n<<Fujinami>> <<FujiSad>>\n...\nYou're awful.\n<<Kishimoto>>\nGreat! So does this mean you'll stop leaching onto me?\n<<Fujinami>> <<FujiNormal>>\n...\nWell...\n<<NoOne>>\nOh no\n<<Fujinami>> <<FujiSmile2>>\nSometimes friends have little arguments...\n...but that's just a part of friendship!\n<<NoOne>>\nYou have got to be kidding me.\n<<Kishimoto>>\n*sigh*\n<<Fujinami>> <<FujiNormal>>\nAnyway, seriously, where were you?\n<<NoOne>>\nHe's STILL going on about that?\n<<Kishimoto>>\nI was having a cute girl feed me while we sat under a tree. Then we made out.\n<<Fujinami>> <<FujiShocked>> <<ScreenShake>>\nREALLY???!?!?!?!?\n<<Kishimoto>>\nNo, dumbass.\n<<Fujinami>> <<FujiNormal>>\nBut I thought your parents always said: “Above anything, honesty is the most important thing in life.”\n<<Kishimoto>> \n...\n<<NoOne>> \nI...\n...I... I've been outsmarted by...\n...Fujinami...\n...\nIs there any point in still living?\n...\nI'm not sure.\n<<Fujinami>>\nHey, Kishimoto? What's with the whole depressed look?\n<<Kishimoto>>\n...\n<<Fujinami>>\nHey um... if the question was bothering you that much, you could've... just told me it was.\n<<NoOne>> \nIT WAS THAT SIMPLE?!?!?!\nWait, no...\nEven if I did “just tell him”, he still probably wouldn't have shut up.\n<<Fujinami>> <<FujiSmile1>>\nHey, after school do you want to go somewhere?\n<<Kishimoto>>\nYou really are worryingly carefree, you know that?\n<<Fujinami>> <<FujiLuagh>>\nWell, we better make the most of our youth and have some fun! Don't you think so?\n<<Kishimoto>>\nYes, 100% agree. That's why I'm going to ditch you and find someone else who'll talk to me.\n<<Fujinami>> <<FujiAngry>>\nDude, we're in second year. People have already formed their groups. It's too late.\n<<Kishimoto>>\nWell I think it says a lot about you that I'd go to so much trouble just to not have to talk to you.\nI mean, I personally thought that was obvious after I went to the moon to eat my lunch.\n<<Fujinami>>\nWell you didn't do that!\n<<NoOne>>\nIs that implying that it would've taken for me to fly to the moon to eat my lunch instead of eating with him for him to catch on to the fact that I hate him?\n<<Fujinami>> <<FujiLuagh>>\nAnyway, let's go somewhere after school!\n<<NoOne>>\nIt went from “Do you want to go somewhere after school?” to “Let's go somewhere after school!”.\nI guess I can't just say no outright here.\n<<Fujinami>> <<FujiSmile1>>\nWhere do you want to go?\n<<NoOne>> \nI was about to say “my house” until I realized that he doesn't have enough cop-on to understand that means “leave me alone” and would probably actually come to my house.\n<<Kishimoto>>\nLet's decide that when sixth period ends.\n<<NoOne>>\nHopefully he'll forget by then.\n<<Fujinami>> <<FujiLuagh>> \nYep! Whatever floats your boat!\n<<NoOne>>\nWhat floats my boat is being left alone.\n<<Fujinami>> \nSee ya!\n<<Kishimoto>> \nYep, bye.\n<<ClassroomEvening>> \n*sigh*\n<<NoOne>> \nSchool's out for the day.\nA lot of students hate school.\nPersonally, I quite like it.\nIt gives me something to do.\nIf it wasn't for school, I'd just be sitting around all day doing nothing.\nI don't really know what to do with myself when I'm at home.\nI wonder what I'll do today?\n...\nEh, guess I'll be mildly entertained by scrolling through social media-\n<<FujinamiAppear>> <<FujiLuagh>> <<Kishimoto>> <<ScreenShake>>\nAH!\n<<Fujinami>>\nYo! Wassap?\n<<FujiSmile2>>\nHave you decided where you wanna go?\n<<Kishimoto>> \nYeah, I actually decided that a long time ago.\n<<Fujinami>> <<FujiSmile1>>\nOh really? Where is it then?\n<<Kishimoto>>\nAnywhere. Specifically anywhere far away from you.\n<<Fujinami>> <<FujiLuagh>>\nYou crack me up like an egg Kishimoto!\n<<NoOne>>\nWhat about that made you think I was joking?\n<<Fujinami>> <<FujiSmile1>>\nWhy don't we head to the...\n<<FujiNormal>>\n...to the...\n<<Kishimoto>>\nThe arts building!\n<<Fujinami>> <<FujiShocked>>\nWha–\n<<ArtsBuilding>>\n<<NoOne>> \nFujinami and I come to the arts building; a clear look of confusion present on his face.\n<<FujinamiAppear>> <<Fujinami>> <<FujiEmbarrased>> \nWhy are we here?\n<<Kishimoto>>\nBecause you said you wanted to go somewhere after school?\n<<Fujinami>> <<FujiAngry>>\nYeah, somewhere fun!\n<<Kishimoto>>\nYou never specified that!\nEither way, this is great fun!\n<<Fujinami>> \n...\nAre you having fun?\n<<Kishimoto>>\nNope! Not at all!\nBut think about it, Fujinami! A cute girl who likes intelligent and artistic boys might see you here and fall in love with you!\n<<Fujinami>> <<FujiShocked>>\nReally?!\n<<Kishimoto>>\nYeah really! But you have to really show how much you love this place.\n<<Fujinami>>\nAnd how do I do that?\n<<Kishimoto>>\nStart by running really far away from me.\n<<Fujinami>> <<FujiAngry>>\nHuh? Why do I have to do that?\n<<Kishimoto>> \nBecause girls might not come to you if they see you're with a friend.\n<<Fujinami>> <<FujiSmile2>> \nHuh, good thinking Kishimoto! What's next?\n<<Kishimoto>>\nAs you’re running, take off your shirt.\n<<Fujinami>> <<FujiAngry>>\nHuh? W-why do I have to do THAT?\n<<Kishimoto>> \nSo they can all see your impeccable abs.\n<<Fujinami>> <<FujiLuagh>> \nOh yeah! That's so smart!\n<<Kishimoto>>\nThen, choose a spot and start screaming at the top of your lungs: “I LOVE THIS PLACE!!!!!!”.\n<<Fujinami>> <<FujiNormal>>\nMakes sense.\n<<Kishimoto>>\nThen, strip down to only your underwear.\n<<Fujinami>>\n...\n<<FujiAngry>>\nWhat?\n<<Kishimoto>>\nSex sells. Strip down and they'll be able to get a glimpse at what they might be able to get when they come over.\n<<Fujinami>> <<FujiLuagh>>\nKishimoto, you're a genius! A genius!\n<<Kishimoto>>\nTell me something I don't know.\nAnyway, you should probably get started right now. Or else you might forget the steps!\n<<Fujinami>> <<FujiSmile2>>\nY-yep!\n<<FujiLuagh>>\nOh my goodness! Think about all the girlfriends I'll have after this!\nI'll have an entire house made out of them!\n<<NoOne>>\nIs he going to... cut them up?\nThank goodness this plan isn't going to work.\nB-but just in case, I should probably suggest a better idea... y'know... just in case.\n<<Kishimoto>>\nH-how about instead you just get them to build you a house?\n<<Fujinami>> <<FujiSmile2>>\nAh yeah! That's a great idea!\n<<NoOne>>\nYou know, maybe telling him to make them his slaves wasn't the best idea.\nAt least if he cut them up they'd be put out of their misery.\n<<Fujinami>>\nI'll get them to build me a mansion! Wait, no, TWO mansions! No, THREE mansions!\nWhoo-hoo-hoo! I'm so excited!\n<<Kishimoto>>\nHm... I'm sure you are buddy.\n<<Fujinami>>\nDon't worry Kishimoto, I'll let you visit me in one of my three mansions anytime!\n<<FujiLuagh>>\nActually, I'll get them to build you a mansion as well!\nAnd a shrine to you!\nTo thank you for getting me to where I will be in the near future!\nThank you Kishimoto!\n<<NoOne>>\nHe's shaking my hand now.\nWait, are those tears starting to form in his eyes?\n<<Kishimoto>>\nUh, yeah. No problem.\n<<Fujinami>> <<FujiSmile2>>\nIt's a shame you just don't have my looks!\n<<FujiLuagh>> \nYou could've pulled this off yourself way sooner if you did!\n<<NoOne>>\nI don't think I would've.\n<<Kishimoto>>\nUh, y-yeah. Truly... saddening.\n<<Fujinami>>\nIt'll be fine! As I said! I'll make sure to share my girlfriends with you too!\n<<Kishimoto>>\n...\nI'm... uh... fine, thanks.\n<<Fujinami>> <<FujiNormal>>\nHuh? How come?\n<<Kishimoto>> \nJust ain't feel it's... the right path for me.\n<<Fujinami>> <<FujiLuagh>> \nWelp, you do you! I'm gonna go out and live my wildest dreams!\nSee ya!\n<<Kishimoto>>\nYep. G-good... luck?\n<<NoOne>>\nI try to put on a smile.\n<<FujinamiFades>>\nI certainly do smile, though I don't think it looks how I want it to look though.\nI can already see him throwing his shirt away.\nOh come on Fujinami... that's your school uniform!\n...\nUm...\nYou know...\n...maybe I shouldn't have done that.\nLike, he's going to be arrested if he actually strips down to his underwear...\n...and get in tons of trouble with the school...\n...and his parents.\nI'm a little concerned that the blame will be shifted onto me.\nLike, I'd really prefer not to get in trouble here.\nOr at all.\nEver.\nI'd like to have a clean reputation.\nWell I suppose I'd better just run away.\n<<RoadsideSunset>> <<MusicStop>>\nIn the distance I can hear police sirens around the general area of the arts building.\n<<MemoriesOfYou>>\nDon't tell me that Fujinami is actually being arrested.\nSeriously, what a dumbass.\nWell I suppose it's his own fault for going along with my plan.\nDoes he not know about public indecency laws?\nActually, regardless of if he is aware of such laws, surely he'd be able to come to the conclusion himself that being naked in public is at the very least not socially acceptable.\n...\nI stare out onto the horizon and the setting sun.\nThe sun emits such a vibrant, blinding orange.\nThis world really is beautiful.\nWell at least the part of the world I live in.\nI think that's the main reason I'm sticking around on this planet.\nI'd like to see more things.\nI'd like to know the unknown.\nI hope I can travel all over the world one day.\nI hope that I can see the most beautiful things that nobody else can.\n...\nPeople are a waste of time.\nI mean, if I were the only person on Earth, would I be considered “normal”?\nNo, I wouldn't.\nIt's a term humans invented.\nIf I was the only person on Earth, if I was somehow told I'm normal, I wouldn't care.\nBecause we've created all the systems that form a society.\nThe term “normal” is based around the systems of society that us, as humans have created.\nSystems that do nothing but make our lives more orderly,\nmore bland,\nand more bleak.\nI hate that.\nThe orderly fashion of our society forces us to behave in similar ways.\nWith all these people acting the exact same, it causes everyone to blend together.\nPeople end up lacking a sense of individuality and purpose.\nHumans are arrogant.\nHumans are orderly.\nHumans believe they have a purpose. A purpose that many try to find.\nThough our orderly society makes that needlessly difficult.\nA purpose isn't just given to you either; you really have to look for it.\nNow doesn't the fact that I'm speaking like this, questioning society, mean I'm not normal then?\nThat I do have a reason to be here?\nNo.\nI am without purpose.\nI don't know why I'm here.\nPeople are a waste of time for me; but so is everything else I suppose.\n...\nWait...\n...If I'm destined to work an unremarkable job and live an unremarkable life...\n...even if my life is bland...\n...maybe people could actually be my saving grace?\nMaybe I'll fall in love with someone...\n...someone who's destined for me...\n...someone who brings me joy...\n...and hope.\n...\nPeople are my only hope in finding purpose.\nBut I don't really like... people...\nSo I am unable to find purpose.\nFor me, humans are a waste of time.\n...\nI think.\nThere's a part of me that's doubting that all of a sudden.\nI don't know why.\nI don't know how.\nI mean, I've never really come across a friend or a lover that are like the ones of the protagonist in romance manga and such.\nThose kinds of people only exist in fiction right?...\n...\nFor me...\n...humans are a waste of time.\nBut for somebody without purpose, time does not matter.\nCan something that does not matter be wasted?\n...\nI think that's what I'm actually doubting.\nI'm not actually sure if time can't be wasted for me.\nMy gut tells me something else.\nBut that would imply I have a purpose, right?\nIs that what this feeling is trying to tell me?\nBut that doesn't make sense.\nI don't have a purpose, I'm sure of it.\n<<MusicStop>>\nI've come to accept that a long time ago.\n<<Date>>\n<<BedroomMorning>>\nI once again wake to the ever-so-familiar sight of the morning light shining into my room.\n...\n<<MemoriesOfYou>> \nWelp I better get ready.\n<<RoadsideMorning>>\nI like the sea.\nSpecifically the idea of being in the sea.\nBy myself.\nI've never been in the sea completely alone before.\nI mean, like completely, completely alone.\nAs in, nobody is at the beach at all.\nJust me.\nBy myself.\nDrifting in the water.\nThe blue sky above me.\nI really like that idea.\nIt would feel like I'm the only human on Earth.\nJust the way I want it.\nBut you know,\nI gave it some thought last night.\nI wasn't able to pinpoint what exactly my gut was trying to tell me the other day,\nbut I figured I might be able to get closer to the answer by thinking of stuff that could possibly provide purpose to someone like me, and then thinking more about those things and how they could directly provide purpose to me.\nThen I'll be able to prove for certain that I don't have a purpose and that feeling was just well... a feeling.\nWell I think we've already narrowed down that the only possible thing that could give me purpose is people.\nSo what exactly do I like about people?\nWell I think they're entertaining.\nPeople give me something to look at.\nAnd they can be funny too.\nAnd helpful.\nBut those aren't things that would make me want to stay with another person forever.\nThey're just something to look at.\nFor me, other people serve no purpose but to make things happen in my life.\nTo make it ever slightly more entertaining.\nSo there.\nI have no purpose.\nI hate people.\n...\nBut do I really?\nAm I just telling myself that?\n...\nI don't think I actually hate people.\nAs I said, other people add spice to my life, they fill up my days with moments and memories.\nIf there were no people, then I ACTUALLY wouldn't have a purpose.\nI don't have a purpose that fits into society.\nI do have a purpose.\nIt just must be outside of society.\n...\nAh, I think I'm just going on about random nonsense here.\nIf I don't have a purpose within our modern world, then that's basically just saying I don't have a purpose in life.\nMaybe something outside of life itself?\nI don't know.\nBut I couldn't have just been put onto this planet for no reason.\nThat would just be a waste of life.\n<<MusicStop>>\nUgh, this is stressing me out.\nThere's no point in thinking about this now when I already realized that I'm without purpose years ago.\nMight as well just crack on with my day.\nI guess I should make the most of what little I have in life.\n<<SchoolGate>> <<Ain'tHappening>>\nAs I stand in front of the school gate, the thought crosses my mind:\n“Will Fujinami be in today?”\nI stress over it a little.\nNever once in my life have I ever actually wanted to see Fujinami but now.\nI don't want to see him for well... him.\nI just want to see him at school because then I'll know that he didn't get in trouble.\nAnd if he didn't get in trouble, then I'm not getting in trouble either.\nEven if he did get in trouble, I probably wouldn't either, but something tells me that assumption is a bit wrong for whatever reason.\nWell not for “whatever reason”.\nI'm afraid I'll get in trouble for telling him to go along with the plan.\nI mean, it's entirely his fault for going along with it but, who knows?\nMaybe the police will like, think I deserve punishment or something?\nI mean I doubt it but still, I just have this sinking feeling that something might go wrong.\nI'd just like to see him to confirm he didn't get in trouble.\nCause as I said: if he didn't get in trouble, I definitely won't.\n<<ClassroomDay>>\nOkay, now I'm a little worried.\nI didn't see Fujinami in the halls at all today.\nAnd he hasn't barged into my homeroom class like he usually does.\nThat can only mean one of two things: either he's suddenly changed and decided to stop being my friend, or he got arrested.\nConsidering the former is impossible...\n...\nI don't want to admit it to myself.\n...\nUm, okay, I'll just relax and if the police talk to me, well that's that.\nI didn't actually do it in the first place so it's highly unlikely it will come to that.\nBut just in case, even if it does, I'm only a teenager, so nothing bad will really happen to me.\n...\nEven despite the facts, I still feel stressed.\n<<ClassroomDay>>\nOkay, I made it past first period, onto the second.\nIt's Japanese, and even though I should probably make the effort to listen, I'm too stressed to comprehend the magical spells flowing into my ears.\nSeriously, who came up with the idea of kanji?!\n<<ClassroomDay>> \nIt's lunch time now.\nOnly two more periods.\nIf I've made it this far, I probably won't get approached by anyone.\n...\nProbably...\n...\n...hopefully...\nI sit up from my seat, bento in hand-\nYou have got to be kidding me.\nI was so worried about this whole Fujinami streaking situation and everything else this morning that I forgot to make a bento!\n...\nUm well, the main reason I make myself bentos is so I can sneak off and eat without Fujinami.\nBut considering Fujinami isn't here today, it's probably okay for me to go out into the cafeteria.\n...\nSomething feels off about that idea...\nI briefly ponder what that may be.\nAnd then it hits me.\nWhat if there's undercover police pretending to be students in the cafeteria, waiting to arrest me?!\nYou know, maybe I'll just stay here and not eat.\nYeah, yeah no, that seems like a good plan.\nI'll do that.\nI proceed to sit back down in my chair.\n...\n...\n...\nWAIT!\nIf I just stay in one location they'll probably come looking for me!\nActually, they've probably already started!\nAnd I mean, surely they know what class I'm in and all. They're the police!\nOh yeah, and if Katie's waiting for me in the courtyard, I should probably go.\nOkay, I'll need to be ultra sneekey with this.\nOperation sneak into the cafeteria and get something to eat is a-go.\n<<Hallway2>>\nI cautiously step out into the hallway, making sure nobody takes any notice of me.\nBut by acting like some thief sneaking around the vents of a bank, I inadvertently draw more attention to myself and people start laughing.\nOh no, the police have almost certainly been alerted of my position.\nI sprint down the hallway as fast as I can and into the cafeteria.\n<<Hallway2>>\nOkay, I managed to get in and out of the cafeteria without anyone noticing me.\nThe strategy I'm using is one I like to call: “act so non-chantly and ignorant that the police think they mistook you for the person they're actually trying to catch, when you actually ARE said person.”\nYou see, if a criminal knows the police are onto them, they're probably going to be stressed.\nBut a normal person who's never done anything wrong in their entire life obviously wouldn't feel stressed.\nGranted, I'm not too sure if you could say I actually stuck to the plan, considering I was shaking while ordering my food, and was so scared I couldn't even talk and just had to point to the anpan.\nBut eh, the past is in the past, and you can't fix your previous mistakes, only learn from them.\nNow all I need to do is get to the courtyard.\nThere's many ways I could go about doing this, though I don't have time to sit around here and ponder out in the open and risk getting caught.\nSo I rapidly file my options down to two choices:\nEither the “act so non-chantly and ignorant that the police think they mistook you for the person they're actually trying to catch, when you actually ARE said person”\nOr the “run so fast that all that people can see is a blur that somewhat resembles a person”.\nIn the heat of the moment I choose the latter.\nI absolutely sprint down the hallway, so fast I don't even know what's going on anymore.\nI actually don't even know where I'm going.\nGranted, this is probably because I'm running with my eyes closed, so-\n<<ScreenShake>> \n*BAM*\nI run straight into a wall.\nThough I have no time to lose! I swiftly get back up to my feet and continue running; this time with my eyes actually open.\n<<Courtyard>>\nPhew, I'm in the courtyard.\nIf the police come now, I'll just tell them it's Katie they're looking for.\nKatie won't even know what's going on.\nAnd if they ask her an important question while interrogating her, she won't respond and it'll look as if she's speechless!\nAND she can't tell them I'm the culprit because she can't speak Japanese!\nAND I won't feel that bad because I've known this girl for two days!\nIt's truly the best possible scenario.\nI look around and see Katie sitting down at the tree we usually eat under.\nI give a warm wave as I walk over to her and sit down.\nHer lunch box hasn't even been opened yet, and there's no way she just got here.\nI guess that means she really is waiting for me then.\nWell at least that tells me I'm not being a bother to her and she actually likes me.\nWe begin to eat.\n...\nShe's nibbling away cutely at her lunch.\nThis coupled with the fact she had actually waited for me to come despite my tardiness makes me feel a little bad having to sell her out to the cops.\n...\n*sigh*\nI guess I won't get in much trouble because I'm a teenager.\nAnd I'm not even the one who went through with the plan.\nFujinami is probably only not in school because he's getting some boring lecture from the police and his parents about how despite what he may think, you actually CAN'T be naked in public.\nAnd he's either going: “WHAT!?!?!?!?!?!” or just silently nodding pretending as if he's actually listening.\n<<MusicStop>>\nYeah, that sounds about right.\n...\n<<MemoriesOfYou>>\nI don't really feel that stressed in this atmosphere.\nSitting here with Katie, listening to the sounds.\nIt's all very peaceful.\nI know I keep saying this but, I like it.\n...\nY'know, maybe I just like people when they can't talk.\nI try to think of a world where Fujinami can't talk.\n...\n...\n...\nWhile it's marginally less annoying, it's still pretty bothering having him swarm me like a fly.\nIt's a little creepy actually.\nJust having him standing there, staring blankly at me, saying nothing.\n...\nI'd still take that over the current Fujinami.\nI think that says a lot about him.\nOr me.\nI'm not sure.\nActually, no, I am sure.\nIt's definitely him.\nDefinitely\n<<Kishimoto>>\nHuh?\n<<KatieAppear>> <<KatieSmile2>> <<NoOne>> \nKatie is once again offering me an orange, her happy facing staring directly at me.\nWhat is with this girl and oranges?\n<<KatieFades>>\nNo matter her reason, she's offering me free food, so I take it off her anyway.\nNow that I think about it, whenever I come here to eat with Katie, the only person I ever talk to is myself.\nI should probably make a bit more of an effort with her.\nBut how?\nWhat do I say?\nI try to think.\n...\n...\n...\nWait, okay.\nI know this might be stupid but it's certainly an idea.\nThough I suppose I don't have to describe an idea as “certainly an idea”.\nI'm pretty sure that's obvious enough as it is.\nAnyway, I think we should play tag.\n...\nThat is actually a really stupid idea.\nI look down at Katie's lunchbox, only to see it empty and her staring into the distance.\nI pull out my phone and search up the word “tag” in English.\n...\n<<Kishimoto>> \nTag!\n<<KatieAppear>> <<KatieShockedNormal>> <<NoOne>> \nI touch her shoulder and run off.\nI stop behind a corner and peek out slightly just to make sure she understood.\n<<KatieSmile1>>\nIt takes her a sec, but she catches on eventually and starts chasing after me.\nA smile appears on her face.\nA new sight for me.\n<<Hallway1>>\nLaughter fills the hallways we race down as Katie tries to catch me.\nMany times while turning corners she almost does actually.\nAs we run we come to a “T junction” hallway, though on the wall in front of us there actually are two hallways.\nBoth hallways are separated about two meters apart from each other.\nThey're probably the most pointless aspect to this entire school, as they both lead to the exact same place.\nI choose the left, under the belief that Katie would too as she doesn't know the building that well.\nWell apparently she does because I come to the end of the hallway and she slides in front of me from the right and catches me.\nI can't decide if she was being smart, or I was being dumb.\nProbably a mixture of both.\nIt's now my turn to catch her.\nI decide to give her a five second head-start.\nBecause as we all know, I'm probably the fastest, most handsome guy on planet Earth.\nWell, the fastest, most handsome guy on planet Earth that's friends with Fujinami.\nBleh, I hate saying that.\nThat I'm friends with Fujinami.\nBut I suppose there's no denying the facts.\nThey're laid out as clearly as... a urine sample from someone who drinks too much water?\nAnyway, after the five seconds I gave her are up I sprint down the hallway.\n<<KatieAppear>> <<KatieSmile2>>  \nI come to a corner and turn to my left, only to find Katie standing right there.\nHer face tells me she was waiting here.\nI catch her and she lets out a cute little laugh.\nI can't help but smile as she does.\nAnd I eventually break into laughter too.\nIt's an odd sight, both of us standing there in the hallway, seemingly laughing at nothing.\nA feeling of pure bliss washes over me, as if I'm a small child.\nIt's the exact same feeling I get as someone so young.\nSomeone who doesn't know anything about the world, and is oblivious to the shitshow they've just been casted in.\nWhen you have no clue that anything bad exists, the only thing you can do is be happy.\nHow wonderful.\nI wish I could be like that again.\nAnd in the near future I'll wish I could be like this.\nHappy.\nI'm too caught up within the moment to think of how this happiness is temporary.\nIt feels like it'll last forever.\nThat's what I want.\nAs I continue to laugh along with Katie, garnering a few looks from passing students, I can't help but think how I'm not usually happy. Ever.\nAnd this girl somehow makes me.\nWell, is making me.\nIt's not enough to change my stance on people, but maybe it'd be for the better if I hung around her a little more.\nAgain, maybe I just like her because she can't talk.\nBut even so... there's just something about her that I don't feel with anyone else.\nA feeling so strong... it's making me question a few things about people.\nCan I consider her a friend now?\nDoes she consider me a friend?\nI'm not sure.\nI lack the ability to ask her.\nI am very curious as to what goes on inside this girl's head.\nI want to know.\nI can't just teach her Japanese; especially considering I can't speak English.\n...\nMaybe I'll study some English tonight.\nI know Rome wasn't built in a day.\nBut it wouldn't have been built at all if they didn't place that first brick down.\nIf they didn't take the first step.\nYou need to take that first step.\nAnd after you've done that, you'll find yourself progressing towards your goal a little more each day.\nAnd before you know it, you're finished. You're done.\nSo I might as well try myself, try taking that first step towards my goal.\nIf anyone else can learn English, so can I.\nI just need to work hard.\nIt's not like I have anything better to be doing either.\nSo I might as well fill up my life with something interesting and productive.\nI think anything is better than just bumming around, scrolling through social media.\nI stare deep into her big eyes, a smile still situated upon my face.\nA friend; I'm pretty sure I've made a friend.\n...\n<<RoadsideSunset>>\nI didn't really think I'd do that this week.\nMake a friend.\nThere's a lot of things I've done that I didn't think I'd do this week.\nIt's been a pretty crazy week for me, hasn't it?\nNot to mention it's only Wednesday.\nWhat next?\nI'll discover some secret eighth day of the week or something?\nI chuckle a little at my own comment.\nAnd if I do...\n...will she be there with me?\n...\nHuh?\nWhat the hell am I saying?\nI don't know what I'm making it sound like, but it's not sounding like the truth.\nI think.\nWhat am I going on about?\nI seriously don't know what I just said.\nWell I do, actually.\nIt was just some offhand comment I made to myself that I suppose, if said aloud, someone could easily mistake for me implying I like her or something.\nI did say it quite romantically to be fair.\nWell, thought it quite romantically.\nBut why did I try to clear up a misunderstanding that nobody had?\nThat was weird.\nBut I guess I'm weird.\nI'm so normal that I'm weird.\nMy existence is weird.\nI exist just to exist.\nI serve no purpose.\nIsn't that weird?\nThat somebody was born into this world without a purpose?\n...\n...\n...\nFor some reason, something is again telling me I actually do have a purpose.\nAnd for some reason I'm trying to deny it.\nI suppose I've become accustomed to the reality I may very well have created for myself.\nIf I do have purpose, as I said, it's not one that fits into society.\nIt's not one that mankind has created.\nBut again, doesn't that just mean I have no purpose in life? In our modern world?\n...\nI think humans are a waste of time for me because I'm different.\nBecause I don't fit into society.\nWell, don't want to fit into society.\nIn the eyes of mankind, I am deemed “normal” and due to that I am deemed without purpose within society.\nAnd I suppose if you have no purpose in society, you have no purpose at all.\nBut my purpose is beyond society.\nI know it sounds corny, but I...\n...\nHm...\nI don't know if I really do believe it.\nNot that I don't fit into society.\nI believe that.\nWhat I'm stuck on is whether I really do have a purpose.\nFor the longest time I believed I didn't but, after today, something tells me that I might.\nA purpose beyond human huh?\nWhat could that be?\n...\nMaybe I do have a purpose.\nI'll just never find it within my lifetime.\nTherefore, my fate stays the same.\nNothing changes.\nNothing really changes in the grand scheme of things.\nBut I don't think that should matter.\nWe should be ignorant.\nIgnorance is bliss.\n...\nThe world I live in...\n...it truly is beautiful, isn't it?\nI can't help but break out a smile looking at this view.\n<<Kishimoto>>\nHeh...\n<<BedroomEvening>>\nWait...\nThank you means thank you?\nHello means hello?\nAnd orange means... orange?\n...\nSo that's why she's been giving me oranges.\n...\n<<NoOne>>\nI'm truly an idiot.\nBut I can't help but break out a smile.\n<<BedroomEvening>> <<MusicStop>>\nAfter a while of studying, I turn off my laptop and lay down on my bed.\nI think about my day as I blankly stare at the ceiling.\n...\nI smile as I do.\nI had a good day; I really did.\n<<Date>> <<BedroomMorning>> \nI wake to the sight of my room once again.\n<<ManOnAMission>> \nI waste no time in getting up and starting my morning routine.\nI don’t usually do this, most days I sit in bed for as long as I can before I can’t get away with it any longer and my mom comes in.\nBut I think since I had such a good day yesterday, I woke up feeling good today.\nThat’s nice.\nIf I have yet another good day then I’ll also wake up feeling good tomorrow.\n<<BedroomMorning>>\nI’ve finished my morning routine, though I have a lot of time to spare.\nI might as well make good use of my time and study some English.\nI decide it’ll probably be beneficial if I learn some greetings.\nI’ll be able to find out how she’s feeling today.\nThe fact that I’ll be able to extract information on her current mood at all is something I think I’ll be proud of.\nSo I do that.\n<<BedroomMorning>>\nAs I continue to study, I hear my mom wake up and turn the TV on.\nShe works night shifts at a prison, and despite her being extremely tired, she still wakes up in the mornings.\nThough by the time I’m off to school she’s usually asleep again.\nI listen to the news playing in the background as I work.\nMost of the stories are the usual garbage.\nStuff about celebrity affairs and stuff.\n<<MusicStop>>\nBut one story does manage to get my attention.\n<<Babel>> <<TV>>\nOur next story is a rather concerning one for the people of Japan.\nScientists have predicted an incoming, nation-wide tsunami that, if their predictions are true, could be the largest and most devastating natural disaster in history.\nStrangely enough, scientists have been unable to find the cause of this tsunami and have stated that they are only going off what their equipment has told them.\nDue to this, they have stated that it is almost definitely a malfunction within their systems and that nobody should stress over this.\n<<MusicStop>> <<NoOne>>\nPhew, they honestly almost had me there.\n<<RoadsideMorning>> <<BrightDays>> \nThe scene of the cliffs looking out onto the ever so expansive ocean is elevated by my good mood.\nThis is the first time in many years I’ve actually felt happy walking down this road.\nI used to feel at the very least, relatively happy walking down this road everyday.\nBut then one day in middle school I realized my fate.\nFrom that day on, I couldn’t be happy walking down this road.\nBut right now, I don’t care about my fate or the future.\nWhat I’m feeling so happy about has nothing to do with such things.\nI’m happy because of Katie.\nI don’t think that one time is enough to say that she “makes me happy”.\nBut it sure is enough to say that I enjoy her company.\n…\nWait…\n…those are just the same things, aren’t they?\n<<SchoolGate>>\nI’m standing outside the gates.\nI haven’t ever felt so good walking into this school before.\nAnd this is the first time I’ll be walking in with a smile on my face.\nAs I take another step towards the school gate, I notice something.\n<<KatieAppear>> <<KatieSmile1>>\nIt’s her; she’s waiting for me.\nMy smile’s too big for my face.\n<<Kishimoto>> \nHello!\n<<NoOne>> <<KatieShockedNormal>>\nKatie looks up at me in surprise when I say that to her in English, but she responds momentarily.\n<<Katie>> <<KatieSmile2>>\nOh… uh, hello!\n<<KatieFades>> <<NoOne>>\nI stare up to the deep blue sky as I stand next to her.\nClouds are dotted across the vast plane.\nI smile.\n“Today’s going to be a good day” I think to myself.\nI turn to Katie and nod my head back towards the school building.\nIt takes her a second to realize what I mean, but she eventually catches on and runs up beside me.\nWe walk into school together.\nTwo friends walking into school together.\n...\nThis feels really nice.\nI really like her company.\n“If just being around her makes me feel this happy, maybe I should be around her all the time!” I jokingly think to myself.\n...\n“Jokingly”, huh?\n...\nI’m a little confused.\n<<ClassroomDay>>\nIt’s English class now.\nI realize that my studying is also probably going to help me academically as well.\nWhen the teacher starts talking, I can actually understand a few things he’s saying.\nA few.\nOn the occasion he says a word I know, a feeling of pride washes over me.\nMost of the stuff he’s saying still sounds like gibberish though.\nWell at least I can already see some progress.\nActually, maybe it’s even a little more than just “some” progress, as I suppose you could say that going from not understanding a word in English class to understanding a few is a pretty big step up.\n<<ClassroomDay>>\nIt’s lunch time.\nI feel somewhat excited to eat lunch with Katie again.\nI stand up from my chair and grab my bento-\n<<MusicStop>>\n...\nYou have got to be kidding me.\n<<Idiot>>\nI was so caught up in studying this morning that I forgot to make a bento.\nEh, well it’s not too much of a hassle going to the cafeteria to get food.\nFujinami didn’t come up to me in the hallways or invade my homeroom class this morning so he’s probably not in today-\n<<Fujinami>> <<FujiSmile2>> <<FujinamiAppear>>\nYo Kishimoto! Whassup?\n<<Kishimoto>>\n...\n<<NoOne>>\nJust when I’m having one of the best days of my life, this has to happen.\nOf course.\n...\n<<Kishimoto>>\nHey, didn’t you get arrested or something? What happened? How are you not suspended?\n<<Fujinami>> <<FujiSmile1>>\nOh yeah, I got chewed out by the cops and my parents yesterday, and I think they said that they told the school and that the principal will decide my punishment.\n<<FujiSmile2>>\nBut he’ll probably forget all about it.\n<<NoOne>>\nI doubt he will.\n<<Kishimoto>>\nHey um… that’s cool and all but… you didn’t say anything about me… did you?\n<<Fujinami>> <<FujiNormal>>\nHuh? Why would I say anything about you?\n<<NoOne>>\nThis guy’s IQ is in the minuses.\n<<Fujinami>> \nHuh? Why are you looking at me like that?\nWait…\n<<FujiAngry>>\n…you got me dragged into this whole thing! How did I forget?!\n Okay, Kishimoto, we NEED to have a talk about this.\n<<Kishimoto>>\n*sigh*\nBut didn't you even say the plan was perfect?\nDon’t you think you could’ve just done something wrong on your part?\n<<NoOne>>\nIf this dude actually goes along with this, he is the biggest idiot I think I’ve ever come across.\nBut honestly, this is so stupid, I doubt that even the likes of Fujinami will fall for it.\nIt was just the first thing that came into my head.\nI just kind of impulsively said it without a second thought.\n<<Fujinami>> <<FujiNormal>>\nHuh, I… yeah…\n<<NoOne>>\n...\nWhat should I even be feeling right now?\nI really don’t know if I should be happy because that worked, or shocked at this dude’s intelligence.\nI really don’t know.\n<<Fujinami>> <<FujiSad>> <<ScreenShake>>\nDude, I’m so sorry for doubting you!\n<<NoOne>> \nHe’s on his knees.\n<<Kishimoto>>\nUm… yeah, no… that’s… what I thought?\n<<Fujinami>> <<ScreenShake>>\nPlease forgive me! I’m begging you! Please still let me be your friend!\n<<NoOne>>\nHe’s crying incessantly now.\n<<MusicStop>> <<Kishimoto>> \n*sigh*\n<<NoOne>>\nAgain, just when I’m having one of the best days of my life, this has to happen.\n<<TheWay>> \nOf course.\n...\nWait no!\nI can’t give up this easily!\nI can’t let my day be ruined by this!\nI must continue!\nThis WILL be one of the best days of my life and I WILL eat lunch with Katie!\nAfter my motivating speech I just gave to myself I feel fired up!\nThat is until I snap back to reality and see Fujinami on the floor apologizing while crying profusely.\n<<Kishimoto>> \n*sigh*\n<<NoOne>>\nAll my motivation is gone and I just decide to do what’s easiest and tell him the truth.\n<<Kishimoto>>\nUm, here, look dude. I promised someone I would eat with them today, so I can’t really be dealing with this right now.\n<<Fujinami>> <<FujiNormal>> \nOh? Wait, huh?\n<<NoOne>>\nUpon hearing my statement he stops crying.\nI don’t have the energy nor the will to be making some kind of snappy, smart comment at him, nor do I have the will to come up with a half-decent plan to get him to stop acting like this.\nSo thankfully this seems to be working. Even if it’s half-assed and still annoying for me, at least he’s not on his hands and knees doing whatever the hell he was a second ago.\n<<Fujinami>> <<FujiShocked>>\nWho? I thought I was your only friend.\n<<NoOne>>\nThank goodness that’s no longer the case.\n<<Kishimoto>>\nRemember when I said that I was going to dump you and find someone else to be my friend?\n<<Fujinami>> <<ScreenShake>>\nYOU ACTUALLY DID IT?!!?\n<<Kishimoto>>\nWell where do you think I’ve been off to this whole time?\n<<Fujinami>> <<FujiSad>>\nThe moon?...\n<<Kishimoto>> \n...\nAre you actually that stupid?\n<<Fujinami>> <<FujiNormal>>\n...\n<<FujiSmile2>> \nOf course not!\n<<Kishimoto>>\n...\nJust eat lunch with us.\n<<Fujinami>> <<FujiShocked>>\nHuh?\n<<Kishimoto>>\nMy friend and I. Come eat with us.\n<<Fujinami>>\nWait, really?\n<<Kishimoto>> \nYeah, just this once though. Now hurry up.\n<<Fujinami>>\nO-oh yep! Coming!\n<<NoOne>> \n*sigh* I can’t believe this.\nThough at least I still get to be with Katie I suppose.\nBetter than nothing…\n<<Hallway1>>\nAs we walk down to the cafeteria, I type: “This is my friend Fujinami, he will be eating with us today” into Google Translate and translate it into English.\nI try to memorize the phrase as we walk down the hallway.\nI quietly repeat the sentence under my breath as we continue to pace down the halls.\nDue to me not knowing half the words contained within the sentence, I forget what I’m even saying to myself.\n<<Courtyard>>\nWe’ve come to the courtyard.\nLuckily I’ve managed to keep the phrase in my head, even while purchasing my food.\n<<Fujinami>>\nHuh, so this is where you guys meet?\n<<Kishimoto>>\nYep, everyday.\n<<Fujinami>>\nI never even knew it existed. How do you get here again?\n<<Kishimoto>>\nThat’s for me to know and you not to find out.\n<<Fujinami>> \nAw come on man, just tell me!\n<<Kishimoto>> \nThis is a one-time thing, remember?\nI don’t want you coming to this spot whenever you please.\n<<Fujinami>>\nMan, you suck…\n<<Kishimoto>>\nDo you want to eat here or not?\n<<NoOne>>\nI say this all the while scanning the area for Katie.\n<<Kishimoto>> \nAh, there she is! Come on, don’t just stand there. You’re eating with US, remember?\n<<Fujinami>>\nYep! Coming! Wait did you say she?-\n<<NoOne>>\nWe approach Katie.\n<<KatieAppear>> <<KatieSmile1>> <<Kishimoto>>\nHello! This is my friend Fujinami, he will be eating with us today.\n<<KatieSmile2>> <<Katie>> \nOh, okay!\n<<KatieFades>> <<NoOne>>\nI’m pretty sure I pulled it off perfectly.\nI sit down in my usual spot, and stare at the still-standing, dumbfounded Fujinami, whose in utter dismay at what I can only assume is Katie’s appearance.\n<<Kishimoto>>\nWhat? Sit down already?\n<<NoOne>>\nI make sure I say that really non-chantly, to rub in the fact that I hang out with this girl daily.\n<<Fujinami>> <<FujinamiAppear>> <<FujiEmbarrased>>\nY-yep!\n<<FujinamiFades>> <<NoOne>>\nFujinami timidly sits down next to me and we all begin to eat.\n<<FujinamiAppear>> <<Fujinami>> <<FujiAngry>>\nHey, what the hell!? You’re friends with Katie?! THE Katie?!\n<<Kishimoto>>\nWhy are you whispering? She doesn’t speak Japanese.\nEither way, so what? I seem to be the only person left at this school who actually still cares about her.\n<<Fujinami>>\nDude, can you not see her? She’s so hot!\n<<Kishimoto>>\nHuh? Oh yeah, I guess she’s cute.\n<<NoOne>>\nI actually do think she’s hot. But I don’t just say that, due to me wanting to act like hanging around cute girls is just a normal thing for me to do (which I suppose it is), which probably annoys him.\n<<Fujinami>> <<ScreenShake>>\nYou GUESS? Look at her man!\nAnd look how close you’re sitting to her!\n<<NoOne>> <<FujinamiFades>>\nThen she does the perfect thing.\n<<Katie>> <<KatieAppear>> <<KatieSmile2>> \nHere you go!\n<<NoOne>> \nShe talks in a soft, high-pitched voice as she hands me an orange.\n<<Kishimoto>>\nThanks.\n<<KatieFades>> <<FujinamiAppear>> <<FujiShocked>> <<ScreenShake>> <<Fujinami>> \nWWWWWWWHHHHHHHHHHAAAAAAAAATTTTTTTTTTTT!?!?!?!?!?!?!?!?!?!?!?!?\n<<NoOne>>\nThat reaction’s over-the-top even for Fujinami.\n<<Kishimoto>>\nHm? What’s wrong?\n<<NoOne>> \nI say that as I eat the orange.\nFujinami’s face twitches a little and then…\n<<FujinamiFades>> <<Fujinami>> <<ScreenShake>> \nI CAN’T TAKE THIS ANYMOOOOOOOOOOORRRRRREEEEEEEEEE!!!!!!!!!!\n<<NoOne>>\nHe runs off.\n<<Katie>> <<KatieAppear>> <<KatieNormal>> \nHm?\n<<NoOne>>\nShe tilts her head slightly.\n<<Kishimoto>>\nEr, nevermind.\n<<NoOne>>\nI say that in Japanese, though I wave both my hands in front of my face as I do, which sends the same message.\n<<Katie>> <<KatieSmile1>>\nOh, okay.\n<<KatieFades>> <<NoOne>>\nKatie nods and goes back to eating.\nWith Fujinami gone like that, I look up to the sky once again and smile.\nI sit idle for a few moments, until I hear Katie give out a large yawn, followed by sudden pressure on my shoulder.\nI turn to my left and see…\n…Katie sleeping on my shoulder.\n…\nI know this makes us look like a couple and people might get the wrong idea or whatever.\nBut I like this.\nI like this a lot.\n...\nPoor girl.\nShe must be so tired.\nI wonder why?\n<<Courtyard>>\nThe bell rings, waking the sleeping Katie.\nShe rubs her half-opened eyes with both her hands and stares at me.\n<<KatieAppear>> <<KatieShockedBlush>> \nAnd then she realizes what happened.\nShe starts apologizing profusely.\n“Sorry” actually is within my impressively large English vocabulary of six words.\nI just smile contently at her.\n<<KatieBlush>>\nShe seems to get the idea that I don’t mind and calms down.\nShe’s still blushing though.\nShe sits in idle briefly, seemingly thinking of something.\nShe then stands up and takes my hand.\n<<KatieFades>>\nShe pulls me up from the ground and begins to walk; her hand still intertwined with mine.\nAre we a couple?\nDoes she like me?\nNevertheless, I walk beside her.\nI don’t think we’re a couple.\n...\nWe continue to walk, our hands linked.\nIs this… is this what it would be like to date her?\nIs this a glimpse into what could be?\n...\nIf so, I…\n<<MusicStop>> \n...\n…I like that future.\n<<LovelyHorizon>> \nI like it a lot.\n<<KatieAppear>> \nSeemingly out of nowhere, Katie comes to a sudden halt, and lets go of my hand.\nHer face is bright red and she’s clearly embarrassed.\nShe doesn’t apologize though.\nAnd I put on a warm smile.\nWe stare at each other, lost in one another's eyes.\nWe do that for a while.\nEven when the second bell goes we’re still staring at each other.\n<<RoadsideSunset>>\nAs I walk down the road, I think back on my day.\nI’m not too sure how I felt about it.\nI definitely learned something about myself.\nSomething important.\nI’m not too sure what though.\nThe only detail I am able to pin point is that whatever the thing is that I can’t put my finger on, is exceedingly clear to somebody else.\n...\nI think I really do know what it is.\nI’m just too scared to admit it.\nIt’s not like anything inherently bad will happen the second I do.\nIt’s just… I don’t know what will happen.\nSomething will, eventually.\nSomething big. Something will change.\nBut I don’t want anything to change.\n...\nThough maybe change is good.\nI mean, ever since I met Katie, a whole lot has changed.\nAnd I think it’s for the better.\n...\nYeah.\nIt is.\n<<BedroomEvening>>\nDespite my fatigue, I still manage to study for about an hour.\nI contemplate what to study, until I decide that grammar is probably actually the most important thing to study.\nYou see, once I learn the rules of English, I can just apply those rules to almost any word and it’ll help me spell and learn…\nI’m not making much sense here, am I?\nMy point is, it’ll make it easier to learn English in the long run.\n<<BedroomEvening>>\nI lay down on my bed.\n...\nToday felt like it passed by in an instant.\nIt’s hard to describe every event that occurred today.\nIt all just went by me too fast.\n...\n<<MusicStop>>\nI want it to slow down.\n<<Date>>\nAnother day comes.\n...\n<<Babel>>\nI feel a little scared.\n...\nDo I?\nNo, I’m pretty sure I feel confused.\n...\nI think I’m confused AND scared.\nYeah, that seems to be it.\n<<BedroomMorning>>\n“But why?”\nThat’s the question I ask myself as I perform my morning routine.\nUnlike usual, I think I actually can answer both those questions.\nI think I’m confused on where I stand with Katie, and I think I’m scared because of how fast yesterday passed.\nThe second one may seem a little a silly to most people, but not to me.\nI’m a pretty slow thinker.\nI need time to think over my next move.\nThis hasn’t really ever been a problem for me though; until now that is.\nFor most of my life, nothing’s really changed, and coupled with the fact that most of my days feel like they drag on for all eternity, I hadn’t really ever needed to think fast or plan my next move.\nThere wasn’t really any point when all my days were the exact same.\nBut now all of a sudden, my life seems to be changing dramatically everyday.\nI need to adapt to the constant change, though that’s not as easy as it sounds.\nThat’s why I’m scared.\nI’m scared I won’t have enough time in the days to plan the next.\n...\nMaybe that’s the point though.\nMaybe I’m meant to be living in the moment.\nMaybe in order to adapt to the constantly-changing environment that surrounds me, I need to change myself.\nActually, wait…\n…doesn’t “adapt” literally mean that?\nI’m such an idiot.\n<<RoadsideMorning>>\nIt’s sorta cold today.\nThe sun’s still shining and all but, there’s a pleasant breeze present still.\nI like it.\n...\nI’ve been saying that a lot lately, haven’t I?\n“I like it”...\nIt sounds like some sort of company slogan.\nMaybe I need a new catchphrase.\nBut in all seriousness, I have, haven’t I?\n...\nIt just hit me.\nYou don’t need a purpose to be happy.\nHumans are without purpose.\nPurpose is something we have created as a species.\n...\nThat makes me feel even better.\nThat I can be happy.\nI retain the ability to live a happy life.\nEven if I am doomed to get a depressing job and live a “normal” life, there’s still going to be things that make me happy. Things worth sticking around for.\nThat’s reassuring...\n...\nIs it though?\nI know I’m literally going back on what I just said here but, I think we sort of do need purpose to be happy.\nI mean, maybe there’s a dude out there who can be completely fine and happy without a purpose,\nbut I feel like just living life for no reason, knowing you’re not here for any purpose, is only going to make you depressed.\nAnd I mean, if we’re going with this whole “my purpose is beyond human thing” then saying humans created purpose doesn’t make much sense.\n<<MusicStop>> \nI guess what I’m trying to say is that I’d like a purpose, but I think I might be able to get by without one.\n<<SchoolGate>> <<FaithLoveAndDeath>> \nI’m standing outside the school gates\nI can see Katie standing from behind a tree.\nI give a friendly wave and don a warm smile.\nI’m not too surprised to see Katie here again today.\nFor some reason, I half-expected it.\nI guess I’ve sensed some sort of pattern in her.\nI’ve sort of noticed how she does something once, and then instantly makes a habit out of it.\nI’m not too sure if that’s just things related to me, or if she does this for everything.\nIf the latter, please, just never let this girl touch a cigarette.\n<<KatieAppear>> <<KatieSmile2>>\nKatie trots up next to me.\nWe’re walking side-by-side now.\n<<Kishimoto>>\nHello!\n<<Katie>> <<KatieSmile1>>\nHey…\n<<NoOne>>\nWe really do look like a couple, don’t we?\nIs that what she wants?\nIs that what I want?\nI mean, I just met this girl around four days ago now, and I don’t think I’m really able to develop romantic feelings towards anybody in that amount of time.\nBut her on the other hand, I seem to be the first person to actually try and make somewhat of an effort with her.\nI can see how she might develop feelings towards the first person to actually try and make friends with her.\nAfter all, I have been eating lunch with her in the same secluded spot everyday since I met her.\nAnd she might’ve noticed how I’ve been getting better at English since our first encounter.\nShe might’ve put two and two together and realized I was doing it for her sake too.\nI can actually see how she might assume that I might have romantic feelings for her.\nMaybe she feels bad and wants to return the favor?\n<<Hallway2>>\nShe’s still walking next to me.\nWe’re not in the same class so I assume we’re going to split up eventually.\nI begin to walk up the stairs to the second-year classrooms, to which I turn around midway to check if Katie’s coming up too.\nShe’s scurrying quickly up the steps.\nI’ve only actually just realized I don’t know what year she’s in.\nWell I suppose first year’s ruled out.\nI can’t really tell just going off her appearance.\nWe reach the top of the stairs and I hear a voice coming from my right.\n<<FujinamiAppear>> <<Fujinami>> <<FujiLuagh>>\nYo! Wassup–\n<<FujiEmbarrased>>\n...\n<<FujinamiFades>> <<KatieAppear>> <<KatieNormal>> <<Katie>>\nHm?\n<<Kishimoto>>\nDude, what is it?\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>>\nSorry, am I interrupting something here?\n<<Kishimoto>>\nUm, no–\n<<Fujinami>>\nI’m so sorry, I’ll just leave you two to it!\n<<FujinamiFades>> <<Kishimoto>>\nWait! Fujinami!\n<<NoOne>>\nHe runs off in tears screaming: “WWWHHHHYYYYY!?!?!!?!?!?!”\n<<KatieAppear>> <<Katie>>\n...\n<<Kishimoto>> \nUm, er, sorry.\n<<NoOne>>\nI want to say “sorry about that” but my English isn’t good enough to permit that.\n<<Katie>> <<KatieSmile2>>\nIt’s okay.\n<<NoOne>>\nI don’t know what she just said.\n<<KatieNormal>> \nI quickly open up Google Translate on my phone and type in what I want to say.\nI lift my left index finger up to her as I do, to signal her to wait.\nShe seems to understand and waits patiently as I type.\nI would just use Google Translate to talk to her all the time if I wasn’t such a slow typer.\nI finish typing and point my phone screen to her.\nEnglish text is displayed on the screen reading: “Sorry, but I’m going to eat lunch with that guy today. Sorry.”\nHis pathetic display had that much of an impact on me.\n<<KatieFades>>\nShe nods in understanding and walks off down the hall and enters classroom 2-1.\nSo she’s a second-year, huh?\n<<ClassroomDay>> \nIt's English class now.\n<<EnglishTeacher>> \nSo, does anyone want to say a sentence?\n<<NoOne>> \nI never usually put my hand up when he says this.\nGranted, nobody really does, but I absolutely never put up my hand.\nHe knows very well just how abysmal I truly am at English.\nWell, was.\nI’m still pretty bad for my age, but now that I have a pretty big motivation, I have been studying it a lot more.\n<<MusicStop>>\nI nervously stand up from my seat and raise my hand.\nI’m the only one that does.\nEveryone turns to me. The teacher even impulsively lets out an audible gasp.\n<<What'sDoneIsDone>> <<EnglishTeacher>> \nK-K-Kishimoto?!?\n<<NoOne>>\nI bite my lip, and take a deep breath.\n<<Kishimoto>>\nI’ll do it.\n<<NoOne>> \nThe room falls silent.\nEveryone’s shocked at my statement, a few people even have their mouths wide open, the teacher being one of those said people.\nI take one last deep breath before saying my sentence:\n<<MusicStop>> <<Kishimoto>> \n“Hello! How are you today?”\n<<NoOne>> <<What'sDoneIsDone>> \nEveryone. Is. Shocked.\nNobody is even able to let out but a gasp.\nThe teacher falls to his knees.\n<<Girl(A)>>\nSensei! Are you alright?\n<<Boy(A)>>\nSensei? Sensei!\n<<NoOne>>\nThe teacher barely manages to pull himself up off the ground, shaking vigorously as he does.\n<<EnglishTeacher>>\nK-Kishimoto…\n<<NoOne>>\nI stare worryingly at him.\n<<EnglishTeacher>>\nYou have… made me… so… proud…\n<<NoOne>>\nHe then falls to the floor and is swiftly escorted to the nurses office.\n<<ClassroomDay>> <<MusicStop>>\nIt’s lunch time now.\nEveryone's staring out the window.\n<<TheWay>>\nI get curious and take a peek for myself.\nLooking out the far window in the classroom shows that just outside the front gate an ambulance is present, with the English teacher being carried into it on a stretcher.\nI stare blankly at the odd sight for a few seconds before getting up to go to the cafeteria.\nI forgot to make myself a bento today as well. It’s fine though, considering I’m eating with Fujinami today.\nWait, I didn't actually make any kind of plans with him, did I?\nEh, I’ll probably find him moping around in the cafeteria anyway.\nThough just as I’m about to go through the door, I’m suddenly swarmed by the entire classroom, leaving me unable to walk through the door as they are blocking it.\nI can’t really tell what they’re saying to me.\nI think they’re congratulating me?\nWait no, I’m pretty sure they’re interviewing me?\nI’m not sure.\nMaybe a few of them are congratulating me and a few of them are interviewing me?\nAgain, I really can’t tell with everyone talking over each other.\nI don’t really see a way out of this.\nThe crowd that’s been created around me is too thick to force my way through.\nAnd I can’t answer every single thing they all have to say to me either.\nEven if I could, they’d inevitably come up with something else to say, that I’d also have to give an answer to.\n...\nI really am stuck here, aren’t I?\nUm, maybe somebody will come save me?…\n...\nAnd just as I say that…\n<<Student>>\nWoah there! Is that the American girl?\nI think it is!\n<<NoOne>>\nThank goodness.\nShe must’ve just come out of class and is investigating what all the commotion is about.\nThough her presence doesn’t really seem to help nor hinder me.\nShe’s too short to even be able to see me in the middle of the crowd.\n...\nI do have one plan that might work…\n...\nDesperate times call for desperate measures…\n...\nShe can’t speak Japanese anyway, it’ll be fine.\n<<Kishimoto>>\nHuh, wait, is Katie here?\n<<Student>>\nOh, huh? oh yeah, she is.\n<<Kishimoto>>\nOh dude, I promised I’d eat with her today like we always do!\n<<Crowd>>\nHuh?\n<<Kishimoto>>\nOh how romantic it is! Feeding each other under our little tree in the courtyard, sneaking the occasional kiss at each other, how truly wonderful it is to be in love!\n<<Crowd>> <<ScreenShake>> \nHUH?!?!\n<<NoOne>>\nOkay, maybe this was actually a terrible idea.\nI didn’t really properly consider the consequences it would have.\n<<Student>>\nIs Kishimoto-san taking advantage of the American girl?\nSo THAT’S why he’s suddenly learnt English.\n<<Crowd>> \nWhat is this scandal!?\n<<NoOne>>\nYeah, no, this was such an awful idea.\n<<Kishimoto>>\nUm, yeah, just kidding guys!\n<<Crowd>> \nHuh?\n<<Student>>\nWhat a dirty liar!\n<<Crowd>>\nThis guy sucks!\n<<Student>>\nI hate him, let's stop talking to him!\n<<NoOne>>\nThe crowd begins to clear.\nHuh, I guess this ended up quite well!\n<<Student>>\nWait guys! Don’t you think he might’ve just said that to make us angry and clear the crowd just so he could spend some quality time with his girlfriend?\n<<Boy(A)>>\nHuh, yeah.\n<<Boy(B)>>\nWas that lie, a lie?\n<<Crowd>>\nMaybe this guy isn’t so bad after all…\n<<KatieAppear>> <<NoOne>> <<KatieShockedNormal>> \nEventually the crowd gathers again, this time pushing Katie into the middle with me.\n<<Kishimoto>>\nSorry…\n<<Katie>> <<KatieSmile2>>\nIt’s okay… h-heh.\n<<Crowd>> <<ScreenShake>>\nSO HE REALLY CAN SPEAK FLUENT ENGLISH!?!\n<<NoOne>>\nI don’t know if I should be impressed because they keep all managing to say the exact same thing at the exact same time, or because they actually think I’m fluent in English?\nI literally don’t even know what she just said.\nAll of a sudden, we’re once again bombarded with questions.\nThis time, some of them are asked in embarrassingly poor English.\n<<Student>>\nKiss? Yes? No?\n<<NoOne>>\nI can’t tell if they’re asking if WE kiss, or if THEY can have a kiss.\nIt was annoying enough being asked stupid questions in Japanese, but there’s something even worse about being asked stupid questions in really poorly spoken English.\nI suppose it’s a little entertaining hearing JUST how painfully bad some of these kid’s English skills actually are.\nEvery-so-often I’ll hear Katie give out a little chuckle, supposedly at the bizarity of the questions.\nI think half of them don’t even realize the stuff they’re saying.\n<<Student>>\nNaked? Eyes?\n<<NoOne>>\nWhat is that even supposed to mean?\nNo seriously, I’m genuinely curious.\nAre they asking if my eyes wear clothes?\n<<KatieFades>> <<Kishimoto>>\nDespite the rumors, I just wanted to say that yes, my eyes ARE actually naked.\n<<NoOne>>\nI say that in Japanese.\nThe crowd goes dead silent for a moment.\nI feel confused looks gaze upon me.\nThough the silence doesn’t last for long and everyone goes back to asking questions.\n<<KatieAppear>> \nI give Katie a side-eye and we both let out an innocent chuckle.\n<<Student>> \nGay? Secret?\n<<NoOne>> <<KatieNormal>>\nOur laughter immediately stops.\n“No” we both say in tandem, a daunting tone present in our voices.\nThe student backs out of the crowd.\n<<ClassroomEvening>> <<MusicStop>>\nClasses have ended for the day.\nToday was certainly… interesting to say the least.\n<<IWillAlwaysLoveYou>>\nI’m still curious as to what that guy meant when he asked, “Naked? Eyes?”.\nSeriously, what does that even mean? I genuinely want to know.\nNot being a part of any clubs, I put my bag over my shoulder and head straight to the door.\nThough just as I come to the classroom’s exit, Katie walks through the door.\nWe both give out a surprised “Ah!” when we see each other.\nI’m able to step back the second she walks through the door though, so there ends up being no collision.\n<<KatieAppear>> <<Kishimoto>> <<KatieNormal>>\nOh, er, hello.\n<<Katie>>\nOh, uh, hi!\n<<NoOne>>\nShe says that a little half-heartedly, as she’s clearly occupied with something else.\nIt seems as if she’s taking something out from her bag.\nAnd sure enough, she is.\n<<KatieSmile1>> \nShe holds up a piece of paper with text reading “Walk home?” in simple Japanese.\nI smile at her attempt.\n<<Kishimoto>>\nYes\n<<NoOne>>\nI give a thumbs up sign to her.\n<<KatieFades>>\nKatie’s face lights up and she instantly grabs me by my hand and starts pulling me along.\nDown the stairs, through the main courtyard, and out the gates…\nI can’t help but pay attention to how she’s holding my hand.\nHer hand is warm and soft; not unlike what you’d expect of such a beautiful highschool girl.\nI laugh and smile as we run through the school.\nI like this.\nNo, actually, I love it.\n...\nWait, how close does she even live to me?\nHow does she know which way I take and if it’s even the way she’s meant to go?\nWait, she’s close enough to school to walk?\nDoes she?...\n<<RoadsideSunset>>\nMe and Katie walk side-by-side down the road together.\nI usually walk down this road with Fujinami.\nActually, speaking of, where is Fujinami?\nI look behind me, half-expecting him to be there for some reason.\n<<FujinamiAppear>> <<FujiShocked>>\nSurprisingly enough, he actually is.\nHe’s standing there, speechless.\n<<Fujinami>> <<FujiEmbarrased>>\nSorry, I must be interrupting something here, aren’t I?\nI’ll just… walk past you two here…\n<<FujinamiFades>> <<NoOne>> \nFujinami steps in between the two of us and runs off vigorously crying: “WHHHYYYYY!!?!?!?”\n<<KatieAppear>> <<KatieNormal>>\nKatie and I can’t help but stare at each other.\n...\nWe look back in front of us.\n...\nWhat are we meant to say?\nNo seriously, what the hell was that?\n<<Kishimoto>>\nNaked? Eyes?\n<<Katie>>\nHuh?\n<<NoOne>>\nShit.\nThat was the first thing that entered my mind, and I just kind of… said it.\nI didn’t even look at her while I said that.\nIf I had said literally anything else it would’ve looked really cinematic; staring into the sunset on the edge of the road, the sea in the background.\nInstead I just said that.\nMy comment heavily clashed with the cinematic atmosphere, and instead turned it into a comedic one.\n<<Katie>> <<KatieSmile2>>\nHe he!\n<<NoOne>>\nI turn to her, a somewhat surprised look present on my face for whatever reason.\n<<Katie>> <<KatieLuagh>>\nHeh heh heh he ha!\n<<NoOne>>\nI give a warm smile, which eventually turns into laughter.\nThere we are, both laughing uncontrollably at the side of the road.\nIt’s a rather strange sight.\nIt always seems that way everytime we laugh together.\nI guess we are a little strange ourselves.\nI’m doomed to live a “normal” life without purpose in society, and she’s an exceedingly out-of-place American transfer student who can’t speak Japanese.\nAnd even though we are unable to understand each other, we’re still friends.\nAs I laugh, a tear sheds from my eye.\nPartly because of how hard I’m laughing, partly because of how eleated I am to be this happy while standing on this road.\nThe sheer emotions I feel towards this moment are so strong, they make me shed a tear; a tear of happiness.\nIt’s in this moment, right now, that for the first time ever, I feel truly grateful for my life.\n<<MusicStop>> <<KatieFades>> \nWhen I first realized I had “no purpose” back in middle school, I wanted to kill myself.\n<<GoodbyeToYou>>\nI saw no point in living.\nI thought that whoever put me on this planet hated me.\nI actually did try to kill myself at one point.\nMultiple times, actually.\nThe first time, I tried using a knife.\nI was in an argument with my mother about… let's leave it out of the story for now… anyway, I eventually hit my limit with her after she wouldn’t believe me and ran to the kitchen.\nI swiftly ran to the cupboard and pulled out a sharp knife.\nMy mother, screaming and crying incessantly, ran into the room as fast as she could and grabbed my arms.\nI didn’t mean to, but while I struggled to get out of her grip, I accidentally stabbed her in the arm with the knife.\nEven then, as she was screaming and crying in pain, blood pouring out of her arm, she still tried to protect me.\nAfter we wrestled for twenty minutes or so, I gave up.\nIt was after I saw the wound on her arm that I threw the knife onto the ground and gave her the biggest hug I could.\nI ended my suicide attempt after I realized how it was affecting my beloved mother.\nThat hug assured her that I still truly loved her.\nMy other attempts were… more desperate maybe?\nI had actually planned out the other two so that she wouldn’t realize that I died.\nOr at least wouldn’t realize I killed myself.\nI unfortunately forced my friends to endure those.\nThey were… mortified after that for sure…\nI really, really don’t want to talk about it.\n<<KatieAppear>>\nI’m just so happy that… right now… I can share such happiness with somebody else.\nWith her. Katie.\n<<RoadsideSunset>> <<MusicStop>>\nWe come to the outside of my house.\n<<IWillAlwaysLoveYou>>\nThere are two other houses to the right of my little cottage built under a cliffside, making three in total.\nThey’re all the same design; a small cottage with the tiniest backyard, one bathroom, a small kitchen, and other rooms that you can do whatever you want with I guess.\nThe only real difference within the exterior of the houses are the color schemes.\nMine’s a light blue, another one is a light pink, and the other a desaturated light yellow.\nWhile the houses are situated in a beautiful location; looking out onto the wide, vast ocean, building them beneath a cliff in a country where earthquakes are a common event was the dumbest idea ever.\nIf we ever have another bad earthquake, my mom and I are so screwed.\nKatie gives me a friendly wave and walks off.\nI assume she just kind of guessed this is where I live because I stopped here.\nDid she go out of her way to walk me home?\nIf so, I feel kind of bad.\nGranted, she didn’t really “walk me home” per se, rather just kind of followed behind me as I walked back to my place.\nI wonder where she lives?\nWell it doesn’t take long for that question to be answered when I see her walk into the yellow house on the far right.\nWait… has she lived next to me this whole time?\nNow that I think about it, I don’t actually think I’ve ever seen anyone come out of that yellow house.\nWhen we moved in, both houses were vacant.\nWhile the pink house has remained that way, one day, my mom and I saw a car parked at the front of the yellow house.\nAnd it kept coming back.\nWe eventually realized that someone had moved into the yellow house.\nThat was roundabout the same time the rumors of an American girl transferring to our school started to spread.\nIf she’s lived so close to the school this whole time, how come I never see her walking?\nMaybe she does but she just leaves a lot earlier than me?\nI mean, she’s always there before I am.\nJust as I open the door to my house, I see her head poking out of her door out of the corner of my eye.\nI turn to her and give a warm smile.\nShe waves.\n<<BedroomEvening>>\nI sit down once again to study some more English.\nI feel slightly more motivated knowing how close she lives to me for some reason.\n<<MusicStop>>\nI’ll try to learn a bit more tonight.\n<<Date>>\nMy room.\n<<IWillAlwaysLoveYou>> \nI sure am in it.\nI swiftly leap out of bed and begin my morning routine.\n<<RoadsideMorning>> \nI step outside the door, the light from the sun blinding me momentarily.\nI lift my left arm to shield my eyes from the light, though they adjust quickly enough either way.\nJust as I start to walk off to school, I hear the sound of a door opening to my right.\nNaturally, I impulsively turn to the source of the sound: the yellow house.\nI see Katie wave goodbye to her parents as she closes the door behind her.\nI watch her take a deep breath as she steps out onto the road.\nI assume this is her first time walking to school.\nBut then she turns to my house and walks over.\nI put on a comforting smile.\n<<Kishimoto>> <<KatieAppear>> <<KatieShockedNormal>>\nHey!\n<<NoOne>>\nI learned some slang and abbreviations used frequently in the English language last night.\n<<Katie>> <<KatieSmile2>>\nH-hello…\n<<NoOne>>\nI point a sideways thumbs up to the road ahead of us and nod my head in the same direction, signaling for us to set off.\nShe gives a little nod and we walk off.\n<<RoadsideMorninga>>\nAs we make our way down the road, I can’t help but feel as if Katie has something to say judging by the expression on her face.\n<<KatieAppear>> <<KatieSad>> <<Katie>> \n...\n<<Kishimoto>>\nWhat’s wrong?\n<<NoOne>>\nI know I won’t be able to understand her answer, but I might as well ask.\nIt might comfort her.\nEither way, even if I don’t know what she’s saying, I can still just nod my head and say “uh-huh” and pretend like I do.\n<<KatieBlush>> <<Katie>> \nU-um…\n<<NoOne>>\nShe takes a deep breath.\n<<Katie>>\nCan we go somewhere after school together?\n<<NoOne>>\nShe says it in perfect Japanese.\nIt’s a relatively complex sentence, so unless she’s secretly been able to speak Japanese this entire time, she probably learnt it off this morning.\nOr last night for all I know.\nI feel rather touched.\nShe clearly wants to hang out with me after school, or else she wouldn’t have gone to the trouble of learning off such a sentence.\n<<Kishimoto>> \nSure!\n<<NoOne>>\nI respond in English.\n<<KatieLuagh>> \nShe stares at me briefly, until her face lights up like a Christmas tree.\n<<Katie>>\nOkay then!\n<<NoOne>>\nMaybe her Japanese is a bit better than I thought?\n<<SchoolGate>>\nWe stand at the front gate.\nThis is my first time ever coming to school with a friend.\nFujinami usually walks home with me, but he never seems to walk to school.\nI’m sure he has his reasons.\nMore-than-likely, those “reasons” involve sleeping in.\n<<KatieAppear>> <<KatieSmile1>>\nI give Katie a warm smile and we walk through the gates.\n<<Hallway1>>\nWe come to the storey where the second-year classrooms are situated and depart like yesterday.\nAfter I walk off, I can’t help but shake the feeling people are looking at me.\nNo, they definitely are.\nI can hear whispering all around me, most words too hard for me to make out apart from “Kishimoto”.\nI think I can also hear the words “girlfriend” and “killed”.\nI suppose after seeing me wave goodbye to Katie in the hallway, everyone there was reminded of how we’re apparently dating.\nI can understand what the conversations around the former surround, though with the latter I’m just concerned as to why my name is within the same sentence.\n<<ClassroomDay>> <<MusicStop>>\nI walk into my classroom.\nMore whispering can be heard.\n<<Ain'tHappening>>\nAgain, the same three words are the only ones I can make out.\n...\nI’m starting to get a little worried.\nActually, there seems to be almost no one in this room using the word “girlfriend”.\nNow it’s just people talking about how I apparently killed someone.\nTrying to ignore the whispering, I sit down at my desk.\n<<ClassroomDay>>\nA rather strange amount of time passes before any member of staff comes in.\nFifty-two minutes to be exact.\nI got so bored I started counting.\nI just kind of guessed how many minutes had passed before I started counting and then added them on.\nSo it’s not really “exact”.\nAnyway, after a considerable amount of time passes, a teacher comes in.\nIt’s the principal.\n<<MusicStop>> <<Principal>> \nHello students.\nSome of you may be aware of the recent death of English teacher, “Isamu Domen”.\n<<NoOne>> <<TheWay>>\nSome surprised whispering can be heard from around the room, others melancholically nod.\nI’m rather taken aback by this information myself.\nWhat happened to him?\nI’m also rather surprised at how depressed some of the students seem about this news.\nI didn’t really think anybody really cared about him that much.\n<<Principal>> \nWe will be having a funeral today to acknowledge his death.\nI apologize for this taking place on such short notice.\nPlease follow me to the P.E hall.\n<<NoOne>>\nSome students seem happy; supposedly about getting to miss out on class.\nOthers seem curious; presumably about his death, specifically the cause.\nAnd others seem like they could burst into tears at any moment.\nThe rest just look like they don’t care.\n<<Gym>>\nWe come to the gym where the rest of the school is now gathered.\n<<Principal>>\nHello everybody.\nWe are gathered here today, to acknowledge the recent death of year-two English teacher, “Isamu Domen”.\nHe died of a heart-attack, supposedly caused by a sudden feeling of immense shock.\n<<NoOne>>\nWhispers can suddenly be heard.\n...\nI essentially did kill him, didn’t I?\nWell either way, I’m not taking accountability for something so stupid.\n<<Principal>>\nDomen-san had done many things for our school over the couple of weeks he had been here for.\n<<NoOne>> \nOh yeah, that reminds me. This teacher had only been hired at the start of the year.\nWhich makes it all the more ridiculous that people are crying over this!\nI mean, he wasn’t even that great of a teacher.\nIf anything, he was a rather bad one.\n<<Principal>>\nHe taught the students…\n<<NoOne>>\nThat’s because it’s his job to do that.\n<<Principal>>\n…he wasn’t bad to the staff…\n<<NoOne>>\nIsn’t that the bare-minimum?\n<<Principal>>\n…and he wasn’t such an awful person.\n<<NoOne>>\nI think he’s just trying to find literally anything even remotely nice to say about him.\n<<Principal>>\nDomen-san had helped turn all of us into better people…\n…he showed us the proper way to live…\n…and how to improve on our weaknesses.\n<<Kishimoto>>\n...\n<<NoOne>>\nWho wrote this speech?\nSurely the principal didn’t.\nI don’t think they’d assign someone who can write something so delusional the role of “principal”.\n<<Principal>>\nWe will now invite each teacher to come up and say one thing about him…\n<<NoOne>> \nAnd so they did.\nOne by one, each teacher came up, saying something about him.\nAlmost none of what the stuff they were saying was true, but it was understandable as to why they’d make up all this stuff when there’s nothing really all that good to say about him.\n<<Teacher(A)>>\nHe was such a great person. He spoke English. I think that alone says enough about the perseverance, drive and devotion he retained towards his career.\n<<Teacher(B)>>\nI remember when we were little, we used to play together for hours everyday.\nBut there comes a time in every relationship where they must part. I am so grateful to have had insert name here- I mean Domen-san as a friend and am deeply upset about his death.\n<<NoOne>> \nWait, is this speech just a template they found off the internet?!\n<<Teacher(C)>>\nHe was so nice to me. I remember when I was getting a divorce with my husband after I found out he was having an affair, I was so depressed.\nBut just when I needed him most, Domen-san came to me and helped me. I will forever be grateful for that.\n<<NoOne>>\nI feel sorry for the first-year math teacher who had to read out that last one.\nHer husband is going to be so pissed.\nI bet the guy who wrote that one was probably having the time of his life, laughing away as he did.\nThis is the worst funeral ever.\nA large part of that is due to the fact it’s being held in a highschool.\nHalf the people here are probably glad he’s dead.\nActually no, scratch that.\nA lot more than 50% of people in this building right now are definitely happy he died.\n<<Principal>>\nWe will now say a few prayers followed by a moment of silence.\n<<NoOne>>\nThe exact thing that was promised to happen was what happened.\nThe funeral went on until the day ended.\n<<SchoolGate>> <<MusicStop>>\nI stand outside the gates, waiting for Katie.\nShe’s grabbing something from somewhere or something.\nShe’s in the school right now is what I’m trying to say.\n<<Fujinami>> <<FujinamiAppear>> <<FujiLuagh>> <<Idiot>> \nYo Kishimoto! Where’d ya wanna go?\n<<NoOne>>\nHe didn’t even ask me if I even wanted to hang out with him.\n*sigh*\n<<Kishimoto>>\nSorry but, I’m going out with Katie today.\n<<NoOne>> \nI garner some looks.\n<<Fujinami>> <<FujiEmbarrased>> <<ScreenShake>> \nO-oh yeah, of course. Sorry I-I’m probably being a bother here, aren’t I?\nI’m just gonna leave-\n<<Kishimoto>>\nBut I can hang out tomorrow if that’s okay.\n<<Fujinami>> <<FujiShocked>>\nHuh, y-yeah, I don’t see why not. I’m not busy or anything tomorrow.\n<<Kishimoto>>\nYeah? Well I’ll see you tomorrow then!\nMeet me at my house at one PM! Okay?\n<<Fujinami>>\nYep, sounds g-good to m-me!\n<<FujiSmile2>>\nS-see you then K-Kishimoto…\n<<NoOne>>\nHe’s clearly trying to hold back tears.\n<<Kishimoto>>\nYep, bye!\n<<Fujinami>>\nBye…\n<<FujinamiFades>> <<NoOne>> \nHe runs off.\nHe’s trying his absolute hardest to hold back from breaking down into tears.\nSupposedly tears of both sadness and happiness.\nThat’s probably the first time that I’ve been the one to ask to hang out with him.\nThat’s probably why he’s so happy.\n...\nI’m really not sure why I just did that…\n…I’m REALLY going to end up regretting that decision, aren’t I?\n<<KatieAppear>> <<KatieSmile1>>\nKatie appears before me.\n<<Kishimoto>>\nSo, where are we going?\n<<NoOne>>\nDespite me asking in Japanese, she seems to understand the question.\n<<KatieFades>> <<MusicStop>>\nShe grabs my hand and leads me off somewhere.\nEveryone is looking at us\n<<MarinaDay>> <<IWillAlwaysLoveYou>> \nShe takes me into town.\n<<KatieAppear>> \nThere’s always a little farmers market that goes on down here on specific days of the week.\nEnthusiastic voices can be heard from all angles.\nBoth from consumers and sellers.\nThere’s a lovely warm bubbly feel to it.\nI’m assuming she took me here because she likes it.\nI’ve never really been to the farmers market.\nI’ve only ever walked past it on my way to buy groceries and stuff.\nLooking at everything now, I could’ve gotten the same things I was buying for cheaper, fresh, and from a local.\n...\nI feel like a bit of an idiot all of a sudden.\nKatie enthusiastically shows me around the place.\nWe go from stall to stall, examining each farmer’s produce.\nThere’s a lovely smell around the place.\nAs we look at some mandarins, I make sure to engrave the image in my mind.\nI really love being here with Katie.\nExperiencing all these new things, surrounded by happiness.\nI really love it.\n<<KatieFades>>\nWe look around a little bit more before filling a couple of plastic bags with fresh fruit and sitting down on a nearby bench.\nEven though there’s more people than just us around, right now, it really does feel like it’s just me and her.\nSitting side-by-side, looking at all the happy people buying fresh produce from all the farmers, the farmers shouting their sales pitches, the seagulls flying above us, squawking.\nIt really does feel like it’s just me and her.\n<<MarinaEvening>> \nThe sun begins to set.\n<<KatieAppear>>\nI look to Katie to see if she wants to leave.\nShe looks back and gives me a warm smile.\nA smile that says: “I don’t want to leave you just yet. Let’s go to one more place.”.\nI nod.\nShe sits up, grabs my hand and pulls me along.\nI don’t know where we’re going, but as long as it’s with her I’m fine.\n<<BeachEvening>>\nThe beach.\nWe don’t have swimsuits with us, so we can’t exactly go swimming right now.\nEither way, it’s too dark and too cold to be swimming.\nSo we just sit there.\nNext to each other, curled up, watching and listening to the waves crash against the shore.\nI want this moment to last forever.\nI want it to never fade, not for a single moment.\nI clench my fist knowing that it will end.\nI don’t want that.\nI want to stay here for as long as I can.\n...\n…with her.\n<<MusicStop>>\nI want to be with her for as long as I can.\nI shed a tear.\n<<Babel>>\nHeh, how pathetic…\nThat I’m actually feeling this way…\nHumans are a waste of time for me, remember?\nHeh…\nI don’t have a purpose within society.\nShe does.\nIt’s simply just not right…\n…I can’t…\n...\nNo matter how much I want it…\nHumans…\n…are a… waste of time… for me…\n...\nShe’s managed to show me so much happiness.\n...\nShe’s managed to bring so much happiness to my life.\n...\n...\n...\nI’ve finally realized something…\nPeople aren’t a waste of time for me.\nI… do have a purpose…\nIt’s to live my life with this girl…\nTo be with her forever…\nMy purpose was to find someone like that…\nAnd I finally have…\nHeh…\nI tried killing myself over something that’s not even true?\nA shiver is sent down my spine thinking about what would’ve happened if I did kill myself…\nHow crushed I would’ve been learning there really was something waiting out there in the world for me…\nSomeone…\n…someone as wonderful as her.\nI would’ve been crushed.\nKnowing I would’ve gotten to spend a lifetime with her…\nI gave up too soon.\nI suffered so much.\nI made others suffer too.\nAfter I’d seen how much pain and suffering I’d caused other people, I just decided to deal with it.\nDeal with what I thought was the reality of my life.\nI might be normal, yes.\nBut I think that’s starting to change.\n“Normal” people don’t experience true happiness.\nThey only experience the “normal” kind of happiness.\nI believed I was normal, and I eventually became it.\nYou become what you believe.\nYour thoughts make up who you are.\nThere are no “normal” people.\nOnly people who believe they are normal.\nOnly people who, whether they realize it or not, have chosen to live a bland life of their own will.\n...\nWith her around…\n…I would never be able to be the cause of that smile going away…\n…I would never be able to live with myself if I caused her suffering…\n…and that’s why I can’t be with her…\n…I can’t cause her suffering…\n…I just can’t…\n…and if I date her… I will…\n…it’s just inevitable.\nSo I have to go up against my purpose.\nI will be normal.\nAs I said, I realized a long time ago that I needed to be normal to protect the people I love most.\nI need to live a dull, boring and wasteful life for the sake of others…\n…for the sake of her.\nI am “normal”.\nAnd it will stay that way.\nI’ll probably never see this girl again after highschool.\nSo that’s why I’ll make the most of every moment I have with her…\nShe’s already given me the chance to experience true happiness…\n…that’s enough for me.\nI don’t have the skills, or the will power to become rich or famous or whatever.\nThat wouldn’t even make me nearly as happy as I am when I’m around her.\nShe is my purpose.\nBeing with her is my purpose.\nBut I’d inevitably cause her suffering.\n<<MusicStop>>\nI couldn’t live with myself if I did that…\n...\n<<GoodbyeToYou>>\nI begin to cry.\nSo many tears pour from my eyes…\nAnd all I feel is a warm embrace from Katie.\nI can tell she’s smiling softly.\nThe more I cry, the tighter she holds me.\n...\nI want this moment to last forever…\nFor as long as it possibly can…\nI cry even more…\nIf I cry any longer, I’ll end up keeping her out here until it’s pitch black.\n...\nSo I hug her back.\nI hold her as tight as I can.\nTo keep her warm.\nI want to be with her forever.\nI can’t have that though.\nNo matter how much I want it.\nIn my current state, I’ll never have it.\n...\nI love her.\nThat is the only thought that finds itself situated within my mind.\nTeardrops begin to fall onto my shoulder.\nI’m pretty sure they’re Katie’s.\nI don’t really know why she’s crying.\nMy best bet is that when other people cry, she starts crying too.\nShe seems like the kind of sympathetic person to do that.\nAnother thing I like about her…\nI cry even more.\nAs I think about more things I like about her, I begin to cry even more.\nUntil I can’t any longer.\nBefore I fall asleep.\nBefore we fall asleep.\n<<MusicStop>>\nTogether, on the sand.\n<<BlackScreen>> \nMy tears have devolved into nothing more than sniffles now.\nI’m pretty sure Katie still has her arms around me.\nI can still feel her cuddled up next to me.\nHer head is lying on my chest.\nWe’ll probably wake up before tomorrow.\nIt’s still early enough yet.\nI think.\nI have my eyes closed and I’m not too sure how much time has passed.\nBut I’m staying here.\nI’m staying here until someone moves me.\nI don’t want to leave her side.\nBecause…\n…I love her.\nI love the person I’ll never get to be with…\n...\nWhile I hope something changes, I doubt it will.\nI’m stuck like this forever.\nDestaint to never be with the person I love.\nI’ll go to my depressing 9-5 office job everyday thinking about her.\nThinking about what could’ve been if I wasn’t such a destructive person.\n...\nIf I hadn’t killed his brother…\n...\nA life wouldn’t have been lost if it weren't for my selfishness.\nMy pathetic display.\nSomeone died because of my actions.\nAfter I’ve done something as despicable as that, I don’t deserve anything good to happen to me.\nA 9-5 office job is what I deserve…\n…I can’t have her…\n…I don’t deserve it…\n...\nWhenever I think of that incident, I always tell myself “I killed his brother”.\nI don’t know why I do that when I had never even really talked to his brother.\nI killed my friend, a dear friend at that.\nThat was my last suicide attempt…\nI knew if I tried another one, I’d end up losing someone else.\n...\nSomeone died because of me…\n...\n…because of me.\nI can’t let that happen to her.\nI never want to be the person who puts a frown on that face.\nAnd yet that’s what I’ve just done…\nI promise, this will never happen again.\nShe will never cry again…\nNever again…\nNot as long as I’m around.\n<<Date>> \n...\n<<GoodbyeToYou>>\nThe sky is all I can see.\nThe clouds look happy.\n...\nI’m not too sure why.\nJudging by the fact I feel like I’m lying on sand, I don’t think anyone’s gone looking for us yet.\nOr maybe they have and they just haven’t found us yet.\nI still feel Katie’s arm wrapped around my chest.\nI smile to myself.\nI got what I wanted, didn’t I?\nI got to be with her…\n...\nI want to be with her for as long as I can.\n...\nI close my eyes and pretend to sleep until Katie’s awake.\n<<Sky>> \n...\nI hear a little “Mhm” coming from my left.\nI feel Katie’s arm lift off of mine.\n<<BeachEvening>> \nI open my eyes.\n<<KatieAppear>> <<KatieSmile1>>\nSure enough there she is.\nI’m not able to give her a smile.\nNot with the thought of this moment not lasting forever looming in the back of my mind.\nShe looks down at me.\nI think she knows what I’m feeling.\n...\nI feel so awful.\nSo awful about forcing this onto her.\nBut it’s too late…\n...\nI’ve already dug myself too deep into this hole.\nIf I can’t get back up, might as well start digging to China.\n<<Kishimoto>>\n...\nKatie…\n<<Katie>>\nYeah?...\n<<Kishimoto>>\n...\n<<NoOne>>\nI try to think of how to say what I’m trying to in English.\n...\nThis is weird.\nDespite it being a fairly complex sentence, and despite my English skills being rather poor, I’m still able to think of the way to say the exact thing I’m trying to say.\n...\nThere’s no point in questioning it.\nWhen life gives you lemons, make lemonade.\n<<Kishimoto>>\nLets go really far.\nReally far away from this place.\nJust you and me.\nTogether…\n<<Katie>>\n...\n…I…\n<<KatieSmile2>>\n…I like that idea…\n<<NoOne>> \nI’m able to understand her perfectly.\n...\nA warm smile comes onto my face.\nIt’s not exactly directed toward her.\nI’m just happy.\nHappy to hear her reply.\nHappy that I’ll be able to get to be with her.\nEven if just for a little bit longer.\n<<MusicStop>> <<Kishimoto>>\nWell, there’s no point in waiting around, let's get going!\n<<KatieShockedNormal>> <<NoOne>>\nShe seems a little dismayed for a second, though quickly adjusts.\n<<Katie>> <<KatieSmile1>> \nYep!\n<<NoOne>>\nA happy smile comes onto her face.\nEven though I’m somehow able to magically understand her all of a sudden, I don’t need words to understand how she’s feeling right now.\nMy smile’s too big for my face by this point.\nI stand up and pick up the plastic bags full of fruit.\nWe walk off.\n<<MarinaEvening>> <<Ain'tHappening>>\nWe’re back at where we were yesterday.\nWhere the farmers market’s held.\nThere’s a bus stop around here.\nKatie must’ve seen it when we were walking around yesterday.\nOn this day at this time, it usually goes to Tokyo.\nThough I doubt Katie knows that.\nPersonally I’m fine with wherever.\nAs long as it’s with her.\n<<KatieAppear>> <<Katie>> <<KatieNormal>> \nI saw a bus stop here yesterday.\n<<NoOne>> \nIt seems my suspicions were right.\n<<Kishimoto>> \nYeah, it goes to Tokyo at this time on this day.\n<<NoOne>> <<KatieShockedNormal>>\nShe seems a little surprised.\nI figured it’d be good to tell her where the bus is actually headed at this time.\nJust in case she wasn’t okay with it or something.\n<<Katie>> <<KatieSmile2>> \nWell… let's go there then.\n<<NoOne>> \nShe’s all smiley now.\n<<Kishimoto>>\nYeah, Tokyo seems like a solid choice.\nNow that I think about it, I don’t think I’ve ever actually been in Tokyo before.\n<<Katie>> <<KatieSmile1>> \nReally? Well all the more reason to go then!\n<<Kishimoto>>\nYeah, it’ll be exciting!\n<<NoOne>>\nIt might be a little scary though.\nI mean, I’m going into a massive city I’ve never been in before with literally nothing on hand.\n<<Katie>> <<KatieSad>> \n...\n<<NoOne>>\nIt seems the thought crossed Katie’s mind too.\n...\n<<Kishimoto>>\nIt’ll be okay.\n<<Katie>> <<KatieNormal>>\nHm?\n<<Kishimoto>>\nWe have each other.\nAnd some money… probably…\n<<NoOne>>\nKatie stares blankly at me for a moment.\n<<Katie>> <<KatieSmile1>> \nYeah…\n<<KatieSmile2>>\n…that’s all we need…\n<<Kishimoto>>\nYeah…\n<<NoOne>> \nMy heart warms so much at her statement.\nBut even in my state of bliss, I still have common sense, and I figure we’ll probably need some money.\n<<Kishimoto>>\nHey um, how much money do you have on you at the moment?\n<<Katie>> <<KatieNormal>> \nMe? Uh…\n<<NoOne>>\nKatie takes out her wallet to check, and I do the same.\n<<Katie>>\nI have 10,000 Yen.\n<<KatieSmile1>>\nI thought I’d bring a good bit for yesterday considering how expensive fruit is over here.\n<<KatieSmile2>>\nIf I’m being honest, I wanted to go with someone to that market ever since I first realized it was there.\n<<KatieSmile1>>\nSo I made sure to bring all my pocket money with me to school so we could just head straight off.\n<<Kishimoto>>\nI guess you’ve realized I always keep my wallet on me, huh?\n<<Katie>> <<KatieSmile2>> \nYep!\nI can always see it sticking out of your pocket when we eat.\n<<Kishimoto>>\nYou’re quite perceptive, aren’t you?\n<<Katie>> <<KatieSmile1>>\nYeah, ha, I suppose I am…\nAnyway, how much money do you have?\n<<Kishimoto>>\nMe? Uh, around 15,500 Yen.\n<<Katie>> <<KatieNormal>>\nSo that makes for around…\n<<NoOne>>\nShe pauses for a moment as she does the math.\n<<Katie>> <<KatieSmile2>>\n25,500 Yen!\n<<Kishimoto>>\nHm…\n<<NoOne>>\nI ponder if that’ll be enough for us to get by.\n<<Kishimoto>>\nI suppose if we scrimp and save we might be able to get by…\n<<Katie>> <<KatieSmile1>>\nWhat happened to “All we need is each other”?\n<<Kishimoto>>\nWell I’m perfectly fine with dying while with you, but I don’t think our presence alone is going to keep us alive.\n<<Katie>> <<KatieSmile2>>\nHeh, I guess so.\n<<Kishimoto>>\nBut I do mean it when I say I’m fine with dying next you y’know.\n<<Katie>> <<KatieSmile1>>\n...\n<<Kishimoto>>\nIf I had to die… I’d be fine with it as long as it’s with you…\n<<Katie>> \n…\n<<NoOne>>\nI know what I’m saying is corny, but I think it can be excused in this situation.\nShe seems to be taking my words just as seriously as I am anyway.\n<<Katie>>\nYeah… I’d be fine too…\n<<Kishimoto>>\nWith dying next to yourself? Well I guess the goodbye you’ll say to the world won’t be a hard one then.\n<<Katie>> <<KatieBlush>>\nNo, I mean… I’d be fine with dying if… I was with you…\n<<NoOne>>\n...\nI can tell she means it.\n<<Kishimoto>>\nKatie…\n<<Katie>> <<KatieSmile1>>\nYeah?...\n<<Kishimoto>>\nThere’s something I think you should know…\n<<Katie>>\nT-there is?...\n<<Kishimoto>>\n...\nIf we ever get back to school…\nI’ll tell you there…\nUnder the tree in the courtyard…\n<<Katie>>\n...\n<<NoOne>>\nShe clearly knows what it is.\nAnd yet, she smiles.\nI don’t know whether I was expecting that reaction or not.\nI don’t think I was really expecting a reaction at all.\n...\nBut I’m happy with this one.\n<<Katie>>\n...\nI’m fine with that…\n<<Katie>>\nThere’s also something I think you should know too…\n<<Kishimoto>>\nHuh? Yeah?\n<<NoOne>> \nI try to pretend as if I have no idea what it is.\n<<Katie>>\nI’ll tell you what it is if we don’t ever come back to school.\nIf all we end up with is each other.\nI’ll tell you within the bustling streets of Tokyo…\n…underneath the bright starry sky, all the lights surrounding us…\nThat’s where I’ll tell you…\n<<Kishimoto>>\nWell, we’re stuck in a bit of a situation now, aren’t we?\n<<Katie>> <<KatieLuagh>>\nHa ha, I suppose so…\n<<NoOne>>\nWe both smile pleasantly at each other.\nWe both know exactly what the other wants to say.\nBut it’s not the time for it right now.\n<<MusicStop>>\n...\nI feel awful…\n<<BlackScreen>> <<GoodbyeToYou>> \n...\nI just went back on my word didn’t I?\nI promised to never hurt her…\nI…\nI can’t be with her…\nI can’t tell her how I feel…\nI’ll just end up hurting yet another person…\n…I’ll just end up hurting her.\nIf we live the rest of our lives together, she’ll end up going through nothing but suffering…\nI wouldn’t be able to live with myself if she ended up living like that because of me…\nBut it’s not like I even could kill myself…\n…that’d just hurt her even more…\n…she’d just end up being forced to endure even more suffering…\n…until she eventually meets the same fate as my friend…\n…his brother…\n…and what could have potentially been me…\n…for me to end up making her suffer so much to the extent where she takes her own life…\n...\nAnd then we’d see each other in the afterlife…\n…she, an angel, would be standing there…\n…looking at me…\nIf I was what both made her happy, and caused her suffering…\n…well, that would just be the worst possible outcome wouldn’t it?\nThe very thing she loves most, is also the same thing that causes her the most pain…\n…and because she loves it so much, she can’t pull herself away from it.\nAnd when it… he… when he inevitably takes notice of her suffering and ends his own life…\n…she follows suit.\nThis beautiful creation ended its own life prematurely just to be with him…\n…the thing that makes her suffer most.\n<<MarinaEvening>>\n...\nAnd that’s what will inevitably happen.\nBecause I’ve just promised her I’d tell her how I feel.\nShe very clearly feels the same way, so we’d end up in a relationship…\nAnd the events will unfold.\nI’m an awful person.\nI’m fucked up in every way.\nI cause people nothing but suffering…\n...\nNow she’ll have to endure that…\n...\n<<Katie>> <<KatieAppear>> <<KatieSmile1>>\nHey Kishimoto, you’re awfully quiet.\n<<Kishimoto>>\nOh… yeah, sorry…\n<<Katie>> <<KatieLuagh>> \nIt’s nothing to be sorry for!\n<<KatieSmile2>> \nI know this is all a little scary but… I genuinely think we’ll be okay as long as we have each other!\n<<Kishimoto>>\n...\n<<NoOne>> \nIf I ever make her suffer…\nI feel as if she'll be brought to a new source of happiness.\nI’ll leave her there, and walk away.\nShe’ll be in a place, better than what she was…\nA place so nice…\n…so happy…\n…so wonderful…\n…that I won’t even need to take her there…\nSomebody else will.\nThey’ll come to her…\nIt’ll be dramatic and sad…\nBut nobody will suffer…\nNot even me.\nI’ll forget.\nI’ll forget about her…\nIt’s awful.\nBut only for me.\nMe right now that is.\nIf that ever happens, she’ll be in a wonderful, happy place, filled with so much joy.\nAnd I’ll be living a happy life.\nWhen she leaves me, I’ll have a different purpose.\nI’ll create one.\nI’ll finally be able to.\nAnd I’ll be happy.\nWe’ll both be.\nAnd then, in the end…\nI’ll leave Earth, and I’ll see her.\nShe’ll be there, waiting for me.\nI’ll be in the same blissful place as her…\n…surrounded by nothing but happiness…\n…no longer able to suffer…\n...\nGod must exist.\nHow else were me and Katie brought together?\nHow else are we magically able to understand each other?\nFor the longest time, I thought God hated me.\nSo I gave up on him; I pretended like he didn’t exist.\nBut he does love me…\nI’m pretty sure he loves all of us actually.\nWe’re put onto this Earth with nothing.\nNo knowledge, no purpose, no idea as to what’s going on.\nWe all have a purpose; we create it ourselves.\nAnd then we delude ourselves into thinking we don’t have one.\nWe do outrageous things.\nBut God's there to help us through it.\nHe’ll show us the way.\nHe’ll give us a happy ending.\nLife is truly an amazing thing.\nWe’re never truly certain of anything are we?\nBut something tells me…\n…that my feeling about the future…\n…is certainly wrong.\nIf I do make Katie suffer, we’ll just continue.\nWe’ll push forward.\nBecause that’s life.\nAnd life isn’t easy.\nMy “feeling” is just telling me that when I do something crappy, she’ll die, I’ll magically forget about her, and then when I die, I’ll meet her in heaven again.\n<<MusicStop>> \nWhat?\nThat’s too easy.\n<<ManOnAMission>>\nI’m willing to face all the hardships life throws at me.\nAs long as I’m with katie.\nAnd I mean, why should I feel awful about being in love with her when it’s literally my purpose?\nI’m just contradicting myself, aren’t I?\n“I’m going to go up against my purpose”?\nWhat, do I actually not want to have purpose or something?\nAm I some kind of masochist?\nHah, I guess it’s kind of funny in a way.\nHow I just say and feel whatever.\nHow I just jump to conclusions.\nHow I almost never think things through.\nHah, honestly, it really is the result of God’s work that Katie and I are going to be together, isn’t it?\n<<BlackScreen>> \nWe’re currently situated on the bus headed to Tokyo.\nIt’s a very long ride, around four and a half hours.\nBut one I’m willing to ride.\nBecause I’m with Katie…\n…and she makes me happy.\n...\nI’m probably not going to be hanging out with Fujinami today, am I?\n<<BusStop>> \nThe bus comes to a stop.\nThe overwhelming amounts of lights and people makes this place feel like a different planet when compared to our small little seaside town.\nKatie’s staring out the window excitedly; her smile too big for her face.\nSeeing her so happy makes me happy too.\nI can’t help but smile.\nThe bus doors open and we exit the vehicle.\nKatie seems utterly enchanted by the sounds and sights of Tokyo.\n<<KatieAppear>> <<KatieSmile1>> <<Kishimoto>>\nOkay, what’s the plan?\n<<NoOne>>\nI kind of just came up with this idea on a whim, not really taking the logistics into account.\n<<Katie>> <<KatieNormal>>\nOh! That’s, um… a good question…\n<<Kishimoto>>\nWe should probably start off by finding some sort of hotel to stay at, shouldn’t we?\n<<Katie>>\nYeah, that seems like a good enough place to start.\n<<Kishimoto>>\nUm… hey, judging by how much money we have on hand here, I really doubt we’ll be able to afford anything with two beds…\n<<Katie>> <<KatieBlush>>\nUm… yeah, no… I’m okay with that…\n<<NoOne>>\nFrom how flustered she is, it’s sort of hard to tell whether she actually is okay with it or not.\nBut we don’t really have much of a choice in the matter.\n<<Kishimoto>>\nWait, how long are we going to be staying here exactly?\n<<KatieShockedNormal>> <<Katie>>\nOh, um… however long you w-want…\n<<Kishimoto>> \nWell, however far money takes us is what I want.\nBut I guess we need to start by finding a hotel, and then figure out how far that is.\n<<Katie>> <<KatieNormal>>\nY-yeah, that seems sensible.\n<<Kishimoto>>\nWe’ll also need a bit of money for food, water, and the bus ride home.\n<<Katie>> <<KatieShockedNormal>>\nO-of course!\n<<NoOne>>\nI’m kind of just rambling on about exceedingly obvious things, aren’t I?\nWell, all of what I’m saying is right.\n<<Kishimoto>>\nOkay, enough of saying “let's find a hotel”, we don’t have all the time in the day. We’d better actually do it.\n<<Katie>> <<KatieNormal>>\nSo what are we going to do?\n<<Kishimoto>>\nExactly what I just said?\n<<Katie>> <<KatieShockedNormal>> \nO-oh no, I mean, are we going to just… walk around and go into every hotel we see and give money to the cheapest one, or do you have a different plan?\n<<Kishimoto>>\nUm… yeah, I do. I’m just searching up “cheapest hotels in Tokyo” and then going to the one with the cheapest prices.\n<<Katie>> <<KatieNormal>>\nOh… yeah no that sounds like a much better idea.\n<<NoOne>>\nIs that implying that her idea was good?\n<<Kishimoto>>\nUm, there’s this one right here. It’s 2500 yen per person per night.\n<<Katie>> \nSo if we ate and drank nothing, that would last us about four days with money to spare for the bus ride home.\n<<Kishimoto>>\nExactly, so I’m saying… two, three nights?\nIf we only eat the cheapest food we can get, we should last…\nProblem is, there’s only one bus that goes from here to our town.\n<<Katie>> \nIs that… the one we just took?\n<<Kishimoto>>\nYeah…\nIt goes back-and-forth to each place twice every Sunday.\n<<Katie>> \nOh…\n<<NoOne>>\nYeah, I really didn't plan this at all, did I?\n<<Kishimoto>>\nWe’ll make a plan…\nAnd, if worse comes to worse, we’ll get one of our parents to come pick us up.\nWe’ll act like we were, I dunno, kidnapped or something.\n<<Katie>> <<KatieSmile1>>\nYeah.\n<<Kishimoto>>\nAnd we have each other, which apparently means we’re immortal.\n<<Katie>> <<KatieLuagh>>\nHa ha, yeah.\n<<KatieSmile1>>\nWe’ll be fine.\n<<NoOne>>\nShe gives me a soft smile.\n<<Kishimoto>>\nWell, this hotel is quite far from where we are now, about a 2 hour walk, so we better get going now.\n<<Katie>> <<KatieShockedNormal>>\nO-oh yeah! Let’s go!\n<<NoOne>>\nWe begin to walk off.\n<<Street1>> \nAt this point, we’ve been walking for around an hour.\nWe’ve just been following the map on my phone.\nWe probably actually could find some kind of shortcut if we looked…\n...\n<<Kishimoto>>\nHey, um… Katie?\n<<Katie>>\nYeah?\n<<Kishimoto>>\n...\n<<NoOne>>\nWhy am I scared to propose the idea of finding a shortcut?\nMore than likely because I secretly know we’re not going to find one and will just end up wasting our time.\n<<Kishimoto>>\n...\nLet’s go to the cafe over there!\n<<Katie>>\nOh hm? Oh yeah, that place seems nice. Let’s go there!\n<<NoOne>>\nI am such an idiot.\n<<Cafe>>\nWe’re now situated within the cafe, seated at a seat that’s clearly meant for four people.\nWe’re the only people in the cafe.\nThat’s strange because this seems like it should be a popular location.\nIt’s actually quite nice.\nKatie and I both order lattes.\nI secretly wanted the white-choclate milkshake, but we really shouldn’t be making unnecessary purchases.\nGranted, I’m pretty sure coffee isn’t a necessity, but I know people who’d suggest otherwise.\n<<Kishimoto>>\nYou know, this is kinda fun.\nI mean, just going on a bus and going wherever it takes us.\nIt really does feel like we’re just on our own, having to make our own plan and manage our money!\n<<Katie>>\nY-yeah…\n<<NoOne>>\nSomething tells me that Katie doesn’t find money management fun.\n<<Katie>>\nOh yeah, I know it’s a little late for this but, don’t you think our parents will come looking for us?\n<<Kishimoto>>\nPossibly, but I mean, if they don’t know where we are, they can’t really find us, can they?\n<<Katie>>\nI suppose…\n<<NoOne>>\nKatie having reminded me about my mom, I check the notifications on my phone.\nSure enough, I have hundreds of missed calls from my mother.\nWe drink our lattes and continue on our way.\n<<BlackScreen>>\nWe walk into the lobby of the hotel we’ve been walking towards for ages now and book ourselves in.\nThe receptionist seems a little suspicious of why two teenagers are booking themselves into some random hotel in Tokyo.\nBut she gives us our room keys nevertheless.\n<<HotelRoom>> <<MusicStop>>\nWe walk into our room.\nIt’s nice enough from what we can see so far.\nI go to the light switch and flip it on.\n...\nIt’s broken…\n...\n<<Idiot>>\nGosh aren’t I just the happies, jolliest fellow alive right now.\n<<KatieAppear>> <<KatieNormal>> \nI turn to Katie.\n<<Kishimoto>> \nThe lights don’t work.\n<<Katie>> <<KatieShockedNormal>> <<ScreenShake>>\nReally?\n<<KatieNormal>>\n*sigh* well I suppose the sun rises early here.\nAnd we sleep when it’s dark anyway.\n<<Kishimoto>>\nYeah, I guess it’s not much of a problem.\n<<Katie>> <<KatieSmile1>>\nYeah…\n<<KatieFades>> <<NoOne>> \nWe locate the bedroom and start to get ourselves tucked in.\nWe’re both blushing immensely as we do, though it’s not as if we’re going to send one of us to sleep in the shower or on the couch.\n<<MusicStop>>\nWe lay our heads down on the pillows and close our eyes.\n<<BlackScreen>>\n...\nThis has been a really weird day.\nI mean, I woke up on the beach with Katie hugging me, and now I’m going to sleep in some random hotel in Tokyo.\nAgain with Katie.\nI didn't think on Monday when we first met I’d be sleeping with her six days later.\n...\nI suppose I feel a little homesick…\nBut I’d rather be here with Katie.\n...\nToday was a weird day.\n<<Date>>\n...\nW…\n<<Ain'tHappening>> <<Phyc>> \n…w-where am I?\n...\nI don’t think this is a dream… is it?\nI begin to walk around.\nThe atmosphere of this place is offsetting.\nThere’s so many cars, yet no one is driving them.\nThey all sit in idle.\nThey move up and down rapidly as if their engines are on, though make no noise.\nIt feels like I just came into a different world where time has stopped.\n...\nI’m scared.\nIs Katie here?\nIs…\n…what is this?\n<<Kishimoto>> \nUh…\n<<NoOne>> \nSeriously, what the hell is this?\nI’m fully conscious, definitely not dreaming.\nAh… shit…\nI have a bad headache all of a sudden.\nI stand there, gripping my head.\nI don’t know what’s going on…\n<<???>>\nI’ve been able to speak English this whole time?!\nEr… uh, heh, not really Fuji…\nD-did… did you just call m-me?…\nFuji? Fuji?\nWake up Fuji! Are you alright?!\n<<Kishimoto>>\nHuh?\nNo way...\n<<???>> \nOh you’ve got to be kidding me…\nI hope Kishi’s here…\n<<Kishimoto>> <<ScreenShake>> \nKISHI?!?!?!\n<<NoOne>>\nI know Fujinami’s reaction was pathetic, and mine is too, but I honestly can’t blame him…\n<<???>>\nHuh? Kishimoto?\n<<NoOne>>\nAw…\nI walk to where I hear her voice coming from.\n<<KatieAppear>> <<Katie>> <<KatieLuagh>>\nKishimoto!\n<<Kishimoto>>\nThat is my name.\n<<NoOne>>\nDespite my sarcastic comment, I still give a warm smile, as if to say: “I’m just joking!”\n<<Katie>> <<KatieSmile2>> \nI’m so happy you’re here!\n<<NoOne>> \nShe runs up to me and hugs me.\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>> <<FujiNormal>>\nHuh, Kishimoto-\n<<FujiShocked>>\n...\n<<NoOne>>\nFujinami seems to be speechless at the sight of me and Katie hugging.\nI probably shouldn’t let him run off like he usually does.\nHe’d probably die for all I know.\n<<Kishimoto>>\nSeriously Fujinami, this really isn’t the kind of place where you’d want to be running off.\n<<Fujinami>> \nU…y-yy-u-u-h…\n<<NoOne>>\nHe’s just standing there muttering like an idiot.\nWell, not so much “like an idiot”.\nHe’s less “like an idiot” and more of… well… just an idiot.\n<<Kishimoto>>\nHey Katie?\n<<FujinamiFades>> <<KatieAppear>> <<Katie>> <<KatieSmile1>>\nYeah?\n<<Kishimoto>>\nThis guy’s a lost cause, let's ditch him.\n<<Katie>> <<KatieShockedNormal>> \nWha?! We can’t do that!\nHe’s your friend!\n<<Kishimoto>> \nNah, it’s more of a one-sided relationship.\nI’m his friend, but it doesn’t really go the other way.\n<<Katie>> <<KatieNormal>> \nUh…\n<<Kishimoto>>\nErm, yeah forget it.\nI’m… his…\n<<NoOne>>\nWhile Katie has convinced me to go back on my word, I still can’t bring myself to say I’m his… f… f-f-f-f… f-friend…\nIt pains me to say it even in my head.\n<<Kishimoto>>\n…his… f-f-f… his f-friend…\n<<Katie>> <<KatieSmile1>> \nU-um, okay!\n<<NoOne>>\nI’m genuinely impressed I was able to do that in front of Katie.\nGranted, I’m pretty sure I actually did tell her he was my friend in the past.\nBut that was only because it was the easiest way to explain the situation.\nI truly regret saying that…\n<<KatieFades>> <<FujinamiAppear>> <<FujiSad>>\nFujinami is in tears now.\n<<Kishimoto>> \nWhy are you crying?\n<<Fujinami>>\nYou actually said that we’re…\n…that we’re friends.\nI feel touched…\n<<NoOne>> \nFuck me.\n<<Kishimoto>>\nOkay awesome, great that you’re so touched by one of the last sentences you hear.\n<<FujinamiFades>> <<KatieAppear>> <<KatieShockedNormal>> <<Katie>>\nHuh?! Are you going to kill him?!\n<<Kishimoto>>\nNo, he’s just going to go ahead and do something really stupid and get himself killed.\nI mean, none of us have any clue as to what’s going on.\n<<Katie>> <<KatieNormal>>\nOh um… I’ve…\n<<KatieSad>> \nOh… I’ve… I’ve actually been here before…\nMany times… actually…\n<<Kishimoto>> \nWait what?!\n<<NoOne>> \nShe seems ashamed of that actually.\n<<Kishimoto>>\nWait, so, do you know what this is?\n<<Katie>>\nUm, yes…\nIt’s the secret eighth day of the week.\n<<Kishimoto>>\nWhat?\n<<Fujinami>>\nHuh?!\n<<Kishimoto>>\nWait, how come we seem to be the only ones here? Or do you not know that?\n<<Katie>>\nWell, I’m not too sure exactly why…\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>> <<FujiNormal>>\nDo you know why we’re here at least?\n<<FujinamiFades>> <<KatieAppear>> <<Katie>>\nWell… sort of.\nIf I remember correctly, when you feel strong emotions of any kind, you’re brought here…\n<<Kishimoto>>\n...\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>> <<FujiNormal>>\nHuh? But I’m completely fine.\n<<FujinamiFades>> <<KatieAppear>> <<Katie>> <<KatieNormal>>\nWell, I’m pretty sure you bring the people you feel like you can count on most with you…\n<<KatieFades>> <<FujinamiAppear>> <<NoOne>> <<FujiShocked>>\nI turn to Fujinami.\nHe’s staring at me with a mix of shock and joy.\n<<Kishimoto>>\nNo way.\n<<FujinamiFades>> <<KatieAppear>> <<Katie>> <<KatieNormal>>\nHuh?\n<<Kishimoto>>\nEr, nevermind.\nAnyway, I’m still not too sure why we’re here…\nDid you bring us along?...\nIf so, I didn’t know how close you were to Fujinami…\nNot only are you not adding honorifics to his name, but “Fuji”...\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>> <<FujiShocked>>\nW-... wah… w-w… yuh…\n<<NoOne>> <<FujinamiFades>> <<ScreenShake>>\nFujinami faints.\n<<KatieAppear>> <<Katie>> <<KatieShockedNormal>>\nI!... I-it’s not like that! I swear!\n<<NoOne>>\nI give her a soft smile.\n<<KatieNormal>>\nShe seems to get the idea I was making a joke and calms down.\n<<Kishimoto>>\nBut yeah no, why are we here?\n<<Katie>> \nWell, I already overcame my strong emotions…\nFujinami says he’s fine…\n<<KatieSad>>\nSo um…\n<<Kishimoto>>\n...\n<<Katie>>\n...\n<<Kishimoto>>\nI guess it’s not like I didn’t start bawling the other day and ran off to Tokyo with you…\n<<Katie>>\n...\n<<KatieSmile1>>\nIt’s… it’s nothing to be embarrassed about Kishimoto…\nAs I said, I was going through stuff too…\n<<KatieSmile2>>\nIf anything, I’m quite happy with this!\n<<Kishimoto>> \nHuh?\n<<Katie>> <<KatieLuagh>>\nI’m touched by how highly you think of me!\n<<Kishimoto>>\nHuh? Oh… yeah…\nSo what now?\nDo we just sit around and wait for the day to end?\n<<Katie>> <<KatieSmile1>>\nWell, not exactly.\n<<KatieNormal>>\nI’m pretty sure this is just a dream.\n<<Kishimoto>>\nHuh?\n<<Katie>> <<KatieSmile2>>\nUm… yeah I’m not too sure I’m making sense here.\n<<KatieSmile1>>\nTo put it simply, we’re all conscious during your dream.\nThat goes for you too.\n<<Kishimoto>> \nAwesome, I still don’t understand.\nAnyway, how do we get out?\n<<Katie>> <<KatieNormal>> \nWell there should be a bed somewhere around here.\nWe just have to find that and sleep in it.\n<<Kishimoto>> \nWhat? A bed?\nThat makes no sense!\nBut uh, granted, none of this really makes sense, so I should probably just take it at face-value.\nAnyway, does only one person have to sleep in it to get us all out?\n<<Katie>>\nI’m not too sure, but… maybe…\n<<Kishimoto>>\nWhy don’t we all split up and then return back here in around an hour or two and report our findings?\nOnce Fujinami wakes up of course…\n<<Katie>>\nUm… well…\n<<KatieSmile1>> \nYou see, the whole reason you’re here Kishimoto is to tackle your emotions and thoughts and attempt to get rid of the bad ones…\n<<Kishimoto>>\nHuh? You just said that didn’t you?\n<<Katie>>\nUm, well no…\nI don’t think I’ve mentioned that you’re here to get rid of them yet…\n<<Kishimoto>>\nHuh? What do you mean by “get rid of them”?\nThe negative emotions?\n<<Katie>> <<KatieNormal>> \nUm… yeah…\n<<Kishimoto>> \nAnd how do I do that?\nAnd wait, sorry, but how does that stop from splitting up?\n<<Katie>> \nWell you see, your negative emotions take form as shadow monsters here…\n<<Kishimoto>> \nHuh? W-what?\n<<Katie>>\nUm, yeah. When I say that you have to “get rid of your negative emotions” I mean that literally.\n<<KatieSmile1>>\nOnce you’ve killed all the monsters here, then your problem will be solved and when you leave, whatever’s making you anxious will disappear!\n<<Kishimoto>>\nUm…\n<<NoOne>>\nWhat could it be that I’m so stressed about though?\n<<Katie>> <<KatieShockedNormal>>\nO-oh, or the anxiety itself will just disappear!\nA-and the monsters are passive! They won’t attack you!\n<<KatieSmile1>>\nYou'll need to face your inner demons either by yourself or with all your friends!\n<<Kishimoto>>\nUm…\n…what…\n<<NoOne>> \nI hesitate to ask my question.\nI feel like I might end up prying a little too much into her personal life.\n...\n<<Kishimoto>>\nWhat was your anxiety? What happened afterwards?\n<<NoOne>>\nI ask anyway.\nShe gives a little smile.\n<<Katie>> <<KatieSmile2>> \nI’m glad you asked that Kishimoto!\n<<KatieSmile1>> \nWell, I was dealing with loneliness…\nIt was when my family first moved here…\nJapan, I mean.\nMy dad was faced with a big business opportunity and accepted it.\nWe had to move over here due to that.\n<<NoOne>>\nI listen intently.\n<<Katie>> \nWhen I first started coming to school, everyone was really curious about me!\nI was pretty popular, but I wasn’t able to communicate with anybody.\n<<KatieSad>>\nAnd eventually they just gave up on me…\n<<NoOne>>\nI know all of this already, though I try to pretend I don’t.\n<<Katie>>\nThat’s when I started coming to the eighth day…\nI would always run away from the monsters… my anxieties…\nI kept and kept running away from my problems every time I came here…\nI searched up stuff about the eighth day online and I saw that quite a few people were actually talking about it…\nA lot of other people were going through the same thing I was.\nBut nobody seemed to believe them…\n<<NoOne>>\nFair enough.\nI mean, a secret “eighth day of the week” seems like such an absurd concept that if someone told me it actually existed, I probably would believe it either.\n<<Katie>> \nSo I decided to keep quiet about it to my parents…\n<<KatieNormal>>\nThe internet is actually where I found out all the information I’ve been telling you.\n<<Kishimoto>>\nHeh, I figured.\n<<NoOne>>\nI didn’t actually, I just said whatever came to my head.\n<<Katie>> \nIt seemed as if it was only happening to teenagers.\nIt also seemed like a more recent phenomenon.\nAnyway, I eventually gathered enough confidence to fight the monsters…\n…even though by that point I had realized that they’re passive, they’re still scary nevertheless.\n<<KatieSmile1>>\nAnd when I did that, the Monday I woke up, you came to me.\n<<Kishimoto>>\nUh-\n<<NoOne>>\nI don't know what to say.\nWow\nThat’s all I can think of.\n<<Katie>> <<KatieNormal>> \nBut it didn’t look like this when I was coming here though…\n<<Kishimoto>>\nHuh? What do you mean?\n<<Katie>> \nThis looks like some kind of big city of sorts, but mine was like… a house party.\nThere were all these weird-looking mannequins everywhere in my one.\n<<Kishimoto>>\nWhat the? That’s weird…\nWait sorry, so what do other people see when we’re in this “eighth day”?\n<<Katie>> <<KatieSmile1>> \nOh, I’m pretty sure it’s still Sunday for them and it just looks like we’re dreaming.\n<<KatieNormal>>\nI’m not too sure about that though…\nI kind of just made that up.\n<<Kishimoto>>\nEh, I’ll take it.\nIf you’re making it up, I’m assuming you’re still going off something.\nThat would mean that nothing happens to anybody else outside of here.\n<<Katie>> <<KatieSmile1>>\nYeah, they’ll be fine.\n<<KatieShockedNormal>> \nOh, by the way! Fighting monsters can get a little tiring! So if all of us run out of stamina in a fight, we’ll “lose” and start back at the beginning of the day!\nAnd I think I read somewhere that the more people in the eighth day, the more monsters there are.\n<<KatieSmile1>>\nSo we better make sure to evenly spread the effort out between the three of us!\n<<Kishimoto>>\nOh, got it.\nBut um… what exactly are we fighting with?\nI mean like, are we just going to punch the monsters?\n<<Katie>>\nOh yeah! If you reach behind your back, your sword should appear in your hand!\n<<Kishimoto>>\nHuh? Um…\n<<NoOne>>\nI reach behind my back and pull my hand back in front of me.\n<<Kishimoto>>\nOh, wow! It really works.\n<<Katie>>\nUh-huh!\n<<KatieFades>> <<FujinamiAppear>> <<FujiNormal>> <<NoOne>> \nFujinami’s back up.\n<<Fujinami>>\nEh, what did I miss?\n<<Kishimoto>>\nWe have to fight these super badass shadow monsters.\n<<Fujinami>> <<FujiShocked>>\nWha-\n<<FujinamiFades>> <<KatieAppear>> <<Katie>> <<KatieShockedNormal>>\nO-oh n-no, don’t worry! I’ll explain!\n<<KatieFades>> <<NoOne>> \nShe proceeds to explain the entire thing to Fujinami.\nHe occasionally breaks out into tears after hearing some of the information.\nThe conversation feels as if it would never end.\n<<KatieAppear>> <<Katie>> <<KatieSmile1>> \nThere! So we need to be strong for Kishimoto here, okay?\n<<NoOne>>\nHer voice is akin to a mother trying to calm their baby.\n<<KatieFades>> <<FujinamiAppear>> <<Fujinami>> <<FujiSad>>\n*sniffles* Y-yep!\n<<FujinamiFades>> <<KatieAppear>> <<Katie>> <<KatieSmile2>>\nGood!\nWhat a big boy you are!\n<<NoOne>>\nAs much as I love Katie, I have to say, I don’t really agree with the idea of calling a seventeen year old a “big boy”.\nLike yeah, no shit sherlock. They’re almost an adult!\nKatie turns to face me.\n<<Katie>> <<KatieSmile1>> \nReady Kishimoto?\n<<NoOne>>\n...\n<<Kishimoto>>\nReady as I’ll ever be.\n<<NoOne>>\nThat’s a lie.\nI have zero clue as to what I’m actually stressing over.\nBut to be honest, it does feel like there’s something bugging me…\n<<Katie>> \nYou lead the party, okay?\n<<Kishimoto>>\nYep!\n<<NoOne>>\nI go along with the whole thing anyway.\nI give her a warm smile.\n<<Kishimoto>>\nI’m saying we just head straight along this street for now.\n<<MusicStop>> <<NoOne>> \nWe head off.\n<<EDay>>\n...",
		"position": {
			"x": -223,
			"y": -384
		},
		"colorID": 0
	}
]