[
	{
		"title": "Game",
		"tags": "",
		"body": "<<NoOne>> \nWe cautiously proceed down the streets.\n<<Kishimoto>>\nOkay guys, stay behind me.\n<<Fujinami>>\nHuh? But I thought the monsters can’t hurt us?\nW-why are we being so c-careful?\n<<Katie>>\nKishimoto probably just wants to walk slowly in case we see an exit!\nAfter all! We won’t be able to see it if we rush!-\n<<Fujinami>> <<ScreenShake>> \nWE’RE ALL GOING TO FUCKING DIE!!! AHHHHHHHHHHHH!!!!\n<<Kishimoto>>\nDude, Fujinami, calm the hell down!\n<<Katie>>\nAhh! Fujinami! Please stop running away!!\nWe have to fight the monsters together if we want to defeat them, remember?\n<<Fujinami>> \nAHHHHHHHHH!!!\n<<Kishimoto>>\nFujinami! Come back here this instant!!!\n<<Fujinami>>\nAHHHHHH!!! PLEASE DON’T TAKE AWAY MY PLAYSTATION AGAIN MOM!!!\n<<Kishimoto>>\nUh, mom? Hey! Who the hell do you think I am?\n<<Katie>>\nPlease Fujinami! Come back!\n<<Fujinami>> \nNOOOOOOO!! HELP!!!!\n<<Kishimoto>>\nUm… uh here, Katie will give you a kiss if you come back!\n<<Katie>> <<ScreenShake>> \nW-wha?!\n<<Fujinami>> <<ScreenShake>>\nREALLY?!?!!?\n<<NoOne>>\nFujinami runs back to us at the speed of light; Katie’s profile is nothing short of dismayed.\n<<Kishimoto>> \nUh, you don’t actually have to, Katie.\nActually, I would strongly recommend not doing it.\nHe’s probably more dangerous than the monsters.\nOh, wait actually, speaking of monsters there’s some right here.\nWe kinda need to defeat them if we don’t want to be back here so-\n<<Fujinami>> <<ScreenShake>>\nAAHHHHHH!!! MONSTERS!!!!\n<<Kishimoto>>\nCalm down Fujinami! They’re literally just standing there!\n<<NoOne>>\nThis guy is such an idiot.\n<<Fight>>\nSurprisingly, we get past the monsters and proceed down the streets.\nOnly made surprising though by the fact that Fujinami was screaming his head off for the duration of the fight.\nThough I don’t know if you could really call it a fight.\nIt’s really less of a fight and more of just… well… a straight up attack.\n<<Kishimoto>>\nSee Fujinami, was that really that bad?\n<<Fujinami>>\nW… b… b… u…\n<<Kishimoto>> \n...\nWhat?\n<<Katie>>\nUm, are you alright Fujinami?\n<<Fujinami>>\nNuh…\n<<NoOne>>\nIs that a no?\n<<Kishimoto>>\nHm? Oh look, there’s more monsters here.\n<<Katie>>\nOh, um… Is Fujinami really able to fight?\n<<Kishimoto>>\nYeah, he’ll be fine.\n<<NoOne>>\nAt least I hope.\n<<Fight>> \nWe continue down the streets until we run into yet another group of monsters.\nFujinami may be unable to talk by the looks of things, but he’s still able to fight.\nI seriously have zero idea as to what goes on inside that dude’s head.\n<<Fight>>\nWe emerge victorious from yet another fight.\n<<Kishimoto>>\nUm… Fujinami is being surprisingly… useful?\nLike… considering his current state and all… and the fact he’s Fujinami.\n<<Katie>> \nYeah he… is actually.\nOh, look, there’s more monsters!\n<<NoOne>>\nI suppose we can’t progress without another fight.\n<<Fight>> \nWe continue down the street until we come across another group of monsters.\nI don’t think I’ve seen Fujinami blink in a while now…\n<<Fight>>\nWe proceed in our endeavor until we come to yet another group of monsters.\nThere sure are a lot of monsters, aren’t there?\nIs this… showing how much stress and worries I have?\n<<Fight>>\nWe continue down the street after finishing yet another fight.\n<<Katie>>\nHey um… do you think each world is tailored to each person?\n<<Kishimoto>>\nHuh? Um, well that would make sense I suppose.\nBut then why is mine a city?\n<<Fujinami>> <<ScreenShake>> \nMONSTERS!!!!!\n<<Kishimoto>> \nHuh? Oh, so there is.\n<<NoOne>>\nThat’s the first word I’ve heard him say in who-knows how long now.\n<<Fight>> \nWinning the fight, we proceed down the street.\nGranted I don’t think we’re really able to “lose” any of these fights in the traditional sense per se.\n<<Katie>>\nOh! Kishimoto! Monsters!\n<<Fujinami>> <<ScreenShake>> \nMONSTERS!!!!!!!!\n<<NoOne>>\nThank you Fujinami.\n<<Fight>> \nWoah dude, there really are a lot of monsters, aren’t there?\n<<Kishimoto>>\nHey, how big is this place would you know?\n<<Katie>>\nUm… I’m not really too sure.\n<<Fujinami>> <<ScreenShake>>\nMONSTERS!!!!!!!\n<<NoOne>>\nFujinami is actually being surprisingly helpful now.\n<<Fight>>\nMan, I’m getting sort of tired now.\n<<Fujinami>> <<ScreenShake>>\nMONSTERS!!!!!!!\n<<NoOne>>\nMore? Really?\n<<Fight>>\nWe finish another fight.\n<<Katie>> \nOh, look! More-\n<<Fujinami>> <<ScreenShake>>\nMONSTERS!!!!!!!\n<<NoOne>>\nDoes he need to scream THAT loudly?\n<<Fight>> \nWe continue walking down the street after finishing yet another fight.\n<<Katie>>\nI think we’re coming to the end of this street!\n<<Kishimoto>>\nReally? That’s great news then!\n<<Fujinami>> <<ScreenShake>>\nMONSTERS!!!!!!!\n<<NoOne>>\nPlease shut up…\n<<Fight>>\nWe finish the fight and walk to the end of the street.\n<<Kishimoto>>\nHuh, I suppose this really is the end of this street.\nWe should go back to where we started and go down the other two.\n<<Katie>>\nYeah, that sounds like a plan!\n<<NoOne>> \nWhat else would a plan sound like?\n<<Kishimoto>>\nOkay, let’s start making our way back down.\n<<NoOne>> \nWe begin to retrace our steps.\n<<Fujinami>> <<ScreenShake>>\nAH!\n<<Kishimoto>> \nWhat!? What is it?!\n<<Fujinami>>\nI…\n…I just died…\n<<Kishimoto>> \nUh, what?\n<<Fujinami>> \nYeah man…\n<<Kishimoto>>\nUm… no, you didn’t. You’ve been here with us screaming “MONSTERS!!!!” all this time.\n<<Katie>>\nUm, are you okay Fujinami?\n<<Fujinami>> \nI was in a better place…\n…a place full of happiness and joy…\n<<NoOne>> \nWhat is he going on about?\n<<Katie>>\nOh, um… that’s… nice…\n<<Fujinami>> \n…a place full of wonder…\n…a place full of knowledge…\n…a place unlike any other…\n…a strip club.\n<<Kishimoto>>\nJust how much weed do you smoke?\n<<Katie>> \nHuh? Oh Kishimoto, we’re back!\n<<Kishimoto>> \nOh, so we are.\n<<Katie>> \nAre we going right or left?\n<<Fujinami>> \nI think we should go right!\n<<Kishimoto>> \nThen why are you pointing left?!\n<<NoOne>> \nYou know, I think I prefer the Fujinami we just had.\n<<Kishimoto>>\nOkay, I suppose we’ll just go left.\n<<Fujinami>>\nAh yeah! Okay let’s go!\n<<NoOne>>\nWe all begin to walk down the left street.\n<<Katie>>\nWait, Fujinami’s not with us!\n<<Kishimoto>> \nHuh? Wait, what do you mean?\n<<NoOne>> \nI turn around, only to see Fujinami walking down the right street.\n<<Kishimoto>>\nDude, Fujinami! Come back!\n<<Fujinami>> \nHuh? I thought we’re going down the left street?\n<<Kishimoto>> \nAnd we are! You’re going down the right street imbeciel!\n<<Fujinami>> \nHuh? Why are you getting so angry? You just even said yourself, I’m going down the right street.\n<<Kishimoto>> \nYeah, and we’re going down the left!\n<<Fujinami>> \nBut… you’re going down the wrong street, aren’t you?\nThe one I’m going down is the right one. The left one.\n<<NoOne>>\nCan this guy seriously not tell his lefts from his rights?\n<<Katie>> \nUm, heh, Fujinami, we mean right as in the direction…\n<<Fujinami>> \nWhat?\n<<Kishimoto>>\nOkay Fujinami! The right street is now the wrong one!\n<<Fujinami>> \nOh okay!\n<<NoOne>>\nHe walks back over to us.\n<<Kishimoto>> \n*sigh*\n<<Katie>> \nOh look Kishimoto! Monsters!\n<<NoOne>>\nI’m so done with this.\n<<Fight>>\nWe continue to walk down the street; running into yet another group of monsters.\nIf this street is as short as the last then we shouldn’t be here too long.\n<<Fight>> \nWe finish our fight and continue walking.\n<<Fujinami>>\nYo Kishimoto! There’s monsters to your left!\n<<NoOne>>\nThat’s the right Fujinami…\n<<Fight>>\nWe emerge as the victor of our fight and proceed further down the street before running into yet another group of monsters.\nIf the bed isn’t on this street, it should be on the other one then.\n<<Fight>>\nOur group continues down the street after winning our fight.\nAfter a while of walking, we run into yet another group of monsters.\n<<Fight>>\nWe finish our fight and continue down the street.\nAfter another little while of walking we come across another group of monsters.\n<<Fight>>\nWe win the fight and continue our exploration.\nAfter walking for a little longer we run into another group of monsters.\nI think we’re starting to approach the end of this street now.\n<<Fight>>\nAfter finishing our fight we continue to proceed down the street.\n<<Fujinami>>\nYo, I think we’re getting to the end of the street!\n<<Katie>>\nHuh? Oh yeah, good eyesight Fujinami!\n<<Fujinami>>\nHeh, yeah. I’m actually the best looker in the world.\n<<Kishimoto>> \nThe hell is a “looker”?\n<<Fujinami>>\nSomeone who looks, duh.\n<<Katie>> \nUm… I don’t really understand.\n<<Kishimoto>>\nI don’t think there’s much point in trying to, Katie.\n<<Fujinami>> \nHa, I shall now use my misunderstood talent of “looking” to look at those monsters over there!\n<<NoOne>>\nWhat is this guy on?\n<<Fight>> \nWe win our fight and move on to the end of the street.\nSurprisingly the bed is actually here!\n<<Fujinami>>\nHey guys look, it’s the bed! But I looked at it first cause’ I’m way better at looking than all of you non-professional lookers.\n<<Kishimoto>> \nFujinami, please shut up.\n<<Fujinami>>\nSorry, if you couldn’t tell I’m kind of better with my eyes than my mouth, so I don’t really know how to do that.\n<<NoOne>>\nWhy does he sound proud of that?\n<<Katie>>\nOkay, well I’m sure there’s still some monsters left on that other street!\nSo we should probably go there and come back here!\n<<Kishimoto>>\nSounds good to me.\n<<Fujinami>>\nYeah! I really want to look at what’s on the left street.\n<<NoOne>> \nWe’re on the left street…\n<<Kishimoto>>\nOkay, well we’re not going to get very far by just standing here, so we should probably go now.\n<<Katie>>\nYep!\n<<NoOne>> \nWe make our way toward the right street, Fujinami excitedly demonstrating his “looking” abilities by looking at as many things as he can.\nI figure it’s better not to engage so I just leave him to it.\n<<Katie>> \nOkay, we’re here now!\n<<Kishimoto>>\nIndeed we are.\n<<Fujinami>>\nAlright! Time for me to look at everything down here!\nWatch this Katie!\n<<Katie>>\nUm… I’ll try…\n<<NoOne>>\nI bet she really regrets giving him that compliment now.\nThat’s probably the only complement he’s ever received from a woman that isn’t his mom.\n<<Fujinami>>\nHEY KATIE! I see monsters over there! Can you see them?\n<<Katie>>\nOh um, yeah I can-\n<<Fujinami>> \nNO YOU CAN’T!! I’M JUST SO MUCH BETTER AT LOOKING THAN YOU!! HAHAHAHH!!!\n<<NoOne>>\nAnd then I wonder why.\n<<Fight>> \nWe continue down the street.\n<<Fujinami>> \nHAHAH! I CAN THESE THOSE MONSTERS ON MY RIGHT OR LEFT AND YOU CAN’T! HAHAHAHAH\n<<NoOne>> \nWe can Fujinami…\nAnd what do you mean “on your right or left”?\nJust pick one!\n<<Fight>> \nWe finish our fight and move on.\n<<Fujinami>> \nI bet you guys didn’t see those monsters we just fought, or the one’s we’re about to fight right now!\nAHAHAHHA!!!\n<<NoOne>> \nPlease shut up.\n<<Fight>>\nI guarantee you Fujinami is going to say something stupid right now.\n<<Fujinami>>\nI bet you guys can’t see ANY of these monsters!\nCause’ you guys just suck at looking so much.\n<<NoOne>>\nAh, my prediction was wrong.\nHe actually ended up saying something stupid AND annoying.\n<<Katie>>\nGood… job… Fujinami…\n<<Fujinami>> \nHa! No problem!\n<<NoOne>>\n“No problem”?\n<<Fujinami>>\nRemember Katie, if you ever need someone to look at something for you, you know the guy to call!\n<<Katie>>\nUm… yeah, I’ll make sure to remember in case I ever need to… look at something.\n<<Kishimoto>>\nYo, guys, monsters.\n<<Fujinami>> \nAh-ha Kishimoto! You may have verbally pointed it out, but I still saw it first!\n<<Kishimoto>>\nWeren't you just saying a second ago about how we apparently couldn’t see the monsters at all?\nLike what? Have you just admitted defeat?\n<<Fujinami>>\nHeh, well I’ll accept a bit of competition, but I’m still the best.\n<<NoOne>> \nOkay, can we just fight?\n<<Fight>>\nWe finish yet another fight and continue down the street until we encounter another group of monsters.\nEven while in combat Fujinami is still saying stupid things.\nI wouldn’t even mind it as much if he hadn’t just completely made up all the stuff he’s bragging about being good at.\nI’m willing to bet money there’s no such thing as a “professional looker”.\nDude, he’s going to get such a wake up call when we go back to the real-world.\n<<Fight>>\nAfter finishing our fight, we continue to proceed down the street.\nAfter a short while of walking we encounter a group of monsters.\n<<Fight>>\nWe win our battle and continue on.\n<<Katie>>\nOh! I see some monsters, Kishimoto!\n<<Fujinami>> \nAh… another contender I see…\n<<NoOne>> \nWill he ever shut up?\n<<Fight>>\nAfter completing yet another fight, we continue to explore down the street.\n<<Kishimoto>> \nYo guys! Monsters!\n<<Fujinami>> \nKishimoto! You…! I was JUST about to point those out!\n<<NoOne>>\nWere you now?\n<<Fight>>\nWe emerge victorious from yet another battle and proceed with our exploration.\nI think we’re starting to come to the end of this street.\nI’m not too sure though.\n<<Fujinami>>\nMonsters!\n<<Kishimoto>>\nHuh? Where?\n<<Fujinami>>\nRight in front of us! Though you guys just aren’t good enough at looking to see them.\n<<Kishimoto>>\nYep, uh-huh. Let’s keep going guys.\n<<NoOne>>\nWe proceed down the roads.\n<<Katie>>\nOh look! More monsters ahead!\n<<Fujinami>> \nI SAW THOSE FIRST!!\n<<Kishimoto>>\nFujinami! Quit it, will ya?\n<<Fujinami>>\nHa! Jealous of my talents, are we?\n<<Kishimoto>>\nNo I’m not! Because your talent doesn’t exist!\n<<Fujinami>> \nNope! You’re wrong! If you can be complemented for something, it means you can be good at it! And if you can be good at something, that means you can be talented at it!\n<<NoOne>>\nHis logic is skewed in more ways than one.\n<<Fight>>\nWe finish our fight and proceed further down the street.\n<<Katie>>\nHuh? Oh, look at that! We’ve come to the end of this street!\n<<Kishimoto>>\nOh! Well I suppose all that’s left to do then is to walk back to the bed.\n<<Fujinami>>\nYeah, that’s on the right street, right?\n<<Kishimoto>>\nNo Fujinami, we’re ON the right street.\n<<Fujinami>>\nDude, can you really not tell your rights from your lefts?\n<<NoOne>>\nWe’ve only been here for an hour or-so, but this guy’s already gotten too used to saying stupid things and not getting punched in the face for it.\n<<Kishimoto>>\nOkay guys, off we go I suppose.\n<<Katie>>\nYep!\n<<NoOne>>\nWe begin to walk back down the street.\nWe’re basically walking down two entire streets, so the walk is quite long, but we still arrive at the bed after a while nevertheless.\n<<Kishimoto>>\nSo what? Do we just like, all cimb into it and then we arrive at…\nActually, where do we arrive?\n<<Katie>>\nUm well, I used to always just wake up in my bed, so I’d assume you and I would wake up in the hotel room and Fujinami would just wake up in his bed.\n<<Fujinami>>\nW-wait, hotel room?...\nWait like… one of THOSE hotels?!\n<<ScreenShake>>\nONE OF THOSE HOTELS?!\n<<NoOne>>\nYou don’t need to say it twice.\n<<Katie>>\nHuh, uh? What’s he talking about Kishimoto?\n<<Kishimoto>>\n*sigh*\nHe thinks we went to a love hotel together, Katie.\n<<Katie>> \nHuh? A w-what?\n<<Kishimoto>> \nA love hotel. I’m sure you can figure out what it is if you put your mind to it.\n<<Katie>> \nUh, WHA-!?\n<<Kishimoto>>\nDude, Fujinami. I’m pretty sure they don’t allow minors in those kinda places.\n<<NoOne>>\nDespite me trying to explain everything to him, he doesn’t seem to be listening.\nHe looks to be in a trance of some sort; his mouth hanging wide open.\n<<Kishimoto>> \nEh… this is pointless…\nWell we should probably just get it over and done with, shouldn’t we?\nI mean, you and I, Katie have already done this before I suppose.\n<<Katie>>\nO-oh yeah…\n<<ScreenShake>> <<Fujinami>> \nWHAAAAAAATTTTTTTT!?!?!?!?!?!?!?\n<<Kishimoto>>\nDude, Fujinami! Will you just shut up and get into bed already? I mean- uh… uh you know the context of that sentence dude!\n<<NoOne>>\nFujinami, his mouth still hanging wide open, comes and tucks himself into bed with Katie and I.\nI hope I never have to have the experience of getting into bed with Fujinami ever again.\nI allow my body to relax, and proceed to close my eyes.\n<<EDay>>\nGod loves you.",
		"position": {
			"x": 573,
			"y": 193
		},
		"colorID": 0
	}
]